HloModule jit_predict_step, entry_computation_layout={(f32[50400]{0}, f32[4096,50400]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=5*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=10*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=15*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=20*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=25*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=30*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=35*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=40*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=45*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=50*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=55*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=60*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=65*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=70*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=75*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=80*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=85*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=90*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=95*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=100*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=105*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=110*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=115*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=120*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=125*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=130*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=135*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=140*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=145*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=150*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=155*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=160*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=165*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=170*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=175*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=180*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=185*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=190*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=195*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=200*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=205*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=210*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=215*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=220*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=225*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=230*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=235*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=240*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=245*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=250*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=255*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=260*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=265*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=270*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, f32[4096,4096]{1,0}, /*index=275*/f32[4096,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[16384]{0}, f32[4096,16384]{1,0}, /*index=280*/f32[4096]{0}, f32[16384,4096]{1,0}, f32[4096]{0}, f32[4096]{0}, f32[50400,4096]{1,0}, /*index=285*/s32[4,128]{1,0})->f32[4,128,50400]{2,1,0}}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true}

FileNames
1 "/root/hlo_dump/hf_llm_dump.py"
2 "/usr/local/lib/python3.12/dist-packages/transformers/models/gptj/modeling_flax_gptj.py"
3 "/usr/local/lib/python3.12/dist-packages/flax/linen/normalization.py"
4 "/usr/local/lib/python3.12/dist-packages/flax/linen/attention.py"
5 "/usr/local/lib/python3.12/dist-packages/flax/linen/linear.py"

FunctionNames
1 "<module>"
2 "predict_step"
3 "FlaxGPTJPreTrainedModel.__call__"
4 "FlaxGPTJForCausalLMModule.__call__"
5 "FlaxGPTJModule.__call__"
6 "FlaxGPTJBlockCollection.__call__"
7 "FlaxGPTJBlock.__call__"
8 "LayerNorm.__call__"
9 "_compute_stats"
10 "_compute_stats.<locals>.maybe_distributed_mean"
11 "_compute_stats.<locals>.maybe_distributed_mean.<locals>.<genexpr>"
12 "FlaxGPTJAttention.__call__"
13 "dot_product_attention_weights"
14 "Embed.__call__"
15 "_normalize"
16 "_abs_sq"
17 "Dense.__call__"
18 "FlaxGPTJAttention._split_heads"
19 "apply_rotary_pos_emb"
20 "rotate_every_two"
21 "FlaxGPTJAttention.setup"
22 "make_causal_mask"
23 "make_attention_mask"
24 "combine_masks"
25 "FlaxGPTJAttention._merge_heads"
26 "FlaxGPTJMLP.__call__"

FileLocations
1 {file_name_id=1 function_name_id=1 line=26 end_line=26 column=14 end_column=39}
2 {file_name_id=1 function_name_id=2 line=25 end_line=25 column=19 end_column=57}
3 {file_name_id=2 function_name_id=3 line=480 end_line=492 column=18 end_column=9}
4 {file_name_id=2 function_name_id=4 line=652 end_line=661 column=18 end_column=9}
5 {file_name_id=2 function_name_id=5 line=583 end_line=592 column=18 end_column=9}
6 {file_name_id=2 function_name_id=6 line=533 end_line=540 column=28 end_column=13}
7 {file_name_id=2 function_name_id=7 line=341 end_line=341 column=24 end_column=48}
8 {file_name_id=3 function_name_id=8 line=512 end_line=521 column=16 end_column=5}
9 {file_name_id=3 function_name_id=9 line=139 end_line=139 column=16 end_column=64}
10 {file_name_id=3 function_name_id=10 line=122 end_line=122 column=10 end_column=53}
11 {file_name_id=3 function_name_id=11 line=122 end_line=122 column=16 end_column=40}
12 {file_name_id=2 function_name_id=7 line=342 end_line=349 column=23 end_column=9}
13 {file_name_id=2 function_name_id=12 line=275 end_line=284 column=23 end_column=9}
14 {file_name_id=4 function_name_id=13 line=146 end_line=146 column=19 end_column=47}
15 {file_name_id=2 function_name_id=5 line=595 end_line=595 column=24 end_column=48}
16 {file_name_id=2 function_name_id=5 line=579 end_line=579 column=23 end_column=55}
17 {file_name_id=5 function_name_id=14 line=1194 end_line=1194 column=11 end_column=46}
18 {file_name_id=3 function_name_id=8 line=523 end_line=538 column=11 end_column=5}
19 {file_name_id=3 function_name_id=15 line=203 end_line=203 column=9 end_column=46}
20 {file_name_id=3 function_name_id=15 line=205 end_line=205 column=6 end_column=14}
21 {file_name_id=3 function_name_id=9 line=139 end_line=139 column=42 end_column=52}
22 {file_name_id=3 function_name_id=16 line=57 end_line=57 column=11 end_column=24}
23 {file_name_id=3 function_name_id=9 line=142 end_line=142 column=35 end_column=46}
24 {file_name_id=3 function_name_id=9 line=142 end_line=142 column=29 end_column=46}
25 {file_name_id=3 function_name_id=9 line=142 end_line=142 column=12 end_column=47}
26 {file_name_id=3 function_name_id=15 line=204 end_line=204 column=8 end_column=44}
27 {file_name_id=3 function_name_id=15 line=206 end_line=206 column=18 end_column=31}
28 {file_name_id=3 function_name_id=15 line=206 end_line=206 column=8 end_column=32}
29 {file_name_id=3 function_name_id=15 line=214 end_line=214 column=4 end_column=16}
30 {file_name_id=3 function_name_id=15 line=211 end_line=211 column=6 end_column=28}
31 {file_name_id=3 function_name_id=15 line=216 end_line=216 column=2 end_column=10}
32 {file_name_id=3 function_name_id=15 line=220 end_line=220 column=6 end_column=28}
33 {file_name_id=3 function_name_id=15 line=223 end_line=223 column=4 end_column=13}
34 {file_name_id=2 function_name_id=12 line=217 end_line=217 column=16 end_column=42}
35 {file_name_id=5 function_name_id=17 line=287 end_line=292 column=8 end_column=5}
36 {file_name_id=2 function_name_id=12 line=221 end_line=221 column=16 end_column=40}
37 {file_name_id=2 function_name_id=18 line=168 end_line=168 column=15 end_column=95}
38 {file_name_id=2 function_name_id=12 line=215 end_line=215 column=16 end_column=42}
39 {file_name_id=2 function_name_id=12 line=219 end_line=219 column=16 end_column=40}
40 {file_name_id=2 function_name_id=12 line=229 end_line=229 column=20 end_column=53}
41 {file_name_id=2 function_name_id=3 line=461 end_line=461 column=44 end_column=71}
42 {file_name_id=2 function_name_id=3 line=461 end_line=461 column=27 end_column=112}
43 {file_name_id=2 function_name_id=12 line=223 end_line=223 column=17 end_column=69}
44 {file_name_id=2 function_name_id=12 line=224 end_line=224 column=17 end_column=46}
45 {file_name_id=2 function_name_id=12 line=233 end_line=233 column=20 end_column=55}
46 {file_name_id=2 function_name_id=19 line=131 end_line=131 column=14 end_column=36}
47 {file_name_id=2 function_name_id=19 line=132 end_line=132 column=12 end_column=28}
48 {file_name_id=2 function_name_id=19 line=132 end_line=132 column=33 end_column=57}
49 {file_name_id=2 function_name_id=20 line=123 end_line=123 column=37 end_column=58}
50 {file_name_id=2 function_name_id=20 line=123 end_line=123 column=36 end_column=58}
51 {file_name_id=2 function_name_id=20 line=123 end_line=123 column=25 end_column=91}
52 {file_name_id=2 function_name_id=20 line=123 end_line=123 column=60 end_column=80}
53 {file_name_id=2 function_name_id=20 line=124 end_line=124 column=25 end_column=90}
54 {file_name_id=2 function_name_id=19 line=130 end_line=130 column=14 end_column=36}
55 {file_name_id=2 function_name_id=19 line=132 end_line=132 column=11 end_column=68}
56 {file_name_id=2 function_name_id=12 line=230 end_line=230 column=21 end_column=54}
57 {file_name_id=2 function_name_id=12 line=236 end_line=236 column=20 end_column=61}
58 {file_name_id=4 function_name_id=13 line=130 end_line=130 column=10 end_column=47}
59 {file_name_id=2 function_name_id=12 line=216 end_line=216 column=14 end_column=40}
60 {file_name_id=2 function_name_id=12 line=220 end_line=220 column=14 end_column=36}
61 {file_name_id=2 function_name_id=12 line=226 end_line=226 column=20 end_column=51}
62 {file_name_id=2 function_name_id=12 line=232 end_line=232 column=20 end_column=55}
63 {file_name_id=2 function_name_id=12 line=227 end_line=227 column=21 end_column=52}
64 {file_name_id=2 function_name_id=12 line=235 end_line=235 column=18 end_column=59}
65 {file_name_id=4 function_name_id=13 line=132 end_line=132 column=17 end_column=60}
66 {file_name_id=2 function_name_id=21 line=162 end_line=162 column=27 end_column=118}
67 {file_name_id=4 function_name_id=22 line=880 end_line=880 column=26 end_column=66}
68 {file_name_id=4 function_name_id=22 line=881 end_line=887 column=9 end_column=3}
69 {file_name_id=4 function_name_id=23 line=854 end_line=856 column=9 end_column=3}
70 {file_name_id=4 function_name_id=23 line=857 end_line=857 column=9 end_column=39}
71 {file_name_id=2 function_name_id=12 line=250 end_line=250 column=26 end_column=76}
72 {file_name_id=2 function_name_id=12 line=253 end_line=253 column=22 end_column=90}
73 {file_name_id=2 function_name_id=12 line=256 end_line=256 column=25 end_column=67}
74 {file_name_id=4 function_name_id=24 line=910 end_line=910 column=11 end_column=44}
75 {file_name_id=4 function_name_id=24 line=911 end_line=911 column=9 end_column=27}
76 {file_name_id=2 function_name_id=12 line=269 end_line=269 column=12 end_column=30}
77 {file_name_id=2 function_name_id=12 line=268 end_line=272 column=25 end_column=9}
78 {file_name_id=4 function_name_id=13 line=136 end_line=136 column=19 end_column=38}
79 {file_name_id=2 function_name_id=12 line=286 end_line=286 column=22 end_column=78}
80 {file_name_id=2 function_name_id=12 line=287 end_line=287 column=22 end_column=52}
81 {file_name_id=2 function_name_id=25 line=171 end_line=171 column=15 end_column=81}
82 {file_name_id=2 function_name_id=12 line=288 end_line=288 column=22 end_column=48}
83 {file_name_id=2 function_name_id=7 line=352 end_line=352 column=37 end_column=89}
84 {file_name_id=2 function_name_id=26 line=311 end_line=311 column=24 end_column=49}
85 {file_name_id=5 function_name_id=17 line=294 end_line=294 column=11 end_column=57}
86 {file_name_id=5 function_name_id=17 line=294 end_line=294 column=6 end_column=57}
87 {file_name_id=2 function_name_id=26 line=312 end_line=312 column=24 end_column=47}
88 {file_name_id=2 function_name_id=26 line=313 end_line=313 column=24 end_column=50}
89 {file_name_id=2 function_name_id=7 line=354 end_line=354 column=24 end_column=64}
90 {file_name_id=2 function_name_id=4 line=669 end_line=669 column=24 end_column=51}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=6}
7 {file_location_id=7 parent_frame_id=7}
8 {file_location_id=8 parent_frame_id=8}
9 {file_location_id=9 parent_frame_id=9}
10 {file_location_id=10 parent_frame_id=10}
11 {file_location_id=11 parent_frame_id=11}
12 {file_location_id=12 parent_frame_id=7}
13 {file_location_id=13 parent_frame_id=13}
14 {file_location_id=14 parent_frame_id=14}
15 {file_location_id=15 parent_frame_id=5}
16 {file_location_id=8 parent_frame_id=16}
17 {file_location_id=9 parent_frame_id=17}
18 {file_location_id=10 parent_frame_id=18}
19 {file_location_id=11 parent_frame_id=19}
20 {file_location_id=16 parent_frame_id=5}
21 {file_location_id=17 parent_frame_id=21}
22 {file_location_id=18 parent_frame_id=8}
23 {file_location_id=19 parent_frame_id=23}
24 {file_location_id=20 parent_frame_id=23}
25 {file_location_id=21 parent_frame_id=9}
26 {file_location_id=22 parent_frame_id=26}
27 {file_location_id=23 parent_frame_id=9}
28 {file_location_id=22 parent_frame_id=28}
29 {file_location_id=24 parent_frame_id=9}
30 {file_location_id=25 parent_frame_id=9}
31 {file_location_id=26 parent_frame_id=23}
32 {file_location_id=27 parent_frame_id=23}
33 {file_location_id=28 parent_frame_id=23}
34 {file_location_id=29 parent_frame_id=23}
35 {file_location_id=30 parent_frame_id=23}
36 {file_location_id=31 parent_frame_id=23}
37 {file_location_id=32 parent_frame_id=23}
38 {file_location_id=33 parent_frame_id=23}
39 {file_location_id=34 parent_frame_id=13}
40 {file_location_id=35 parent_frame_id=40}
41 {file_location_id=36 parent_frame_id=13}
42 {file_location_id=37 parent_frame_id=42}
43 {file_location_id=38 parent_frame_id=13}
44 {file_location_id=35 parent_frame_id=44}
45 {file_location_id=39 parent_frame_id=13}
46 {file_location_id=37 parent_frame_id=46}
47 {file_location_id=40 parent_frame_id=13}
48 {file_location_id=41 parent_frame_id=3}
49 {file_location_id=42 parent_frame_id=3}
50 {file_location_id=43 parent_frame_id=13}
51 {file_location_id=44 parent_frame_id=13}
52 {file_location_id=45 parent_frame_id=13}
53 {file_location_id=46 parent_frame_id=53}
54 {file_location_id=47 parent_frame_id=53}
55 {file_location_id=48 parent_frame_id=53}
56 {file_location_id=49 parent_frame_id=56}
57 {file_location_id=50 parent_frame_id=56}
58 {file_location_id=51 parent_frame_id=56}
59 {file_location_id=52 parent_frame_id=56}
60 {file_location_id=53 parent_frame_id=56}
61 {file_location_id=54 parent_frame_id=53}
62 {file_location_id=55 parent_frame_id=53}
63 {file_location_id=56 parent_frame_id=13}
64 {file_location_id=57 parent_frame_id=13}
65 {file_location_id=58 parent_frame_id=14}
66 {file_location_id=59 parent_frame_id=13}
67 {file_location_id=35 parent_frame_id=67}
68 {file_location_id=60 parent_frame_id=13}
69 {file_location_id=37 parent_frame_id=69}
70 {file_location_id=61 parent_frame_id=13}
71 {file_location_id=62 parent_frame_id=13}
72 {file_location_id=46 parent_frame_id=72}
73 {file_location_id=47 parent_frame_id=72}
74 {file_location_id=48 parent_frame_id=72}
75 {file_location_id=49 parent_frame_id=75}
76 {file_location_id=50 parent_frame_id=75}
77 {file_location_id=51 parent_frame_id=75}
78 {file_location_id=52 parent_frame_id=75}
79 {file_location_id=53 parent_frame_id=75}
80 {file_location_id=54 parent_frame_id=72}
81 {file_location_id=55 parent_frame_id=72}
82 {file_location_id=63 parent_frame_id=13}
83 {file_location_id=64 parent_frame_id=13}
84 {file_location_id=65 parent_frame_id=14}
85 {file_location_id=66 parent_frame_id=13}
86 {file_location_id=67 parent_frame_id=86}
87 {file_location_id=68 parent_frame_id=86}
88 {file_location_id=69 parent_frame_id=88}
89 {file_location_id=70 parent_frame_id=88}
90 {file_location_id=71 parent_frame_id=13}
91 {file_location_id=72 parent_frame_id=13}
92 {file_location_id=73 parent_frame_id=13}
93 {file_location_id=74 parent_frame_id=93}
94 {file_location_id=75 parent_frame_id=93}
95 {file_location_id=76 parent_frame_id=13}
96 {file_location_id=77 parent_frame_id=13}
97 {file_location_id=78 parent_frame_id=14}
98 {file_location_id=79 parent_frame_id=13}
99 {file_location_id=80 parent_frame_id=13}
100 {file_location_id=81 parent_frame_id=100}
101 {file_location_id=82 parent_frame_id=13}
102 {file_location_id=35 parent_frame_id=102}
103 {file_location_id=83 parent_frame_id=7}
104 {file_location_id=84 parent_frame_id=104}
105 {file_location_id=35 parent_frame_id=105}
106 {file_location_id=85 parent_frame_id=105}
107 {file_location_id=86 parent_frame_id=105}
108 {file_location_id=87 parent_frame_id=104}
109 {file_location_id=88 parent_frame_id=104}
110 {file_location_id=35 parent_frame_id=110}
111 {file_location_id=85 parent_frame_id=110}
112 {file_location_id=86 parent_frame_id=110}
113 {file_location_id=89 parent_frame_id=7}
114 {file_location_id=18 parent_frame_id=16}
115 {file_location_id=19 parent_frame_id=115}
116 {file_location_id=20 parent_frame_id=115}
117 {file_location_id=21 parent_frame_id=17}
118 {file_location_id=22 parent_frame_id=118}
119 {file_location_id=23 parent_frame_id=17}
120 {file_location_id=22 parent_frame_id=120}
121 {file_location_id=24 parent_frame_id=17}
122 {file_location_id=25 parent_frame_id=17}
123 {file_location_id=26 parent_frame_id=115}
124 {file_location_id=27 parent_frame_id=115}
125 {file_location_id=28 parent_frame_id=115}
126 {file_location_id=29 parent_frame_id=115}
127 {file_location_id=30 parent_frame_id=115}
128 {file_location_id=31 parent_frame_id=115}
129 {file_location_id=32 parent_frame_id=115}
130 {file_location_id=33 parent_frame_id=115}
131 {file_location_id=90 parent_frame_id=4}
132 {file_location_id=35 parent_frame_id=132}
133 {file_location_id=85 parent_frame_id=132}
134 {file_location_id=86 parent_frame_id=132}


%_where.1 (Arg_0.2: pred[4,128], Arg_1.2: s32[4,128], Arg_2.1: s32[4,128]) -> s32[4,128] {
  %Arg_0.2 = pred[4,128]{1,0} parameter(0)
  %Arg_1.2 = s32[4,128]{1,0} parameter(1)
  %Arg_2.1 = s32[4,128]{1,0} parameter(2)
  ROOT %select_n.1 = s32[4,128]{1,0} select(%Arg_0.2, %Arg_1.2, %Arg_2.1), metadata={op_name="select_n"}
}

%region_0.2 (reduce_and.3: pred[], reduce_and.4: pred[]) -> pred[] {
  %reduce_and.3 = pred[] parameter(0), metadata={op_name="reduce_and"}
  %reduce_and.4 = pred[] parameter(1), metadata={op_name="reduce_and"}
  ROOT %reduce_and.5 = pred[] and(%reduce_and.3, %reduce_and.4), metadata={op_name="reduce_and"}
}

%_take.3 (Arg_0.3: f32[50400,4096], Arg_1.3: s32[4,128]) -> f32[4,128,4096] {
  %Arg_1.3 = s32[4,128]{1,0} parameter(1)
  %constant.26 = s32[] constant(0)
  %lt.2 = s32[4,128]{1,0} broadcast(%constant.26), dimensions={}, metadata={op_name="lt"}
  %lt.3 = pred[4,128]{1,0} compare(%Arg_1.3, %lt.2), direction=LT, metadata={op_name="lt"}
  %constant.24 = s32[] constant(50400)
  %add.2 = s32[4,128]{1,0} broadcast(%constant.24), dimensions={}, metadata={op_name="add"}
  %add.3 = s32[4,128]{1,0} add(%Arg_1.3, %add.2), metadata={op_name="add"}
  %jit__where_.1 = s32[4,128]{1,0} call(%lt.3, %add.3, %Arg_1.3), to_apply=%_where.1, metadata={op_name="jit(_where)"}
  %broadcast_in_dim.8 = s32[4,128,1]{2,1,0} reshape(%jit__where_.1), metadata={op_name="broadcast_in_dim"}
  %constant.23 = s32[] constant(0)
  %ge.2 = s32[4,128,1]{2,1,0} broadcast(%constant.23), dimensions={}, metadata={op_name="ge"}
  %ge.3 = pred[4,128,1]{2,1,0} compare(%broadcast_in_dim.8, %ge.2), direction=GE, metadata={op_name="ge"}
  %constant.22 = s32[] constant(50399)
  %le.2 = s32[4,128,1]{2,1,0} broadcast(%constant.22), dimensions={}, metadata={op_name="le"}
  %le.3 = pred[4,128,1]{2,1,0} compare(%broadcast_in_dim.8, %le.2), direction=LE, metadata={op_name="le"}
  %and.1 = pred[4,128,1]{2,1,0} and(%ge.3, %le.3), metadata={op_name="and"}
  %constant.25 = pred[] constant(true)
  %reduce_and.7 = pred[4,128]{1,0} reduce(%and.1, %constant.25), dimensions={2}, to_apply=%region_0.2, metadata={op_name="reduce_and"}
  %broadcast_in_dim.9 = pred[4,128,4096]{2,1,0} broadcast(%reduce_and.7), dimensions={0,1}, metadata={op_name="broadcast_in_dim"}
  %Arg_0.3 = f32[50400,4096]{1,0} parameter(0)
  %gather.1 = f32[4,128,4096]{2,1,0} gather(%Arg_0.3, %broadcast_in_dim.8), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,4096}, metadata={op_name="gather"}
  %constant.21 = f32[] constant(nan)
  %broadcast_in_dim.7 = f32[4,128,4096]{2,1,0} broadcast(%constant.21), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.3 = f32[4,128,4096]{2,1,0} select(%broadcast_in_dim.9, %gather.1, %broadcast_in_dim.7), metadata={op_name="select_n"}
}

%region_1.4 (reduce_sum.3: f32[], reduce_sum.4: f32[]) -> f32[] {
  %reduce_sum.3 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.4 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.5 = f32[] add(%reduce_sum.3, %reduce_sum.4), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/0/ln_1/reduce_sum" stack_frame_id=11}
}

%region_2.5 (reduce_sum.10: f32[], reduce_sum.11: f32[]) -> f32[] {
  %reduce_sum.10 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.11 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.12 = f32[] add(%reduce_sum.10, %reduce_sum.11), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/0/ln_1/reduce_sum" stack_frame_id=11}
}

%region_3.6 (reduce_and.11: pred[], reduce_and.12: pred[]) -> pred[] {
  %reduce_and.11 = pred[] parameter(0), metadata={op_name="reduce_and"}
  %reduce_and.12 = pred[] parameter(1), metadata={op_name="reduce_and"}
  ROOT %reduce_and.13 = pred[] and(%reduce_and.11, %reduce_and.12), metadata={op_name="reduce_and"}
}

%_take_0.7 (Arg_0.5: f32[2048,64], Arg_1.5: s32[4,128]) -> f32[4,128,64] {
  %Arg_1.5 = s32[4,128]{1,0} parameter(1)
  %constant.38 = s32[] constant(0)
  %lt.6 = s32[4,128]{1,0} broadcast(%constant.38), dimensions={}, metadata={op_name="lt"}
  %lt.7 = pred[4,128]{1,0} compare(%Arg_1.5, %lt.6), direction=LT, metadata={op_name="lt"}
  %constant.36 = s32[] constant(2048)
  %add.11 = s32[4,128]{1,0} broadcast(%constant.36), dimensions={}, metadata={op_name="add"}
  %add.12 = s32[4,128]{1,0} add(%Arg_1.5, %add.11), metadata={op_name="add"}
  %jit__where_.3 = s32[4,128]{1,0} call(%lt.7, %add.12, %Arg_1.5), to_apply=%_where.1, metadata={op_name="jit(_where)"}
  %broadcast_in_dim.19 = s32[4,128,1]{2,1,0} reshape(%jit__where_.3), metadata={op_name="broadcast_in_dim"}
  %constant.35 = s32[] constant(0)
  %ge.13 = s32[4,128,1]{2,1,0} broadcast(%constant.35), dimensions={}, metadata={op_name="ge"}
  %ge.14 = pred[4,128,1]{2,1,0} compare(%broadcast_in_dim.19, %ge.13), direction=GE, metadata={op_name="ge"}
  %constant.34 = s32[] constant(2047)
  %le.6 = s32[4,128,1]{2,1,0} broadcast(%constant.34), dimensions={}, metadata={op_name="le"}
  %le.7 = pred[4,128,1]{2,1,0} compare(%broadcast_in_dim.19, %le.6), direction=LE, metadata={op_name="le"}
  %and.3 = pred[4,128,1]{2,1,0} and(%ge.14, %le.7), metadata={op_name="and"}
  %constant.37 = pred[] constant(true)
  %reduce_and.15 = pred[4,128]{1,0} reduce(%and.3, %constant.37), dimensions={2}, to_apply=%region_3.6, metadata={op_name="reduce_and"}
  %broadcast_in_dim.20 = pred[4,128,64]{2,1,0} broadcast(%reduce_and.15), dimensions={0,1}, metadata={op_name="broadcast_in_dim"}
  %Arg_0.5 = f32[2048,64]{1,0} parameter(0)
  %gather.3 = f32[4,128,64]{2,1,0} gather(%Arg_0.5, %broadcast_in_dim.19), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,64}, metadata={op_name="gather"}
  %constant.33 = f32[] constant(nan)
  %broadcast_in_dim.18 = f32[4,128,64]{2,1,0} broadcast(%constant.33), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.5 = f32[4,128,64]{2,1,0} select(%broadcast_in_dim.20, %gather.3, %broadcast_in_dim.18), metadata={op_name="select_n"}
}

%region_4.8 (reduce_max.3: f32[], reduce_max.4: f32[]) -> f32[] {
  %reduce_max.3 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.4 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.5 = f32[] maximum(%reduce_max.3, %reduce_max.4), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/0/attn/reduce_max" stack_frame_id=14}
}

%region_5.9 (reduce_sum.17: f32[], reduce_sum.18: f32[]) -> f32[] {
  %reduce_sum.17 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.18 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.19 = f32[] add(%reduce_sum.17, %reduce_sum.18), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/0/attn/reduce_sum" stack_frame_id=14}
}

%region_6.10 (reduce_sum.24: f32[], reduce_sum.25: f32[]) -> f32[] {
  %reduce_sum.24 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.25 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.26 = f32[] add(%reduce_sum.24, %reduce_sum.25), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/1/ln_1/reduce_sum" stack_frame_id=11}
}

%region_7.11 (reduce_sum.31: f32[], reduce_sum.32: f32[]) -> f32[] {
  %reduce_sum.31 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.32 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.33 = f32[] add(%reduce_sum.31, %reduce_sum.32), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/1/ln_1/reduce_sum" stack_frame_id=11}
}

%region_8.12 (reduce_max.10: f32[], reduce_max.11: f32[]) -> f32[] {
  %reduce_max.10 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.11 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.12 = f32[] maximum(%reduce_max.10, %reduce_max.11), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/1/attn/reduce_max" stack_frame_id=14}
}

%region_9.13 (reduce_sum.38: f32[], reduce_sum.39: f32[]) -> f32[] {
  %reduce_sum.38 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.39 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.40 = f32[] add(%reduce_sum.38, %reduce_sum.39), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/1/attn/reduce_sum" stack_frame_id=14}
}

%region_10.14 (reduce_sum.45: f32[], reduce_sum.46: f32[]) -> f32[] {
  %reduce_sum.45 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.46 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.47 = f32[] add(%reduce_sum.45, %reduce_sum.46), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/2/ln_1/reduce_sum" stack_frame_id=11}
}

%region_11.15 (reduce_sum.52: f32[], reduce_sum.53: f32[]) -> f32[] {
  %reduce_sum.52 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.53 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.54 = f32[] add(%reduce_sum.52, %reduce_sum.53), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/2/ln_1/reduce_sum" stack_frame_id=11}
}

%region_12.16 (reduce_max.17: f32[], reduce_max.18: f32[]) -> f32[] {
  %reduce_max.17 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.18 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.19 = f32[] maximum(%reduce_max.17, %reduce_max.18), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/2/attn/reduce_max" stack_frame_id=14}
}

%region_13.17 (reduce_sum.59: f32[], reduce_sum.60: f32[]) -> f32[] {
  %reduce_sum.59 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.60 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.61 = f32[] add(%reduce_sum.59, %reduce_sum.60), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/2/attn/reduce_sum" stack_frame_id=14}
}

%region_14.18 (reduce_sum.66: f32[], reduce_sum.67: f32[]) -> f32[] {
  %reduce_sum.66 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.67 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.68 = f32[] add(%reduce_sum.66, %reduce_sum.67), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/3/ln_1/reduce_sum" stack_frame_id=11}
}

%region_15.19 (reduce_sum.73: f32[], reduce_sum.74: f32[]) -> f32[] {
  %reduce_sum.73 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.74 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.75 = f32[] add(%reduce_sum.73, %reduce_sum.74), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/3/ln_1/reduce_sum" stack_frame_id=11}
}

%region_16.20 (reduce_max.24: f32[], reduce_max.25: f32[]) -> f32[] {
  %reduce_max.24 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.25 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.26 = f32[] maximum(%reduce_max.24, %reduce_max.25), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/3/attn/reduce_max" stack_frame_id=14}
}

%region_17.21 (reduce_sum.80: f32[], reduce_sum.81: f32[]) -> f32[] {
  %reduce_sum.80 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.81 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.82 = f32[] add(%reduce_sum.80, %reduce_sum.81), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/3/attn/reduce_sum" stack_frame_id=14}
}

%region_18.22 (reduce_sum.87: f32[], reduce_sum.88: f32[]) -> f32[] {
  %reduce_sum.87 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.88 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.89 = f32[] add(%reduce_sum.87, %reduce_sum.88), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/4/ln_1/reduce_sum" stack_frame_id=11}
}

%region_19.23 (reduce_sum.94: f32[], reduce_sum.95: f32[]) -> f32[] {
  %reduce_sum.94 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.95 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.96 = f32[] add(%reduce_sum.94, %reduce_sum.95), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/4/ln_1/reduce_sum" stack_frame_id=11}
}

%region_20.24 (reduce_max.31: f32[], reduce_max.32: f32[]) -> f32[] {
  %reduce_max.31 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.32 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.33 = f32[] maximum(%reduce_max.31, %reduce_max.32), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/4/attn/reduce_max" stack_frame_id=14}
}

%region_21.25 (reduce_sum.101: f32[], reduce_sum.102: f32[]) -> f32[] {
  %reduce_sum.101 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.102 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.103 = f32[] add(%reduce_sum.101, %reduce_sum.102), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/4/attn/reduce_sum" stack_frame_id=14}
}

%region_22.26 (reduce_sum.108: f32[], reduce_sum.109: f32[]) -> f32[] {
  %reduce_sum.108 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.109 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.110 = f32[] add(%reduce_sum.108, %reduce_sum.109), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/5/ln_1/reduce_sum" stack_frame_id=11}
}

%region_23.27 (reduce_sum.115: f32[], reduce_sum.116: f32[]) -> f32[] {
  %reduce_sum.115 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.116 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.117 = f32[] add(%reduce_sum.115, %reduce_sum.116), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/5/ln_1/reduce_sum" stack_frame_id=11}
}

%region_24.28 (reduce_max.38: f32[], reduce_max.39: f32[]) -> f32[] {
  %reduce_max.38 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.39 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.40 = f32[] maximum(%reduce_max.38, %reduce_max.39), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/5/attn/reduce_max" stack_frame_id=14}
}

%region_25.29 (reduce_sum.122: f32[], reduce_sum.123: f32[]) -> f32[] {
  %reduce_sum.122 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.123 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.124 = f32[] add(%reduce_sum.122, %reduce_sum.123), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/5/attn/reduce_sum" stack_frame_id=14}
}

%region_26.30 (reduce_sum.129: f32[], reduce_sum.130: f32[]) -> f32[] {
  %reduce_sum.129 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.130 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.131 = f32[] add(%reduce_sum.129, %reduce_sum.130), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/6/ln_1/reduce_sum" stack_frame_id=11}
}

%region_27.31 (reduce_sum.136: f32[], reduce_sum.137: f32[]) -> f32[] {
  %reduce_sum.136 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.137 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.138 = f32[] add(%reduce_sum.136, %reduce_sum.137), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/6/ln_1/reduce_sum" stack_frame_id=11}
}

%region_28.32 (reduce_max.45: f32[], reduce_max.46: f32[]) -> f32[] {
  %reduce_max.45 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.46 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.47 = f32[] maximum(%reduce_max.45, %reduce_max.46), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/6/attn/reduce_max" stack_frame_id=14}
}

%region_29.33 (reduce_sum.143: f32[], reduce_sum.144: f32[]) -> f32[] {
  %reduce_sum.143 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.144 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.145 = f32[] add(%reduce_sum.143, %reduce_sum.144), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/6/attn/reduce_sum" stack_frame_id=14}
}

%region_30.34 (reduce_sum.150: f32[], reduce_sum.151: f32[]) -> f32[] {
  %reduce_sum.150 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.151 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.152 = f32[] add(%reduce_sum.150, %reduce_sum.151), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/7/ln_1/reduce_sum" stack_frame_id=11}
}

%region_31.35 (reduce_sum.157: f32[], reduce_sum.158: f32[]) -> f32[] {
  %reduce_sum.157 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.158 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.159 = f32[] add(%reduce_sum.157, %reduce_sum.158), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/7/ln_1/reduce_sum" stack_frame_id=11}
}

%region_32.36 (reduce_max.52: f32[], reduce_max.53: f32[]) -> f32[] {
  %reduce_max.52 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.53 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.54 = f32[] maximum(%reduce_max.52, %reduce_max.53), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/7/attn/reduce_max" stack_frame_id=14}
}

%region_33.37 (reduce_sum.164: f32[], reduce_sum.165: f32[]) -> f32[] {
  %reduce_sum.164 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.165 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.166 = f32[] add(%reduce_sum.164, %reduce_sum.165), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/7/attn/reduce_sum" stack_frame_id=14}
}

%region_34.38 (reduce_sum.171: f32[], reduce_sum.172: f32[]) -> f32[] {
  %reduce_sum.171 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.172 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.173 = f32[] add(%reduce_sum.171, %reduce_sum.172), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/8/ln_1/reduce_sum" stack_frame_id=11}
}

%region_35.39 (reduce_sum.178: f32[], reduce_sum.179: f32[]) -> f32[] {
  %reduce_sum.178 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.179 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.180 = f32[] add(%reduce_sum.178, %reduce_sum.179), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/8/ln_1/reduce_sum" stack_frame_id=11}
}

%region_36.40 (reduce_max.59: f32[], reduce_max.60: f32[]) -> f32[] {
  %reduce_max.59 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.60 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.61 = f32[] maximum(%reduce_max.59, %reduce_max.60), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/8/attn/reduce_max" stack_frame_id=14}
}

%region_37.41 (reduce_sum.185: f32[], reduce_sum.186: f32[]) -> f32[] {
  %reduce_sum.185 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.186 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.187 = f32[] add(%reduce_sum.185, %reduce_sum.186), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/8/attn/reduce_sum" stack_frame_id=14}
}

%region_38.42 (reduce_sum.192: f32[], reduce_sum.193: f32[]) -> f32[] {
  %reduce_sum.192 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.193 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.194 = f32[] add(%reduce_sum.192, %reduce_sum.193), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/9/ln_1/reduce_sum" stack_frame_id=11}
}

%region_39.43 (reduce_sum.199: f32[], reduce_sum.200: f32[]) -> f32[] {
  %reduce_sum.199 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.200 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.201 = f32[] add(%reduce_sum.199, %reduce_sum.200), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/9/ln_1/reduce_sum" stack_frame_id=11}
}

%region_40.44 (reduce_max.66: f32[], reduce_max.67: f32[]) -> f32[] {
  %reduce_max.66 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.67 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.68 = f32[] maximum(%reduce_max.66, %reduce_max.67), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/9/attn/reduce_max" stack_frame_id=14}
}

%region_41.45 (reduce_sum.206: f32[], reduce_sum.207: f32[]) -> f32[] {
  %reduce_sum.206 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.207 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.208 = f32[] add(%reduce_sum.206, %reduce_sum.207), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/9/attn/reduce_sum" stack_frame_id=14}
}

%region_42.46 (reduce_sum.213: f32[], reduce_sum.214: f32[]) -> f32[] {
  %reduce_sum.213 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.214 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.215 = f32[] add(%reduce_sum.213, %reduce_sum.214), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/10/ln_1/reduce_sum" stack_frame_id=11}
}

%region_43.47 (reduce_sum.220: f32[], reduce_sum.221: f32[]) -> f32[] {
  %reduce_sum.220 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.221 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.222 = f32[] add(%reduce_sum.220, %reduce_sum.221), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/10/ln_1/reduce_sum" stack_frame_id=11}
}

%region_44.48 (reduce_max.73: f32[], reduce_max.74: f32[]) -> f32[] {
  %reduce_max.73 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.74 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.75 = f32[] maximum(%reduce_max.73, %reduce_max.74), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/10/attn/reduce_max" stack_frame_id=14}
}

%region_45.49 (reduce_sum.227: f32[], reduce_sum.228: f32[]) -> f32[] {
  %reduce_sum.227 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.228 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.229 = f32[] add(%reduce_sum.227, %reduce_sum.228), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/10/attn/reduce_sum" stack_frame_id=14}
}

%region_46.50 (reduce_sum.234: f32[], reduce_sum.235: f32[]) -> f32[] {
  %reduce_sum.234 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.235 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.236 = f32[] add(%reduce_sum.234, %reduce_sum.235), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/11/ln_1/reduce_sum" stack_frame_id=11}
}

%region_47.51 (reduce_sum.241: f32[], reduce_sum.242: f32[]) -> f32[] {
  %reduce_sum.241 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.242 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.243 = f32[] add(%reduce_sum.241, %reduce_sum.242), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/11/ln_1/reduce_sum" stack_frame_id=11}
}

%region_48.52 (reduce_max.80: f32[], reduce_max.81: f32[]) -> f32[] {
  %reduce_max.80 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.81 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.82 = f32[] maximum(%reduce_max.80, %reduce_max.81), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/11/attn/reduce_max" stack_frame_id=14}
}

%region_49.53 (reduce_sum.248: f32[], reduce_sum.249: f32[]) -> f32[] {
  %reduce_sum.248 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.249 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.250 = f32[] add(%reduce_sum.248, %reduce_sum.249), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/11/attn/reduce_sum" stack_frame_id=14}
}

%region_50.54 (reduce_sum.255: f32[], reduce_sum.256: f32[]) -> f32[] {
  %reduce_sum.255 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.256 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.257 = f32[] add(%reduce_sum.255, %reduce_sum.256), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/12/ln_1/reduce_sum" stack_frame_id=11}
}

%region_51.55 (reduce_sum.262: f32[], reduce_sum.263: f32[]) -> f32[] {
  %reduce_sum.262 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.263 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.264 = f32[] add(%reduce_sum.262, %reduce_sum.263), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/12/ln_1/reduce_sum" stack_frame_id=11}
}

%region_52.56 (reduce_max.87: f32[], reduce_max.88: f32[]) -> f32[] {
  %reduce_max.87 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.88 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.89 = f32[] maximum(%reduce_max.87, %reduce_max.88), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/12/attn/reduce_max" stack_frame_id=14}
}

%region_53.57 (reduce_sum.269: f32[], reduce_sum.270: f32[]) -> f32[] {
  %reduce_sum.269 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.270 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.271 = f32[] add(%reduce_sum.269, %reduce_sum.270), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/12/attn/reduce_sum" stack_frame_id=14}
}

%region_54.58 (reduce_sum.276: f32[], reduce_sum.277: f32[]) -> f32[] {
  %reduce_sum.276 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.277 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.278 = f32[] add(%reduce_sum.276, %reduce_sum.277), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/13/ln_1/reduce_sum" stack_frame_id=11}
}

%region_55.59 (reduce_sum.283: f32[], reduce_sum.284: f32[]) -> f32[] {
  %reduce_sum.283 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.284 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.285 = f32[] add(%reduce_sum.283, %reduce_sum.284), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/13/ln_1/reduce_sum" stack_frame_id=11}
}

%region_56.60 (reduce_max.94: f32[], reduce_max.95: f32[]) -> f32[] {
  %reduce_max.94 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.95 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.96 = f32[] maximum(%reduce_max.94, %reduce_max.95), metadata={op_name="jit(predict_step)/FlaxGPTJForCausalLMModule/transformer/h/13/attn/reduce_max" stack_frame_id=14}
}

%region_57.61 (reduce_sum.290: f32[], reduce_sum.291: f32[]) -> f32[] {
  %reduce_sum.290 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.291 = f32[] parameter(1), metadata={op_name="reduce_sum"}
