HloModule jit_predict_step, entry_computation_layout={(f32[32000,512]{1,0}, f32[512,8,64]{2,1,0}, f32[8,64,512]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, /*index=5*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=10*/f32[512]{0}, f32[2048]{0}, f32[512,2048]{1,0}, f32[512]{0}, f32[2048,512]{1,0}, /*index=15*/f32[512,8,64]{2,1,0}, f32[8,64,512]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, /*index=20*/f32[8,64,512]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512]{0}, f32[512]{0}, /*index=25*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[2048]{0}, /*index=30*/f32[512,2048]{1,0}, f32[512]{0}, f32[2048,512]{1,0}, f32[512,8,64]{2,1,0}, f32[8,64,512]{2,1,0}, /*index=35*/f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, f32[8,64,512]{2,1,0}, f32[512,8,64]{2,1,0}, /*index=40*/f32[512,8,64]{2,1,0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=45*/f32[512]{0}, f32[512]{0}, f32[2048]{0}, f32[512,2048]{1,0}, f32[512]{0}, /*index=50*/f32[2048,512]{1,0}, f32[512,8,64]{2,1,0}, f32[8,64,512]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, /*index=55*/f32[512,8,64]{2,1,0}, f32[8,64,512]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512]{0}, /*index=60*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=65*/f32[2048]{0}, f32[512,2048]{1,0}, f32[512]{0}, f32[2048,512]{1,0}, f32[512,8,64]{2,1,0}, /*index=70*/f32[8,64,512]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, f32[8,64,512]{2,1,0}, /*index=75*/f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=80*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[2048]{0}, f32[512,2048]{1,0}, /*index=85*/f32[512]{0}, f32[2048,512]{1,0}, f32[512,8,64]{2,1,0}, f32[8,64,512]{2,1,0}, f32[512,8,64]{2,1,0}, /*index=90*/f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, f32[8,64,512]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, /*index=95*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=100*/f32[512]{0}, f32[2048]{0}, f32[512,2048]{1,0}, f32[512]{0}, f32[2048,512]{1,0}, /*index=105*/f32[512,8,64]{2,1,0}, f32[8,64,512]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512,8,64]{2,1,0}, f32[512]{0}, /*index=110*/f32[512]{0}, f32[32000]{0}, f32[512,32000]{1,0}, f32[512]{0}, f32[512]{0}, /*index=115*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[2048]{0}, /*index=120*/f32[512,2048]{1,0}, f32[512]{0}, f32[2048,512]{1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, /*index=125*/f32[512]{0}, f32[8,64,512]{2,1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, f32[8,64]{1,0}, /*index=130*/f32[512,8,64]{2,1,0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=135*/f32[2048]{0}, f32[512,2048]{1,0}, f32[512]{0}, f32[2048,512]{1,0}, f32[8,64]{1,0}, /*index=140*/f32[512,8,64]{2,1,0}, f32[512]{0}, f32[8,64,512]{2,1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, /*index=145*/f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, /*index=150*/f32[512]{0}, f32[2048]{0}, f32[512,2048]{1,0}, f32[512]{0}, f32[2048,512]{1,0}, /*index=155*/f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, f32[512]{0}, f32[8,64,512]{2,1,0}, f32[8,64]{1,0}, /*index=160*/f32[512,8,64]{2,1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, f32[512]{0}, f32[512]{0}, /*index=165*/f32[512]{0}, f32[512]{0}, f32[2048]{0}, f32[512,2048]{1,0}, f32[512]{0}, /*index=170*/f32[2048,512]{1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, f32[512]{0}, f32[8,64,512]{2,1,0}, /*index=175*/f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, f32[512]{0}, /*index=180*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[2048]{0}, f32[512,2048]{1,0}, /*index=185*/f32[512]{0}, f32[2048,512]{1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, f32[512]{0}, /*index=190*/f32[8,64,512]{2,1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, /*index=195*/f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[512]{0}, f32[2048]{0}, /*index=200*/f32[512,2048]{1,0}, f32[512]{0}, f32[2048,512]{1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, /*index=205*/f32[512]{0}, f32[8,64,512]{2,1,0}, f32[8,64]{1,0}, f32[512,8,64]{2,1,0}, f32[8,64]{1,0}, /*index=210*/f32[512,8,64]{2,1,0}, f32[512]{0}, f32[16,16,3,512]{3,2,1,0}, f32[1,196,512]{2,1,0}, f32[1,64,512]{2,1,0}, /*index=215*/f32[8,224,224,3]{3,2,1,0}, s32[8,64]{1,0})->f32[8,64,32000]{2,1,0}}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true}

FileNames
1 "/root/hlo_dump/bv_cappa_dump.py"
2 "/root/big_vision/big_vision/models/proj/cappa/cappa.py"
3 "/root/big_vision/big_vision/models/vit.py"
4 "/usr/local/lib/python3.12/dist-packages/flax/linen/normalization.py"
5 "/usr/local/lib/python3.12/dist-packages/flax/linen/attention.py"
6 "/usr/local/lib/python3.12/dist-packages/flax/linen/linear.py"
7 "/root/big_vision/big_vision/models/common.py"

FunctionNames
1 "<module>"
2 "predict_step"
3 "Model.__call__"
4 "Model.encode"
5 "_Model.__call__"
6 "Encoder.__call__"
7 "Encoder1DBlock.__call__"
8 "LayerNorm.__call__"
9 "_compute_stats"
10 "_compute_stats.<locals>.maybe_distributed_mean"
11 "_compute_stats.<locals>.maybe_distributed_mean.<locals>.<genexpr>"
12 "MultiHeadDotProductAttention.__call__"
13 "dot_product_attention"
14 "dot_product_attention_weights"
15 "Model.decode"
16 "Decoder.__call__"
17 "EncoderDecoderBlock.__call__"
18 "SelfAttention.__call__"
19 "_Conv.__call__"
20 "_normalize"
21 "_abs_sq"
22 "DenseGeneral.__call__"
23 "MlpBlock.__call__"
24 "Dense.__call__"
25 "shift_right"
26 "Embed.__call__"
27 "AddPositionEmbs.__call__"
28 "make_causal_mask"
29 "make_attention_mask"

FileLocations
1 {file_name_id=1 function_name_id=1 line=31 end_line=31 column=10 end_column=41}
2 {file_name_id=1 function_name_id=2 line=30 end_line=30 column=15 end_column=70}
3 {file_name_id=2 function_name_id=3 line=386 end_line=386 column=14 end_column=45}
4 {file_name_id=2 function_name_id=4 line=334 end_line=334 column=13 end_column=45}
5 {file_name_id=3 function_name_id=5 line=230 end_line=239 column=24 end_column=39}
6 {file_name_id=3 function_name_id=6 line=157 end_line=157 column=36 end_column=63}
7 {file_name_id=3 function_name_id=7 line=92 end_line=92 column=8 end_column=25}
8 {file_name_id=4 function_name_id=8 line=512 end_line=521 column=16 end_column=5}
9 {file_name_id=4 function_name_id=9 line=139 end_line=139 column=16 end_column=64}
10 {file_name_id=4 function_name_id=10 line=122 end_line=122 column=10 end_column=53}
11 {file_name_id=4 function_name_id=11 line=122 end_line=122 column=16 end_column=40}
12 {file_name_id=3 function_name_id=7 line=93 end_line=98 column=20 end_column=11}
13 {file_name_id=5 function_name_id=12 line=674 end_line=674 column=10 end_column=54}
14 {file_name_id=5 function_name_id=13 line=266 end_line=281 column=17 end_column=3}
15 {file_name_id=5 function_name_id=14 line=146 end_line=146 column=19 end_column=47}
16 {file_name_id=3 function_name_id=7 line=103 end_line=103 column=8 end_column=25}
17 {file_name_id=3 function_name_id=6 line=160 end_line=160 column=11 end_column=47}
18 {file_name_id=2 function_name_id=3 line=388 end_line=388 column=14 end_column=68}
19 {file_name_id=2 function_name_id=15 line=358 end_line=365 column=13 end_column=44}
20 {file_name_id=2 function_name_id=16 line=246 end_line=251 column=15 end_column=44}
21 {file_name_id=2 function_name_id=17 line=97 end_line=97 column=12 end_column=76}
22 {file_name_id=2 function_name_id=17 line=98 end_line=101 column=12 end_column=57}
23 {file_name_id=5 function_name_id=18 line=818 end_line=824 column=11 end_column=5}
24 {file_name_id=2 function_name_id=17 line=107 end_line=107 column=14 end_column=72}
25 {file_name_id=2 function_name_id=17 line=108 end_line=111 column=14 end_column=54}
26 {file_name_id=2 function_name_id=17 line=119 end_line=119 column=12 end_column=70}
27 {file_name_id=2 function_name_id=16 line=253 end_line=253 column=8 end_column=41}
28 {file_name_id=3 function_name_id=5 line=212 end_line=214 column=22 end_column=70}
29 {file_name_id=6 function_name_id=19 line=700 end_line=710 column=10 end_column=7}
30 {file_name_id=6 function_name_id=19 line=725 end_line=725 column=13 end_column=67}
31 {file_name_id=6 function_name_id=19 line=726 end_line=726 column=6 end_column=15}
32 {file_name_id=3 function_name_id=5 line=217 end_line=217 column=8 end_column=37}
33 {file_name_id=3 function_name_id=5 line=220 end_line=221 column=29 end_column=63}
34 {file_name_id=4 function_name_id=8 line=523 end_line=538 column=11 end_column=5}
35 {file_name_id=4 function_name_id=20 line=203 end_line=203 column=9 end_column=46}
36 {file_name_id=4 function_name_id=20 line=205 end_line=205 column=6 end_column=14}
37 {file_name_id=4 function_name_id=9 line=139 end_line=139 column=42 end_column=52}
38 {file_name_id=4 function_name_id=21 line=57 end_line=57 column=11 end_column=24}
39 {file_name_id=4 function_name_id=9 line=142 end_line=142 column=35 end_column=46}
40 {file_name_id=4 function_name_id=9 line=142 end_line=142 column=29 end_column=46}
41 {file_name_id=4 function_name_id=9 line=142 end_line=142 column=12 end_column=47}
42 {file_name_id=4 function_name_id=20 line=204 end_line=204 column=8 end_column=44}
43 {file_name_id=4 function_name_id=20 line=206 end_line=206 column=18 end_column=31}
44 {file_name_id=4 function_name_id=20 line=206 end_line=206 column=8 end_column=32}
45 {file_name_id=4 function_name_id=20 line=214 end_line=214 column=4 end_column=16}
46 {file_name_id=4 function_name_id=20 line=211 end_line=211 column=6 end_column=28}
47 {file_name_id=4 function_name_id=20 line=216 end_line=216 column=2 end_column=10}
48 {file_name_id=4 function_name_id=20 line=220 end_line=220 column=6 end_column=28}
49 {file_name_id=4 function_name_id=20 line=223 end_line=223 column=4 end_column=13}
50 {file_name_id=5 function_name_id=12 line=551 end_line=551 column=6 end_column=35}
51 {file_name_id=6 function_name_id=22 line=199 end_line=204 column=10 end_column=5}
52 {file_name_id=6 function_name_id=22 line=209 end_line=209 column=13 end_column=63}
53 {file_name_id=6 function_name_id=22 line=210 end_line=210 column=6 end_column=17}
54 {file_name_id=5 function_name_id=12 line=549 end_line=549 column=6 end_column=35}
55 {file_name_id=5 function_name_id=14 line=130 end_line=130 column=10 end_column=47}
56 {file_name_id=5 function_name_id=12 line=550 end_line=550 column=6 end_column=33}
57 {file_name_id=5 function_name_id=14 line=132 end_line=132 column=17 end_column=60}
58 {file_name_id=5 function_name_id=13 line=291 end_line=295 column=9 end_column=3}
59 {file_name_id=5 function_name_id=12 line=676 end_line=688 column=10 end_column=8}
60 {file_name_id=3 function_name_id=7 line=101 end_line=101 column=21 end_column=26}
61 {file_name_id=3 function_name_id=7 line=104 end_line=107 column=21 end_column=23}
62 {file_name_id=3 function_name_id=23 line=72 end_line=72 column=8 end_column=72}
63 {file_name_id=6 function_name_id=24 line=287 end_line=292 column=8 end_column=5}
64 {file_name_id=6 function_name_id=24 line=294 end_line=294 column=11 end_column=57}
65 {file_name_id=6 function_name_id=24 line=294 end_line=294 column=6 end_column=57}
66 {file_name_id=3 function_name_id=23 line=75 end_line=75 column=8 end_column=18}
67 {file_name_id=3 function_name_id=23 line=77 end_line=77 column=8 end_column=52}
68 {file_name_id=3 function_name_id=7 line=110 end_line=110 column=22 end_column=27}
69 {file_name_id=2 function_name_id=16 line=200 end_line=200 column=12 end_column=26}
70 {file_name_id=2 function_name_id=25 line=43 end_line=43 column=11 end_column=66}
71 {file_name_id=2 function_name_id=25 line=46 end_line=46 column=9 end_column=79}
72 {file_name_id=2 function_name_id=16 line=208 end_line=208 column=8 end_column=16}
73 {file_name_id=6 function_name_id=26 line=1194 end_line=1194 column=11 end_column=46}
74 {file_name_id=2 function_name_id=16 line=210 end_line=211 column=8 end_column=58}
75 {file_name_id=7 function_name_id=27 line=133 end_line=133 column=11 end_column=22}
76 {file_name_id=2 function_name_id=15 line=357 end_line=357 column=39 end_column=67}
77 {file_name_id=5 function_name_id=28 line=880 end_line=880 column=26 end_column=66}
78 {file_name_id=5 function_name_id=28 line=881 end_line=887 column=9 end_column=3}
79 {file_name_id=5 function_name_id=29 line=854 end_line=856 column=9 end_column=3}
80 {file_name_id=5 function_name_id=29 line=857 end_line=857 column=9 end_column=39}
81 {file_name_id=5 function_name_id=29 line=859 end_line=859 column=9 end_column=27}
82 {file_name_id=5 function_name_id=14 line=140 end_line=140 column=19 end_column=57}
83 {file_name_id=2 function_name_id=17 line=103 end_line=103 column=12 end_column=23}
84 {file_name_id=2 function_name_id=17 line=114 end_line=114 column=14 end_column=19}
85 {file_name_id=2 function_name_id=17 line=120 end_line=122 column=12 end_column=51}
86 {file_name_id=2 function_name_id=23 line=64 end_line=64 column=8 end_column=75}
87 {file_name_id=2 function_name_id=23 line=65 end_line=65 column=8 end_column=18}
88 {file_name_id=2 function_name_id=23 line=67 end_line=67 column=8 end_column=55}
89 {file_name_id=2 function_name_id=17 line=124 end_line=124 column=15 end_column=20}
90 {file_name_id=2 function_name_id=16 line=255 end_line=259 column=13 end_column=8}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=6}
7 {file_location_id=7 parent_frame_id=7}
8 {file_location_id=8 parent_frame_id=8}
9 {file_location_id=9 parent_frame_id=9}
10 {file_location_id=10 parent_frame_id=10}
11 {file_location_id=11 parent_frame_id=11}
12 {file_location_id=12 parent_frame_id=7}
13 {file_location_id=13 parent_frame_id=13}
14 {file_location_id=14 parent_frame_id=14}
15 {file_location_id=15 parent_frame_id=15}
16 {file_location_id=16 parent_frame_id=7}
17 {file_location_id=8 parent_frame_id=17}
18 {file_location_id=9 parent_frame_id=18}
19 {file_location_id=10 parent_frame_id=19}
20 {file_location_id=11 parent_frame_id=20}
21 {file_location_id=17 parent_frame_id=6}
22 {file_location_id=8 parent_frame_id=22}
23 {file_location_id=9 parent_frame_id=23}
24 {file_location_id=10 parent_frame_id=24}
25 {file_location_id=11 parent_frame_id=25}
26 {file_location_id=18 parent_frame_id=3}
27 {file_location_id=19 parent_frame_id=27}
28 {file_location_id=20 parent_frame_id=28}
29 {file_location_id=21 parent_frame_id=29}
30 {file_location_id=8 parent_frame_id=30}
31 {file_location_id=9 parent_frame_id=31}
32 {file_location_id=10 parent_frame_id=32}
33 {file_location_id=11 parent_frame_id=33}
34 {file_location_id=22 parent_frame_id=29}
35 {file_location_id=23 parent_frame_id=35}
36 {file_location_id=13 parent_frame_id=36}
37 {file_location_id=14 parent_frame_id=37}
38 {file_location_id=15 parent_frame_id=38}
39 {file_location_id=24 parent_frame_id=29}
40 {file_location_id=8 parent_frame_id=40}
41 {file_location_id=9 parent_frame_id=41}
42 {file_location_id=10 parent_frame_id=42}
43 {file_location_id=11 parent_frame_id=43}
44 {file_location_id=25 parent_frame_id=29}
45 {file_location_id=13 parent_frame_id=45}
46 {file_location_id=14 parent_frame_id=46}
47 {file_location_id=15 parent_frame_id=47}
48 {file_location_id=26 parent_frame_id=29}
49 {file_location_id=8 parent_frame_id=49}
50 {file_location_id=9 parent_frame_id=50}
51 {file_location_id=10 parent_frame_id=51}
52 {file_location_id=11 parent_frame_id=52}
53 {file_location_id=27 parent_frame_id=28}
54 {file_location_id=8 parent_frame_id=54}
55 {file_location_id=9 parent_frame_id=55}
56 {file_location_id=10 parent_frame_id=56}
57 {file_location_id=11 parent_frame_id=57}
58 {file_location_id=28 parent_frame_id=5}
59 {file_location_id=29 parent_frame_id=59}
60 {file_location_id=30 parent_frame_id=59}
61 {file_location_id=31 parent_frame_id=59}
62 {file_location_id=32 parent_frame_id=5}
63 {file_location_id=33 parent_frame_id=5}
64 {file_location_id=34 parent_frame_id=8}
65 {file_location_id=35 parent_frame_id=65}
66 {file_location_id=36 parent_frame_id=65}
67 {file_location_id=37 parent_frame_id=9}
68 {file_location_id=38 parent_frame_id=68}
69 {file_location_id=39 parent_frame_id=9}
70 {file_location_id=38 parent_frame_id=70}
71 {file_location_id=40 parent_frame_id=9}
72 {file_location_id=41 parent_frame_id=9}
73 {file_location_id=42 parent_frame_id=65}
74 {file_location_id=43 parent_frame_id=65}
75 {file_location_id=44 parent_frame_id=65}
76 {file_location_id=45 parent_frame_id=65}
77 {file_location_id=46 parent_frame_id=65}
78 {file_location_id=47 parent_frame_id=65}
79 {file_location_id=48 parent_frame_id=65}
80 {file_location_id=49 parent_frame_id=65}
81 {file_location_id=50 parent_frame_id=13}
82 {file_location_id=51 parent_frame_id=82}
83 {file_location_id=52 parent_frame_id=82}
84 {file_location_id=53 parent_frame_id=82}
85 {file_location_id=54 parent_frame_id=13}
86 {file_location_id=51 parent_frame_id=86}
87 {file_location_id=52 parent_frame_id=86}
88 {file_location_id=53 parent_frame_id=86}
89 {file_location_id=55 parent_frame_id=15}
90 {file_location_id=56 parent_frame_id=13}
91 {file_location_id=51 parent_frame_id=91}
92 {file_location_id=52 parent_frame_id=91}
93 {file_location_id=53 parent_frame_id=91}
94 {file_location_id=57 parent_frame_id=15}
95 {file_location_id=58 parent_frame_id=14}
96 {file_location_id=59 parent_frame_id=13}
97 {file_location_id=51 parent_frame_id=97}
98 {file_location_id=52 parent_frame_id=97}
99 {file_location_id=53 parent_frame_id=97}
100 {file_location_id=60 parent_frame_id=7}
101 {file_location_id=34 parent_frame_id=17}
102 {file_location_id=35 parent_frame_id=102}
103 {file_location_id=36 parent_frame_id=102}
104 {file_location_id=37 parent_frame_id=18}
105 {file_location_id=38 parent_frame_id=105}
106 {file_location_id=39 parent_frame_id=18}
107 {file_location_id=38 parent_frame_id=107}
108 {file_location_id=40 parent_frame_id=18}
109 {file_location_id=41 parent_frame_id=18}
110 {file_location_id=42 parent_frame_id=102}
111 {file_location_id=43 parent_frame_id=102}
112 {file_location_id=44 parent_frame_id=102}
113 {file_location_id=45 parent_frame_id=102}
114 {file_location_id=46 parent_frame_id=102}
115 {file_location_id=47 parent_frame_id=102}
116 {file_location_id=48 parent_frame_id=102}
117 {file_location_id=49 parent_frame_id=102}
118 {file_location_id=61 parent_frame_id=7}
119 {file_location_id=62 parent_frame_id=119}
120 {file_location_id=63 parent_frame_id=120}
121 {file_location_id=64 parent_frame_id=120}
122 {file_location_id=65 parent_frame_id=120}
123 {file_location_id=66 parent_frame_id=119}
124 {file_location_id=67 parent_frame_id=119}
125 {file_location_id=63 parent_frame_id=125}
126 {file_location_id=64 parent_frame_id=125}
127 {file_location_id=65 parent_frame_id=125}
128 {file_location_id=68 parent_frame_id=7}
129 {file_location_id=34 parent_frame_id=22}
130 {file_location_id=35 parent_frame_id=130}
131 {file_location_id=36 parent_frame_id=130}
132 {file_location_id=37 parent_frame_id=23}
133 {file_location_id=38 parent_frame_id=133}
134 {file_location_id=39 parent_frame_id=23}
135 {file_location_id=38 parent_frame_id=135}
136 {file_location_id=40 parent_frame_id=23}
137 {file_location_id=41 parent_frame_id=23}
138 {file_location_id=42 parent_frame_id=130}
139 {file_location_id=43 parent_frame_id=130}
140 {file_location_id=44 parent_frame_id=130}
141 {file_location_id=45 parent_frame_id=130}
142 {file_location_id=46 parent_frame_id=130}
143 {file_location_id=47 parent_frame_id=130}
144 {file_location_id=48 parent_frame_id=130}
145 {file_location_id=49 parent_frame_id=130}
146 {file_location_id=50 parent_frame_id=45}
147 {file_location_id=51 parent_frame_id=147}
148 {file_location_id=69 parent_frame_id=28}
149 {file_location_id=70 parent_frame_id=149}
150 {file_location_id=71 parent_frame_id=149}
151 {file_location_id=72 parent_frame_id=28}
152 {file_location_id=73 parent_frame_id=152}
153 {file_location_id=74 parent_frame_id=28}
154 {file_location_id=75 parent_frame_id=154}
155 {file_location_id=34 parent_frame_id=30}
156 {file_location_id=35 parent_frame_id=156}
157 {file_location_id=36 parent_frame_id=156}
158 {file_location_id=37 parent_frame_id=31}
159 {file_location_id=38 parent_frame_id=159}
160 {file_location_id=39 parent_frame_id=31}
161 {file_location_id=38 parent_frame_id=161}
162 {file_location_id=40 parent_frame_id=31}
163 {file_location_id=41 parent_frame_id=31}
164 {file_location_id=42 parent_frame_id=156}
165 {file_location_id=43 parent_frame_id=156}
166 {file_location_id=44 parent_frame_id=156}
167 {file_location_id=45 parent_frame_id=156}
168 {file_location_id=46 parent_frame_id=156}
169 {file_location_id=47 parent_frame_id=156}
170 {file_location_id=48 parent_frame_id=156}
171 {file_location_id=49 parent_frame_id=156}
172 {file_location_id=50 parent_frame_id=36}
173 {file_location_id=51 parent_frame_id=173}
174 {file_location_id=76 parent_frame_id=27}
175 {file_location_id=77 parent_frame_id=175}
176 {file_location_id=78 parent_frame_id=175}
177 {file_location_id=79 parent_frame_id=177}
178 {file_location_id=80 parent_frame_id=177}
179 {file_location_id=81 parent_frame_id=177}
180 {file_location_id=54 parent_frame_id=36}
181 {file_location_id=51 parent_frame_id=181}
182 {file_location_id=55 parent_frame_id=38}
183 {file_location_id=56 parent_frame_id=36}
184 {file_location_id=51 parent_frame_id=184}
185 {file_location_id=57 parent_frame_id=38}
186 {file_location_id=82 parent_frame_id=38}
187 {file_location_id=58 parent_frame_id=37}
188 {file_location_id=59 parent_frame_id=36}
189 {file_location_id=51 parent_frame_id=189}
190 {file_location_id=83 parent_frame_id=29}
191 {file_location_id=34 parent_frame_id=40}
192 {file_location_id=35 parent_frame_id=192}
193 {file_location_id=36 parent_frame_id=192}
194 {file_location_id=37 parent_frame_id=41}
195 {file_location_id=38 parent_frame_id=195}
196 {file_location_id=39 parent_frame_id=41}
197 {file_location_id=38 parent_frame_id=197}
198 {file_location_id=40 parent_frame_id=41}
199 {file_location_id=41 parent_frame_id=41}
200 {file_location_id=42 parent_frame_id=192}
201 {file_location_id=43 parent_frame_id=192}
202 {file_location_id=44 parent_frame_id=192}
203 {file_location_id=45 parent_frame_id=192}
204 {file_location_id=46 parent_frame_id=192}
205 {file_location_id=47 parent_frame_id=192}
206 {file_location_id=48 parent_frame_id=192}
207 {file_location_id=49 parent_frame_id=192}
208 {file_location_id=54 parent_frame_id=45}
209 {file_location_id=51 parent_frame_id=209}
210 {file_location_id=55 parent_frame_id=47}
211 {file_location_id=56 parent_frame_id=45}
212 {file_location_id=51 parent_frame_id=212}
213 {file_location_id=57 parent_frame_id=47}
214 {file_location_id=58 parent_frame_id=46}
215 {file_location_id=59 parent_frame_id=45}
216 {file_location_id=51 parent_frame_id=216}
217 {file_location_id=84 parent_frame_id=29}
218 {file_location_id=34 parent_frame_id=49}
219 {file_location_id=35 parent_frame_id=219}
220 {file_location_id=36 parent_frame_id=219}
221 {file_location_id=37 parent_frame_id=50}
222 {file_location_id=38 parent_frame_id=222}
223 {file_location_id=39 parent_frame_id=50}
224 {file_location_id=38 parent_frame_id=224}
225 {file_location_id=40 parent_frame_id=50}
226 {file_location_id=41 parent_frame_id=50}
227 {file_location_id=42 parent_frame_id=219}
228 {file_location_id=43 parent_frame_id=219}
229 {file_location_id=44 parent_frame_id=219}
230 {file_location_id=45 parent_frame_id=219}
231 {file_location_id=46 parent_frame_id=219}
232 {file_location_id=47 parent_frame_id=219}
233 {file_location_id=48 parent_frame_id=219}
234 {file_location_id=49 parent_frame_id=219}
235 {file_location_id=85 parent_frame_id=29}
236 {file_location_id=86 parent_frame_id=236}
237 {file_location_id=63 parent_frame_id=237}
238 {file_location_id=64 parent_frame_id=237}
239 {file_location_id=65 parent_frame_id=237}
240 {file_location_id=87 parent_frame_id=236}
241 {file_location_id=88 parent_frame_id=236}
242 {file_location_id=63 parent_frame_id=242}
243 {file_location_id=64 parent_frame_id=242}
244 {file_location_id=65 parent_frame_id=242}
245 {file_location_id=89 parent_frame_id=29}
246 {file_location_id=34 parent_frame_id=54}
247 {file_location_id=35 parent_frame_id=247}
248 {file_location_id=36 parent_frame_id=247}
249 {file_location_id=37 parent_frame_id=55}
250 {file_location_id=38 parent_frame_id=250}
251 {file_location_id=39 parent_frame_id=55}
252 {file_location_id=38 parent_frame_id=252}
253 {file_location_id=40 parent_frame_id=55}
254 {file_location_id=41 parent_frame_id=55}
255 {file_location_id=42 parent_frame_id=247}
256 {file_location_id=43 parent_frame_id=247}
257 {file_location_id=44 parent_frame_id=247}
258 {file_location_id=45 parent_frame_id=247}
259 {file_location_id=46 parent_frame_id=247}
260 {file_location_id=47 parent_frame_id=247}
261 {file_location_id=48 parent_frame_id=247}
262 {file_location_id=49 parent_frame_id=247}
263 {file_location_id=90 parent_frame_id=28}
264 {file_location_id=63 parent_frame_id=264}
265 {file_location_id=64 parent_frame_id=264}
266 {file_location_id=65 parent_frame_id=264}


%region_0.1 (reduce_sum.3: f32[], reduce_sum.4: f32[]) -> f32[] {
  %reduce_sum.3 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.4 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.5 = f32[] add(%reduce_sum.3, %reduce_sum.4), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_0/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_1.2 (reduce_sum.10: f32[], reduce_sum.11: f32[]) -> f32[] {
  %reduce_sum.10 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.11 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.12 = f32[] add(%reduce_sum.10, %reduce_sum.11), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_0/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_2.3 (reduce_max.3: f32[], reduce_max.4: f32[]) -> f32[] {
  %reduce_max.3 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.4 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.5 = f32[] maximum(%reduce_max.3, %reduce_max.4), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_0/MultiHeadDotProductAttention_0/reduce_max" stack_frame_id=15}
}

%region_3.4 (reduce_sum.17: f32[], reduce_sum.18: f32[]) -> f32[] {
  %reduce_sum.17 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.18 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.19 = f32[] add(%reduce_sum.17, %reduce_sum.18), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_0/MultiHeadDotProductAttention_0/reduce_sum" stack_frame_id=15}
}

%region_4.5 (reduce_sum.24: f32[], reduce_sum.25: f32[]) -> f32[] {
  %reduce_sum.24 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.25 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.26 = f32[] add(%reduce_sum.24, %reduce_sum.25), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_0/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_5.6 (reduce_sum.31: f32[], reduce_sum.32: f32[]) -> f32[] {
  %reduce_sum.31 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.32 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.33 = f32[] add(%reduce_sum.31, %reduce_sum.32), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_0/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_6.7 (reduce_sum.38: f32[], reduce_sum.39: f32[]) -> f32[] {
  %reduce_sum.38 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.39 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.40 = f32[] add(%reduce_sum.38, %reduce_sum.39), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_1/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_7.8 (reduce_sum.45: f32[], reduce_sum.46: f32[]) -> f32[] {
  %reduce_sum.45 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.46 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.47 = f32[] add(%reduce_sum.45, %reduce_sum.46), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_1/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_8.9 (reduce_max.10: f32[], reduce_max.11: f32[]) -> f32[] {
  %reduce_max.10 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.11 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.12 = f32[] maximum(%reduce_max.10, %reduce_max.11), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_1/MultiHeadDotProductAttention_0/reduce_max" stack_frame_id=15}
}

%region_9.10 (reduce_sum.52: f32[], reduce_sum.53: f32[]) -> f32[] {
  %reduce_sum.52 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.53 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.54 = f32[] add(%reduce_sum.52, %reduce_sum.53), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_1/MultiHeadDotProductAttention_0/reduce_sum" stack_frame_id=15}
}

%region_10.11 (reduce_sum.59: f32[], reduce_sum.60: f32[]) -> f32[] {
  %reduce_sum.59 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.60 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.61 = f32[] add(%reduce_sum.59, %reduce_sum.60), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_1/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_11.12 (reduce_sum.66: f32[], reduce_sum.67: f32[]) -> f32[] {
  %reduce_sum.66 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.67 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.68 = f32[] add(%reduce_sum.66, %reduce_sum.67), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_1/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_12.13 (reduce_sum.73: f32[], reduce_sum.74: f32[]) -> f32[] {
  %reduce_sum.73 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.74 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.75 = f32[] add(%reduce_sum.73, %reduce_sum.74), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_2/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_13.14 (reduce_sum.80: f32[], reduce_sum.81: f32[]) -> f32[] {
  %reduce_sum.80 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.81 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.82 = f32[] add(%reduce_sum.80, %reduce_sum.81), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_2/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_14.15 (reduce_max.17: f32[], reduce_max.18: f32[]) -> f32[] {
  %reduce_max.17 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.18 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.19 = f32[] maximum(%reduce_max.17, %reduce_max.18), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_2/MultiHeadDotProductAttention_0/reduce_max" stack_frame_id=15}
}

%region_15.16 (reduce_sum.87: f32[], reduce_sum.88: f32[]) -> f32[] {
  %reduce_sum.87 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.88 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.89 = f32[] add(%reduce_sum.87, %reduce_sum.88), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_2/MultiHeadDotProductAttention_0/reduce_sum" stack_frame_id=15}
}

%region_16.17 (reduce_sum.94: f32[], reduce_sum.95: f32[]) -> f32[] {
  %reduce_sum.94 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.95 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.96 = f32[] add(%reduce_sum.94, %reduce_sum.95), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_2/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_17.18 (reduce_sum.101: f32[], reduce_sum.102: f32[]) -> f32[] {
  %reduce_sum.101 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.102 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.103 = f32[] add(%reduce_sum.101, %reduce_sum.102), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_2/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_18.19 (reduce_sum.108: f32[], reduce_sum.109: f32[]) -> f32[] {
  %reduce_sum.108 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.109 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.110 = f32[] add(%reduce_sum.108, %reduce_sum.109), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_3/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_19.20 (reduce_sum.115: f32[], reduce_sum.116: f32[]) -> f32[] {
  %reduce_sum.115 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.116 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.117 = f32[] add(%reduce_sum.115, %reduce_sum.116), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_3/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_20.21 (reduce_max.24: f32[], reduce_max.25: f32[]) -> f32[] {
  %reduce_max.24 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.25 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.26 = f32[] maximum(%reduce_max.24, %reduce_max.25), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_3/MultiHeadDotProductAttention_0/reduce_max" stack_frame_id=15}
}

%region_21.22 (reduce_sum.122: f32[], reduce_sum.123: f32[]) -> f32[] {
  %reduce_sum.122 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.123 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.124 = f32[] add(%reduce_sum.122, %reduce_sum.123), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_3/MultiHeadDotProductAttention_0/reduce_sum" stack_frame_id=15}
}

%region_22.23 (reduce_sum.129: f32[], reduce_sum.130: f32[]) -> f32[] {
  %reduce_sum.129 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.130 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.131 = f32[] add(%reduce_sum.129, %reduce_sum.130), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_3/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_23.24 (reduce_sum.136: f32[], reduce_sum.137: f32[]) -> f32[] {
  %reduce_sum.136 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.137 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.138 = f32[] add(%reduce_sum.136, %reduce_sum.137), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_3/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_24.25 (reduce_sum.143: f32[], reduce_sum.144: f32[]) -> f32[] {
  %reduce_sum.143 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.144 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.145 = f32[] add(%reduce_sum.143, %reduce_sum.144), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_4/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_25.26 (reduce_sum.150: f32[], reduce_sum.151: f32[]) -> f32[] {
  %reduce_sum.150 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.151 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.152 = f32[] add(%reduce_sum.150, %reduce_sum.151), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_4/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_26.27 (reduce_max.31: f32[], reduce_max.32: f32[]) -> f32[] {
  %reduce_max.31 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.32 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.33 = f32[] maximum(%reduce_max.31, %reduce_max.32), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_4/MultiHeadDotProductAttention_0/reduce_max" stack_frame_id=15}
}

%region_27.28 (reduce_sum.157: f32[], reduce_sum.158: f32[]) -> f32[] {
  %reduce_sum.157 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.158 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.159 = f32[] add(%reduce_sum.157, %reduce_sum.158), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_4/MultiHeadDotProductAttention_0/reduce_sum" stack_frame_id=15}
}

%region_28.29 (reduce_sum.164: f32[], reduce_sum.165: f32[]) -> f32[] {
  %reduce_sum.164 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.165 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.166 = f32[] add(%reduce_sum.164, %reduce_sum.165), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_4/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_29.30 (reduce_sum.171: f32[], reduce_sum.172: f32[]) -> f32[] {
  %reduce_sum.171 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.172 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.173 = f32[] add(%reduce_sum.171, %reduce_sum.172), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_4/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_30.31 (reduce_sum.178: f32[], reduce_sum.179: f32[]) -> f32[] {
  %reduce_sum.178 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.179 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.180 = f32[] add(%reduce_sum.178, %reduce_sum.179), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_5/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_31.32 (reduce_sum.185: f32[], reduce_sum.186: f32[]) -> f32[] {
  %reduce_sum.185 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.186 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.187 = f32[] add(%reduce_sum.185, %reduce_sum.186), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_5/LayerNorm_0/reduce_sum" stack_frame_id=11}
}

%region_32.33 (reduce_max.38: f32[], reduce_max.39: f32[]) -> f32[] {
  %reduce_max.38 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.39 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.40 = f32[] maximum(%reduce_max.38, %reduce_max.39), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_5/MultiHeadDotProductAttention_0/reduce_max" stack_frame_id=15}
}

%region_33.34 (reduce_sum.192: f32[], reduce_sum.193: f32[]) -> f32[] {
  %reduce_sum.192 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.193 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.194 = f32[] add(%reduce_sum.192, %reduce_sum.193), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_5/MultiHeadDotProductAttention_0/reduce_sum" stack_frame_id=15}
}

%region_34.35 (reduce_sum.199: f32[], reduce_sum.200: f32[]) -> f32[] {
  %reduce_sum.199 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.200 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.201 = f32[] add(%reduce_sum.199, %reduce_sum.200), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_5/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_35.36 (reduce_sum.206: f32[], reduce_sum.207: f32[]) -> f32[] {
  %reduce_sum.206 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.207 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.208 = f32[] add(%reduce_sum.206, %reduce_sum.207), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoderblock_5/LayerNorm_1/reduce_sum" stack_frame_id=20}
}

%region_36.37 (reduce_sum.213: f32[], reduce_sum.214: f32[]) -> f32[] {
  %reduce_sum.213 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.214 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.215 = f32[] add(%reduce_sum.213, %reduce_sum.214), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoder_norm/reduce_sum" stack_frame_id=25}
}

%region_37.38 (reduce_sum.220: f32[], reduce_sum.221: f32[]) -> f32[] {
  %reduce_sum.220 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.221 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.222 = f32[] add(%reduce_sum.220, %reduce_sum.221), metadata={op_name="jit(predict_step)/Model/Model.encode/encoder/Transformer/encoder_norm/reduce_sum" stack_frame_id=25}
}

%_pad.39 (Arg_0.1: s32[8,64], Arg_1.1: s32[]) -> s32[8,65] {
  %Arg_0.1 = s32[8,64]{1,0} parameter(0)
  %Arg_1.1 = s32[] parameter(1)
  ROOT %pad.1 = s32[8,65]{1,0} pad(%Arg_0.1, %Arg_1.1), padding=0_0x1_0, metadata={op_name="pad"}
}

%_where.40 (Arg_0.4: pred[8,64], Arg_1.4: s32[8,64], Arg_2.1: s32[8,64]) -> s32[8,64] {
  %Arg_0.4 = pred[8,64]{1,0} parameter(0)
  %Arg_1.4 = s32[8,64]{1,0} parameter(1)
  %Arg_2.1 = s32[8,64]{1,0} parameter(2)
  ROOT %select_n.1 = s32[8,64]{1,0} select(%Arg_0.4, %Arg_1.4, %Arg_2.1), metadata={op_name="select_n"}
}

%region_38.41 (reduce_and.3: pred[], reduce_and.4: pred[]) -> pred[] {
  %reduce_and.3 = pred[] parameter(0), metadata={op_name="reduce_and"}
  %reduce_and.4 = pred[] parameter(1), metadata={op_name="reduce_and"}
  ROOT %reduce_and.5 = pred[] and(%reduce_and.3, %reduce_and.4), metadata={op_name="reduce_and"}
}

%_take.42 (Arg_0.5: f32[32000,512], Arg_1.5: s32[8,64]) -> f32[8,64,512] {
  %Arg_1.5 = s32[8,64]{1,0} parameter(1)
  %constant.33 = s32[] constant(0)
  %lt.2 = s32[8,64]{1,0} broadcast(%constant.33), dimensions={}, metadata={op_name="lt"}
  %lt.3 = pred[8,64]{1,0} compare(%Arg_1.5, %lt.2), direction=LT, metadata={op_name="lt"}
  %constant.31 = s32[] constant(32000)
  %add.243 = s32[8,64]{1,0} broadcast(%constant.31), dimensions={}, metadata={op_name="add"}
  %add.244 = s32[8,64]{1,0} add(%Arg_1.5, %add.243), metadata={op_name="add"}
  %jit__where_.1 = s32[8,64]{1,0} call(%lt.3, %add.244, %Arg_1.5), to_apply=%_where.40, metadata={op_name="jit(_where)"}
  %broadcast_in_dim.45 = s32[8,64,1]{2,1,0} reshape(%jit__where_.1), metadata={op_name="broadcast_in_dim"}
  %constant.30 = s32[] constant(0)
  %ge.3 = s32[8,64,1]{2,1,0} broadcast(%constant.30), dimensions={}, metadata={op_name="ge"}
  %ge.4 = pred[8,64,1]{2,1,0} compare(%broadcast_in_dim.45, %ge.3), direction=GE, metadata={op_name="ge"}
  %constant.29 = s32[] constant(31999)
  %le.2 = s32[8,64,1]{2,1,0} broadcast(%constant.29), dimensions={}, metadata={op_name="le"}
  %le.3 = pred[8,64,1]{2,1,0} compare(%broadcast_in_dim.45, %le.2), direction=LE, metadata={op_name="le"}
  %and.1 = pred[8,64,1]{2,1,0} and(%ge.4, %le.3), metadata={op_name="and"}
  %constant.32 = pred[] constant(true)
  %reduce_and.7 = pred[8,64]{1,0} reduce(%and.1, %constant.32), dimensions={2}, to_apply=%region_38.41, metadata={op_name="reduce_and"}
  %broadcast_in_dim.46 = pred[8,64,512]{2,1,0} broadcast(%reduce_and.7), dimensions={0,1}, metadata={op_name="broadcast_in_dim"}
  %Arg_0.5 = f32[32000,512]{1,0} parameter(0)
  %gather.1 = f32[8,64,512]{2,1,0} gather(%Arg_0.5, %broadcast_in_dim.45), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,512}, metadata={op_name="gather"}
  %constant.28 = f32[] constant(nan)
  %broadcast_in_dim.44 = f32[8,64,512]{2,1,0} broadcast(%constant.28), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.3 = f32[8,64,512]{2,1,0} select(%broadcast_in_dim.46, %gather.1, %broadcast_in_dim.44), metadata={op_name="select_n"}
}

%region_39.43 (reduce_sum.227: f32[], reduce_sum.228: f32[]) -> f32[] {
  %reduce_sum.227 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.228 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.229 = f32[] add(%reduce_sum.227, %reduce_sum.228), metadata={op_name="jit(predict_step)/Model/Model.decode/decoder/EncDecBlock0/LayerNorm1/reduce_sum" stack_frame_id=33}
}

%region_40.44 (reduce_sum.234: f32[], reduce_sum.235: f32[]) -> f32[] {
  %reduce_sum.234 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.235 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.236 = f32[] add(%reduce_sum.234, %reduce_sum.235), metadata={op_name="jit(predict_step)/Model/Model.decode/decoder/EncDecBlock0/LayerNorm1/reduce_sum" stack_frame_id=33}
}

%_where_0.45 (Arg_0.7: f32[8,1,64,64], Arg_1.7: f32[8,8,64,64], Arg_2.3: f32[]) -> f32[8,8,64,64] {
  %Arg_0.7 = f32[8,1,64,64]{3,2,1,0} parameter(0)
  %constant.35 = f32[] constant(0)
  %ne.2 = f32[8,1,64,64]{3,2,1,0} broadcast(%constant.35), dimensions={}, metadata={op_name="ne"}
  %ne.3 = pred[8,1,64,64]{3,2,1,0} compare(%Arg_0.7, %ne.2), direction=NE, metadata={op_name="ne"}
  %broadcast_in_dim.53 = pred[8,1,64,64]{3,2,1,0} broadcast(%ne.3), dimensions={0,1,2,3}, metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.54 = pred[8,64,64]{2,1,0} reshape(%broadcast_in_dim.53), metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.55 = pred[8,8,64,64]{3,2,1,0} broadcast(%broadcast_in_dim.54), dimensions={0,2,3}, metadata={op_name="broadcast_in_dim"}
  %Arg_1.7 = f32[8,8,64,64]{3,2,1,0} parameter(1)
  %Arg_2.3 = f32[] parameter(2)
  %broadcast_in_dim.56 = f32[8,8,64,64]{3,2,1,0} broadcast(%Arg_2.3), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.5 = f32[8,8,64,64]{3,2,1,0} select(%broadcast_in_dim.55, %Arg_1.7, %broadcast_in_dim.56), metadata={op_name="select_n"}
}

%region_41.46 (reduce_max.45: f32[], reduce_max.46: f32[]) -> f32[] {
  %reduce_max.45 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.46 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.47 = f32[] maximum(%reduce_max.45, %reduce_max.46), metadata={op_name="jit(predict_step)/Model/Model.decode/decoder/EncDecBlock0/SelfAttn/SelfAttn/reduce_max" stack_frame_id=38}
}

%region_42.47 (reduce_sum.241: f32[], reduce_sum.242: f32[]) -> f32[] {
  %reduce_sum.241 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.242 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.243 = f32[] add(%reduce_sum.241, %reduce_sum.242), metadata={op_name="jit(predict_step)/Model/Model.decode/decoder/EncDecBlock0/SelfAttn/SelfAttn/reduce_sum" stack_frame_id=38}
}

%region_43.48 (reduce_sum.248: f32[], reduce_sum.249: f32[]) -> f32[] {
  %reduce_sum.248 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.249 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.250 = f32[] add(%reduce_sum.248, %reduce_sum.249), metadata={op_name="jit(predict_step)/Model/Model.decode/decoder/EncDecBlock0/LayerNorm2/reduce_sum" stack_frame_id=43}
}

%region_44.49 (reduce_sum.255: f32[], reduce_sum.256: f32[]) -> f32[] {
  %reduce_sum.255 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.256 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.257 = f32[] add(%reduce_sum.255, %reduce_sum.256), metadata={op_name="jit(predict_step)/Model/Model.decode/decoder/EncDecBlock0/LayerNorm2/reduce_sum" stack_frame_id=43}
}

%region_45.50 (reduce_max.52: f32[], reduce_max.53: f32[]) -> f32[] {
  %reduce_max.52 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.53 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.54 = f32[] maximum(%reduce_max.52, %reduce_max.53), metadata={op_name="jit(predict_step)/Model/Model.decode/decoder/EncDecBlock0/CrossAttn/reduce_max" stack_frame_id=47}
}

%region_46.51 (reduce_sum.262: f32[], reduce_sum.263: f32[]) -> f32[] {
  %reduce_sum.262 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.263 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.264 = f32[] add(%reduce_sum.262, %reduce_sum.263), metadata={op_name="jit(predict_step)/Model/Model.decode/decoder/EncDecBlock0/CrossAttn/reduce_sum" stack_frame_id=47}
}

%region_47.52 (reduce_sum.269: f32[], reduce_sum.270: f32[]) -> f32[] {
