HloModule jit__generate_jit, buffer_donor={ (0, {}), (1, {}), (2, {}), (3, {}), (4, {}), (5, {}), (6, {}), (7, {}), (8, {}), (9, {}), (10, {}), (11, {}), (12, {}), (13, {}), (14, {}), (15, {}), (16, {}), (17, {}), (18, {}) }, entry_computation_layout={(s32[12,1]{1,0}, s32[12,8,1984]{2,1,0}, s32[12,8,64]{2,1,0}, bf16[12,1984,8,8,64]{4,3,2,1,0}, s32[12,8]{1,0}, /*index=5*/bf16[12,1984,8,8,64]{4,3,2,1,0}, bf16[12,64,8,8,64]{4,3,2,1,0}, bf16[12,64,8,8,64]{4,3,2,1,0}, s32[12,1]{1,0}, s32[12,8,1984]{2,1,0}, /*index=10*/s32[12,8,64]{2,1,0}, bf16[12,1984,8,8,64]{4,3,2,1,0}, s32[12,8]{1,0}, bf16[12,1984,8,8,64]{4,3,2,1,0}, bf16[12,64,8,8,64]{4,3,2,1,0}, /*index=15*/bf16[12,64,8,8,64]{4,3,2,1,0}, s32[8,1]{1,0}, s32[8,1]{1,0}, s32[8,1]{1,0}, f32[2880]{0}, /*index=20*/f32[8,12,64]{2,1,0}, f32[2880,12,8,64]{3,2,1,0}, f32[2880,12]{1,0}, f32[64,12,64,2880]{3,2,1,0}, f32[64,12,64]{2,1,0}, /*index=25*/f32[2880,12,64,64]{3,2,1,0}, f32[64,12]{1,0}, f32[8,12,64]{2,1,0}, f32[2880,12,8,64]{3,2,1,0}, f32[32,12]{1,0}, /*index=30*/f32[2880,12,32]{2,1,0}, f32[32,12,2880,2880]{3,2,1,0}, f32[32,12,2880]{2,1,0}, f32[32,12,2880,2880]{3,2,1,0}, f32[32,12,2880]{2,1,0}, /*index=35*/f32[32,12,2880,2880]{3,2,1,0}, f32[32,12,2880]{2,1,0}, f32[2880,12]{1,0}, f32[2880,12]{1,0}, f32[8,12,64]{2,1,0}, /*index=40*/f32[2880,12,8,64]{3,2,1,0}, f32[2880,12]{1,0}, f32[64,12,64,2880]{3,2,1,0}, f32[64,12,64]{2,1,0}, f32[2880,12,64,64]{3,2,1,0}, /*index=45*/f32[64,12]{1,0}, f32[8,12,64]{2,1,0}, f32[2880,12,8,64]{3,2,1,0}, f32[32,12]{1,0}, f32[2880,12,32]{2,1,0}, /*index=50*/f32[32,12,2880,2880]{3,2,1,0}, f32[32,12,2880]{2,1,0}, f32[32,12,2880,2880]{3,2,1,0}, f32[32,12,2880]{2,1,0}, f32[32,12,2880,2880]{3,2,1,0}, /*index=55*/f32[32,12,2880]{2,1,0}, f32[2880,12]{1,0}, f32[2880,12]{1,0}, f32[2880,201088]{1,0}, f32[201088,2880]{1,0})->(s32[12,1]{1,0}, s32[12,8,1984]{2,1,0}, s32[12,8,64]{2,1,0}, bf16[12,1984,8,8,64]{4,3,2,1,0}, s32[12,8]{1,0}, /*index=5*/bf16[12,1984,8,8,64]{4,3,2,1,0}, bf16[12,64,8,8,64]{4,3,2,1,0}, bf16[12,64,8,8,64]{4,3,2,1,0}, s32[12,1]{1,0}, s32[12,8,1984]{2,1,0}, /*index=10*/s32[12,8,64]{2,1,0}, bf16[12,1984,8,8,64]{4,3,2,1,0}, s32[12,8]{1,0}, bf16[12,1984,8,8,64]{4,3,2,1,0}, bf16[12,64,8,8,64]{4,3,2,1,0}, /*index=15*/bf16[12,64,8,8,64]{4,3,2,1,0}, s32[8,1]{1,0}, f32[8,1,201088]{2,1,0}, s32[8,1]{1,0}, f32[8,1]{1,0}, /*index=20*/s32[8,1]{1,0}, s32[8,3]{1,0}, f32[8,1]{1,0})}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, num_partitions=8, frontend_attributes={xla.sdy.meshes={mesh = #sdy.mesh<["diloco"=1, "data"=1, "stage"=1, "fsdp"=1, "fsdp_transpose"=1, "context"=1, "context_autoregressive"=1, "tensor"=8, "tensor_transpose"=1, "tensor_sequence"=1, "expert"=1, "autoregressive"=1]>}}

FileNames
1 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/maxengine/maxengine.py"
2 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/models/models.py"
3 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/decoders.py"
4 "/usr/local/lib/python3.12/dist-packages/flax/core/axes_scan.py"
5 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/nnx_wrappers.py"
6 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/models/gpt_oss.py"
7 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/normalizations.py"
8 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/attentions.py"
9 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/kvcache.py"
10 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/attention_op.py"
11 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/moe.py"
12 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/utils/sharding.py"
13 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/linears.py"
14 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/embeddings.py"
15 "<frozen runpy>"
16 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/decode.py"
17 "/usr/local/lib/python3.12/dist-packages/absl/app.py"
18 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/inference_utils.py"

FunctionNames
1 "MaxEngine._prefill_jit"
2 "TransformerLinenPure.apply"
3 "TransformerLinenPure.__call__"
4 "Decoder.__call__"
5 "scan.<locals>.scan_fn"
6 "MaxEngine._generate_jit"
7 "scan.<locals>.scan_fn.<locals>.body_fn"
8 "ToLinen.__call__"
9 "GptOssScannableBlock.__call__"
10 "_fix_for_qwix_quantization.<locals>.wrap.<locals>.wrapped"
11 "GptOssDecoderLayer.__call__"
12 "RMSNorm.__call__"
13 "Attention.__call__"
14 "Attention.update_kv_caches"
15 "KVCache.__call__"
16 "KVCache.kv_cache_autoregressive"
17 "AttentionOp.__call__"
18 "AttentionOp.apply_attention"
19 "AttentionOp.apply_attention_dot"
20 "AttentionOp.compute_local_attention"
21 "RoutedMoE.__call__"
22 "RoutedMoE.dense_matmul"
23 "RoutedMoE.get_topk"
24 "AttentionOp.generate_attention_mask"
25 "apply_mask_to_logits"
26 "KVCache.get_cached_values"
27 "KVCache.get_cached_values.<locals>.<lambda>"
28 "reverse_transpose"
29 "maybe_shard_with_logical"
30 "maybe_shard_with_name"
31 "Attention.query_projection"
32 "DenseGeneral.__call__"
33 "_compute_dot_general_nnx"
34 "Attention.apply_rotary_embedding"
35 "YarnRotaryEmbedding.__call__"
36 "YarnRotaryEmbedding.freqs_cis"
37 "YarnRotaryEmbedding._linear_ramp_factor"
38 "AttentionOp.qk_product"
39 "Attention.kv_projection"
40 "KVCache.update_ar_key_value"
41 "AttentionOp.normalize_attention"
42 "AttentionOp.normalize_attention.<locals>.<genexpr>"
43 "AttentionOp.wv_product"
44 "Attention.out_projection"
45 "RoutedMoE._maybe_shard_with_logical"
46 "RoutedMoE.apply_ffn_activation"
47 "RoutedMoE.reshape_and_update_weights"
48 "GateLogit.__call__"
49 "_run_module_as_main"
50 "_run_code"
51 "<module>"
52 "run"
53 "_run_main"
54 "main"
55 "MaxEngine.generate"
56 "Decoder.apply_output_head"
57 "sampling"
58 "Decoder._apply_embedding"
59 "Embed.__call__"
60 "scan.<locals>.transpose_to_front"
61 "scan.<locals>.transpose_to_front.<locals>.trans"

FileLocations
1 {file_name_id=1 function_name_id=1 line=798 end_line=815 column=32 end_column=9}
2 {file_name_id=2 function_name_id=2 line=71 end_line=71 column=11 end_column=51}
3 {file_name_id=2 function_name_id=3 line=202 end_line=215 column=38 end_column=5}
4 {file_name_id=3 function_name_id=4 line=1133 end_line=1142 column=19 end_column=41}
5 {file_name_id=4 function_name_id=5 line=200 end_line=203 column=14 end_column=7}
6 {file_name_id=1 function_name_id=6 line=1353 end_line=1361 column=31 end_column=9}
7 {file_name_id=4 function_name_id=7 line=157 end_line=157 column=29 end_column=53}
8 {file_name_id=5 function_name_id=8 line=549 end_line=549 column=10 end_column=44}
9 {file_name_id=6 function_name_id=9 line=292 end_line=302 column=20 end_column=7}
10 {file_name_id=5 function_name_id=10 line=383 end_line=383 column=15 end_column=39}
11 {file_name_id=6 function_name_id=11 line=163 end_line=163 column=10 end_column=52}
12 {file_name_id=7 function_name_id=12 line=72 end_line=72 column=12 end_column=59}
13 {file_name_id=6 function_name_id=11 line=166 end_line=175 column=30 end_column=5}
14 {file_name_id=8 function_name_id=13 line=1224 end_line=1224 column=24 end_column=106}
15 {file_name_id=8 function_name_id=14 line=994 end_line=1001 column=36 end_column=5}
16 {file_name_id=9 function_name_id=15 line=959 end_line=959 column=13 end_column=75}
17 {file_name_id=9 function_name_id=16 line=907 end_line=907 column=35 end_column=80}
18 {file_name_id=8 function_name_id=13 line=1225 end_line=1236 column=12 end_column=7}
19 {file_name_id=10 function_name_id=17 line=2106 end_line=2123 column=86 end_column=5}
20 {file_name_id=10 function_name_id=18 line=972 end_line=986 column=13 end_column=7}
21 {file_name_id=10 function_name_id=19 line=1919 end_line=1919 column=11 end_column=109}
22 {file_name_id=10 function_name_id=20 line=1770 end_line=1770 column=16 end_column=55}
23 {file_name_id=10 function_name_id=20 line=1772 end_line=1772 column=16 end_column=68}
24 {file_name_id=10 function_name_id=17 line=2133 end_line=2146 column=71 end_column=5}
25 {file_name_id=6 function_name_id=11 line=183 end_line=183 column=20 end_column=76}
26 {file_name_id=6 function_name_id=11 line=189 end_line=189 column=36 end_column=65}
27 {file_name_id=11 function_name_id=21 line=2639 end_line=2641 column=38 end_column=7}
28 {file_name_id=11 function_name_id=22 line=2193 end_line=2193 column=35 end_column=110}
29 {file_name_id=11 function_name_id=23 line=711 end_line=711 column=22 end_column=80}
30 {file_name_id=11 function_name_id=21 line=2588 end_line=2588 column=16 end_column=53}
31 {file_name_id=7 function_name_id=12 line=90 end_line=90 column=12 end_column=42}
32 {file_name_id=10 function_name_id=19 line=1866 end_line=1874 column=16 end_column=5}
33 {file_name_id=10 function_name_id=24 line=741 end_line=741 column=24 end_column=79}
34 {file_name_id=10 function_name_id=24 line=742 end_line=742 column=22 end_column=84}
35 {file_name_id=10 function_name_id=24 line=743 end_line=743 column=10 end_column=44}
36 {file_name_id=10 function_name_id=24 line=742 end_line=744 column=21 end_column=7}
37 {file_name_id=10 function_name_id=24 line=745 end_line=745 column=20 end_column=46}
38 {file_name_id=10 function_name_id=24 line=698 end_line=698 column=13 end_column=56}
39 {file_name_id=10 function_name_id=24 line=787 end_line=787 column=11 end_column=58}
40 {file_name_id=10 function_name_id=19 line=1906 end_line=1906 column=21 end_column=66}
41 {file_name_id=10 function_name_id=25 line=121 end_line=121 column=20 end_column=52}
42 {file_name_id=9 function_name_id=16 line=914 end_line=914 column=8 end_column=97}
43 {file_name_id=9 function_name_id=26 line=848 end_line=848 column=35 end_column=110}
44 {file_name_id=9 function_name_id=27 line=848 end_line=848 column=58 end_column=96}
45 {file_name_id=9 function_name_id=28 line=42 end_line=42 column=9 end_column=81}
46 {file_name_id=7 function_name_id=12 line=71 end_line=71 column=8 end_column=35}
47 {file_name_id=7 function_name_id=12 line=72 end_line=72 column=21 end_column=34}
48 {file_name_id=7 function_name_id=12 line=73 end_line=73 column=34 end_column=54}
49 {file_name_id=7 function_name_id=12 line=73 end_line=73 column=24 end_column=55}
50 {file_name_id=7 function_name_id=12 line=73 end_line=73 column=20 end_column=55}
51 {file_name_id=7 function_name_id=12 line=73 end_line=73 column=8 end_column=68}
52 {file_name_id=7 function_name_id=12 line=92 end_line=92 column=11 end_column=84}
53 {file_name_id=8 function_name_id=13 line=1124 end_line=1124 column=15 end_column=73}
54 {file_name_id=12 function_name_id=29 line=147 end_line=155 column=9 end_column=3}
55 {file_name_id=12 function_name_id=30 line=113 end_line=113 column=11 end_column=67}
56 {file_name_id=8 function_name_id=13 line=1142 end_line=1142 column=14 end_column=72}
57 {file_name_id=8 function_name_id=31 line=614 end_line=614 column=11 end_column=58}
58 {file_name_id=13 function_name_id=32 line=231 end_line=231 column=15 end_column=46}
59 {file_name_id=13 function_name_id=32 line=238 end_line=247 column=13 end_column=5}
60 {file_name_id=13 function_name_id=33 line=102 end_line=104 column=9 end_column=3}
61 {file_name_id=13 function_name_id=32 line=250 end_line=250 column=13 end_column=52}
62 {file_name_id=13 function_name_id=32 line=251 end_line=251 column=6 end_column=20}
63 {file_name_id=8 function_name_id=13 line=1172 end_line=1172 column=14 end_column=108}
64 {file_name_id=8 function_name_id=34 line=935 end_line=935 column=13 end_column=60}
65 {file_name_id=14 function_name_id=35 line=975 end_line=975 column=32 end_column=61}
66 {file_name_id=14 function_name_id=35 line=977 end_line=977 column=21 end_column=50}
67 {file_name_id=14 function_name_id=35 line=977 end_line=977 column=34 end_column=50}
68 {file_name_id=14 function_name_id=35 line=962 end_line=962 column=12 end_column=26}
69 {file_name_id=14 function_name_id=36 line=883 end_line=883 column=8 end_column=67}
70 {file_name_id=14 function_name_id=36 line=885 end_line=885 column=12 end_column=31}
71 {file_name_id=14 function_name_id=36 line=868 end_line=868 column=45 end_column=87}
72 {file_name_id=14 function_name_id=36 line=868 end_line=868 column=39 end_column=87}
73 {file_name_id=14 function_name_id=36 line=868 end_line=868 column=19 end_column=110}
74 {file_name_id=14 function_name_id=36 line=868 end_line=868 column=12 end_column=111}
75 {file_name_id=14 function_name_id=36 line=880 end_line=880 column=12 end_column=36}
76 {file_name_id=14 function_name_id=36 line=878 end_line=878 column=17 end_column=62}
77 {file_name_id=14 function_name_id=37 line=932 end_line=932 column=19 end_column=53}
78 {file_name_id=14 function_name_id=37 line=932 end_line=932 column=18 end_column=86}
79 {file_name_id=14 function_name_id=37 line=933 end_line=933 column=11 end_column=38}
80 {file_name_id=14 function_name_id=36 line=878 end_line=878 column=13 end_column=62}
81 {file_name_id=14 function_name_id=36 line=880 end_line=880 column=40 end_column=50}
82 {file_name_id=14 function_name_id=36 line=880 end_line=880 column=54 end_column=68}
83 {file_name_id=14 function_name_id=36 line=888 end_line=888 column=19 end_column=29}
84 {file_name_id=14 function_name_id=36 line=888 end_line=888 column=11 end_column=30}
85 {file_name_id=14 function_name_id=35 line=963 end_line=963 column=12 end_column=39}
86 {file_name_id=14 function_name_id=35 line=984 end_line=984 column=12 end_column=88}
87 {file_name_id=14 function_name_id=35 line=985 end_line=985 column=14 end_column=49}
88 {file_name_id=14 function_name_id=35 line=990 end_line=990 column=30 end_column=47}
89 {file_name_id=14 function_name_id=35 line=990 end_line=990 column=49 end_column=66}
90 {file_name_id=14 function_name_id=35 line=990 end_line=990 column=13 end_column=77}
91 {file_name_id=14 function_name_id=35 line=994 end_line=994 column=15 end_column=41}
92 {file_name_id=14 function_name_id=35 line=997 end_line=997 column=15 end_column=46}
93 {file_name_id=8 function_name_id=13 line=1184 end_line=1184 column=14 end_column=48}
94 {file_name_id=8 function_name_id=13 line=1199 end_line=1199 column=14 end_column=94}
95 {file_name_id=10 function_name_id=19 line=1850 end_line=1850 column=19 end_column=88}
96 {file_name_id=10 function_name_id=38 line=1957 end_line=1957 column=14 end_column=60}
97 {file_name_id=10 function_name_id=38 line=1960 end_line=1960 column=15 end_column=74}
98 {file_name_id=10 function_name_id=25 line=121 end_line=121 column=9 end_column=82}
99 {file_name_id=10 function_name_id=20 line=1761 end_line=1761 column=13 end_column=54}
100 {file_name_id=10 function_name_id=20 line=1764 end_line=1764 column=20 end_column=52}
101 {file_name_id=10 function_name_id=20 line=1765 end_line=1765 column=21 end_column=74}
102 {file_name_id=10 function_name_id=20 line=1766 end_line=1766 column=21 end_column=67}
103 {file_name_id=10 function_name_id=20 line=1767 end_line=1767 column=15 end_column=63}
104 {file_name_id=9 function_name_id=16 line=901 end_line=901 column=68 end_column=111}
105 {file_name_id=9 function_name_id=16 line=900 end_line=902 column=8 end_column=9}
106 {file_name_id=8 function_name_id=13 line=1125 end_line=1125 column=16 end_column=75}
107 {file_name_id=8 function_name_id=13 line=1143 end_line=1143 column=12 end_column=85}
108 {file_name_id=8 function_name_id=39 line=668 end_line=668 column=13 end_column=59}
109 {file_name_id=8 function_name_id=13 line=1174 end_line=1174 column=14 end_column=106}
110 {file_name_id=8 function_name_id=13 line=1200 end_line=1200 column=12 end_column=93}
111 {file_name_id=9 function_name_id=16 line=882 end_line=890 column=4 end_column=5}
112 {file_name_id=9 function_name_id=40 line=751 end_line=751 column=37 end_column=91}
113 {file_name_id=9 function_name_id=40 line=763 end_line=763 column=26 end_column=54}
114 {file_name_id=9 function_name_id=40 line=798 end_line=800 column=10 end_column=11}
115 {file_name_id=9 function_name_id=16 line=920 end_line=920 column=8 end_column=87}
116 {file_name_id=10 function_name_id=17 line=2161 end_line=2161 column=15 end_column=100}
117 {file_name_id=10 function_name_id=41 line=2062 end_line=2062 column=17 end_column=59}
118 {file_name_id=10 function_name_id=41 line=2069 end_line=2069 column=33 end_column=55}
119 {file_name_id=10 function_name_id=41 line=2069 end_line=2069 column=25 end_column=56}
120 {file_name_id=10 function_name_id=41 line=2063 end_line=2065 column=17 end_column=5}
121 {file_name_id=10 function_name_id=42 line=2064 end_line=2064 column=17 end_column=39}
122 {file_name_id=10 function_name_id=42 line=2064 end_line=2064 column=9 end_column=40}
123 {file_name_id=10 function_name_id=20 line=1771 end_line=1771 column=34 end_column=52}
124 {file_name_id=10 function_name_id=20 line=1771 end_line=1771 column=26 end_column=53}
125 {file_name_id=10 function_name_id=20 line=1778 end_line=1778 column=16 end_column=54}
126 {file_name_id=10 function_name_id=41 line=2070 end_line=2070 column=18 end_column=46}
127 {file_name_id=9 function_name_id=16 line=915 end_line=915 column=8 end_column=101}
128 {file_name_id=10 function_name_id=20 line=1775 end_line=1775 column=17 end_column=45}
129 {file_name_id=10 function_name_id=20 line=1776 end_line=1776 column=17 end_column=60}
130 {file_name_id=10 function_name_id=20 line=1780 end_line=1780 column=16 end_column=81}
131 {file_name_id=10 function_name_id=43 line=2010 end_line=2010 column=12 end_column=80}
132 {file_name_id=10 function_name_id=43 line=2012 end_line=2012 column=15 end_column=52}
133 {file_name_id=8 function_name_id=13 line=1147 end_line=1147 column=16 end_column=91}
134 {file_name_id=8 function_name_id=39 line=670 end_line=670 column=13 end_column=61}
135 {file_name_id=8 function_name_id=13 line=1201 end_line=1201 column=14 end_column=97}
136 {file_name_id=9 function_name_id=40 line=752 end_line=752 column=39 end_column=95}
137 {file_name_id=9 function_name_id=40 line=803 end_line=805 column=10 end_column=11}
138 {file_name_id=9 function_name_id=16 line=921 end_line=921 column=8 end_column=91}
139 {file_name_id=10 function_name_id=41 line=2070 end_line=2070 column=6 end_column=46}
140 {file_name_id=8 function_name_id=13 line=1243 end_line=1243 column=12 end_column=75}
141 {file_name_id=8 function_name_id=13 line=1247 end_line=1247 column=10 end_column=61}
142 {file_name_id=8 function_name_id=44 line=733 end_line=733 column=11 end_column=51}
143 {file_name_id=6 function_name_id=11 line=180 end_line=180 column=26 end_column=48}
144 {file_name_id=11 function_name_id=22 line=2419 end_line=2421 column=15 end_column=7}
145 {file_name_id=11 function_name_id=45 line=614 end_line=621 column=11 end_column=5}
146 {file_name_id=11 function_name_id=21 line=2596 end_line=2596 column=18 end_column=57}
147 {file_name_id=11 function_name_id=22 line=2423 end_line=2425 column=19 end_column=9}
148 {file_name_id=11 function_name_id=21 line=2608 end_line=2608 column=16 end_column=60}
149 {file_name_id=11 function_name_id=22 line=2427 end_line=2427 column=32 end_column=57}
150 {file_name_id=11 function_name_id=22 line=2427 end_line=2427 column=21 end_column=57}
151 {file_name_id=11 function_name_id=22 line=2440 end_line=2440 column=23 end_column=68}
152 {file_name_id=11 function_name_id=46 line=797 end_line=797 column=19 end_column=86}
153 {file_name_id=11 function_name_id=46 line=799 end_line=799 column=39 end_column=55}
154 {file_name_id=11 function_name_id=46 line=799 end_line=799 column=20 end_column=56}
155 {file_name_id=11 function_name_id=46 line=800 end_line=800 column=14 end_column=47}
156 {file_name_id=11 function_name_id=21 line=2597 end_line=2597 column=18 end_column=57}
157 {file_name_id=11 function_name_id=22 line=2432 end_line=2434 column=19 end_column=9}
158 {file_name_id=11 function_name_id=21 line=2609 end_line=2609 column=16 end_column=60}
159 {file_name_id=11 function_name_id=22 line=2436 end_line=2436 column=32 end_column=57}
160 {file_name_id=11 function_name_id=22 line=2436 end_line=2436 column=21 end_column=57}
161 {file_name_id=11 function_name_id=46 line=798 end_line=798 column=19 end_column=116}
162 {file_name_id=11 function_name_id=46 line=801 end_line=801 column=48 end_column=60}
163 {file_name_id=11 function_name_id=46 line=801 end_line=801 column=29 end_column=62}
164 {file_name_id=11 function_name_id=22 line=2443 end_line=2448 column=29 end_column=9}
165 {file_name_id=11 function_name_id=21 line=2610 end_line=2610 column=16 end_column=58}
166 {file_name_id=11 function_name_id=22 line=2450 end_line=2450 column=52 end_column=77}
167 {file_name_id=11 function_name_id=22 line=2450 end_line=2450 column=31 end_column=77}
168 {file_name_id=11 function_name_id=22 line=2458 end_line=2458 column=31 end_column=69}
169 {file_name_id=11 function_name_id=22 line=2199 end_line=2199 column=16 end_column=77}
170 {file_name_id=11 function_name_id=47 line=1931 end_line=1931 column=39 end_column=67}
171 {file_name_id=11 function_name_id=47 line=1931 end_line=1931 column=8 end_column=117}
172 {file_name_id=11 function_name_id=47 line=1940 end_line=1940 column=21 end_column=95}
173 {file_name_id=11 function_name_id=47 line=1932 end_line=1932 column=8 end_column=106}
174 {file_name_id=11 function_name_id=21 line=2586 end_line=2586 column=35 end_column=60}
175 {file_name_id=11 function_name_id=48 line=323 end_line=323 column=13 end_column=44}
176 {file_name_id=11 function_name_id=48 line=331 end_line=340 column=13 end_column=5}
177 {file_name_id=11 function_name_id=48 line=351 end_line=351 column=13 end_column=52}
178 {file_name_id=11 function_name_id=48 line=352 end_line=352 column=6 end_column=20}
179 {file_name_id=11 function_name_id=22 line=2186 end_line=2186 column=18 end_column=118}
180 {file_name_id=11 function_name_id=23 line=706 end_line=706 column=37 end_column=89}
181 {file_name_id=11 function_name_id=23 line=711 end_line=711 column=37 end_column=70}
182 {file_name_id=11 function_name_id=22 line=2459 end_line=2459 column=20 end_column=47}
183 {file_name_id=11 function_name_id=22 line=2461 end_line=2466 column=17 end_column=9}
184 {file_name_id=11 function_name_id=22 line=2466 end_line=2466 column=10 end_column=28}
185 {file_name_id=6 function_name_id=11 line=192 end_line=192 column=19 end_column=48}
186 {file_name_id=9 function_name_id=16 line=905 end_line=905 column=16 end_column=50}
187 {file_name_id=9 function_name_id=16 line=905 end_line=905 column=8 end_column=101}
188 {file_name_id=15 function_name_id=49 line=198 end_line=199 column=11 end_column=42}
189 {file_name_id=15 function_name_id=50 line=88 end_line=88 column=4 end_column=27}
190 {file_name_id=16 function_name_id=51 line=245 end_line=245 column=2 end_column=15}
191 {file_name_id=17 function_name_id=52 line=410 end_line=410 column=6 end_column=27}
192 {file_name_id=17 function_name_id=53 line=355 end_line=355 column=13 end_column=23}
193 {file_name_id=16 function_name_id=54 line=211 end_line=211 column=37 end_column=92}
194 {file_name_id=1 function_name_id=55 line=1280 end_line=1289 column=24 end_column=5}
195 {file_name_id=3 function_name_id=4 line=1289 end_line=1289 column=15 end_column=96}
196 {file_name_id=3 function_name_id=56 line=795 end_line=802 column=8 end_column=40}
197 {file_name_id=1 function_name_id=6 line=1366 end_line=1373 column=16 end_column=5}
198 {file_name_id=18 function_name_id=57 line=135 end_line=135 column=11 end_column=38}
199 {file_name_id=3 function_name_id=4 line=872 end_line=879 column=8 end_column=5}
200 {file_name_id=3 function_name_id=58 line=706 end_line=706 column=8 end_column=85}
201 {file_name_id=14 function_name_id=59 line=155 end_line=158 column=16 end_column=5}
202 {file_name_id=14 function_name_id=59 line=182 end_line=182 column=15 end_column=66}
203 {file_name_id=4 function_name_id=5 line=150 end_line=150 column=9 end_column=66}
204 {file_name_id=4 function_name_id=60 line=126 end_line=126 column=11 end_column=44}
205 {file_name_id=4 function_name_id=61 line=124 end_line=124 column=13 end_column=35}
206 {file_name_id=1 function_name_id=6 line=1363 end_line=1363 column=16 end_column=92}
207 {file_name_id=1 function_name_id=6 line=1382 end_line=1382 column=23 end_column=59}
208 {file_name_id=3 function_name_id=56 line=831 end_line=844 column=15 end_column=7}
209 {file_name_id=3 function_name_id=56 line=847 end_line=847 column=15 end_column=41}
210 {file_name_id=1 function_name_id=6 line=1362 end_line=1362 column=17 end_column=87}
211 {file_name_id=1 function_name_id=6 line=1381 end_line=1381 column=15 end_column=43}
212 {file_name_id=1 function_name_id=6 line=1385 end_line=1385 column=13 end_column=78}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=1}
7 {file_location_id=2 parent_frame_id=7}
8 {file_location_id=3 parent_frame_id=8}
9 {file_location_id=4 parent_frame_id=9}
10 {file_location_id=5 parent_frame_id=10}
11 {file_location_id=7 parent_frame_id=1}
12 {file_location_id=8 parent_frame_id=12}
13 {file_location_id=9 parent_frame_id=13}
14 {file_location_id=10 parent_frame_id=14}
15 {file_location_id=11 parent_frame_id=15}
16 {file_location_id=10 parent_frame_id=16}
17 {file_location_id=12 parent_frame_id=17}
18 {file_location_id=13 parent_frame_id=15}
19 {file_location_id=10 parent_frame_id=19}
20 {file_location_id=14 parent_frame_id=20}
21 {file_location_id=15 parent_frame_id=21}
22 {file_location_id=10 parent_frame_id=22}
23 {file_location_id=16 parent_frame_id=23}
24 {file_location_id=17 parent_frame_id=24}
25 {file_location_id=18 parent_frame_id=20}
26 {file_location_id=10 parent_frame_id=26}
27 {file_location_id=19 parent_frame_id=27}
28 {file_location_id=20 parent_frame_id=28}
29 {file_location_id=21 parent_frame_id=29}
30 {file_location_id=22 parent_frame_id=30}
31 {file_location_id=23 parent_frame_id=30}
32 {file_location_id=24 parent_frame_id=27}
33 {file_location_id=20 parent_frame_id=33}
34 {file_location_id=21 parent_frame_id=34}
35 {file_location_id=22 parent_frame_id=35}
36 {file_location_id=23 parent_frame_id=35}
37 {file_location_id=25 parent_frame_id=15}
38 {file_location_id=10 parent_frame_id=38}
39 {file_location_id=12 parent_frame_id=39}
40 {file_location_id=26 parent_frame_id=15}
41 {file_location_id=10 parent_frame_id=41}
42 {file_location_id=27 parent_frame_id=42}
43 {file_location_id=28 parent_frame_id=43}
44 {file_location_id=29 parent_frame_id=44}
45 {file_location_id=30 parent_frame_id=42}
46 {file_location_id=31 parent_frame_id=39}
47 {file_location_id=32 parent_frame_id=29}
48 {file_location_id=33 parent_frame_id=48}
49 {file_location_id=34 parent_frame_id=48}
50 {file_location_id=35 parent_frame_id=48}
51 {file_location_id=36 parent_frame_id=48}
52 {file_location_id=37 parent_frame_id=48}
53 {file_location_id=38 parent_frame_id=48}
54 {file_location_id=39 parent_frame_id=48}
55 {file_location_id=40 parent_frame_id=29}
56 {file_location_id=41 parent_frame_id=56}
57 {file_location_id=42 parent_frame_id=24}
58 {file_location_id=43 parent_frame_id=58}
59 {file_location_id=44 parent_frame_id=59}
60 {file_location_id=45 parent_frame_id=60}
61 {file_location_id=31 parent_frame_id=17}
62 {file_location_id=46 parent_frame_id=17}
63 {file_location_id=47 parent_frame_id=17}
64 {file_location_id=48 parent_frame_id=17}
65 {file_location_id=49 parent_frame_id=17}
66 {file_location_id=50 parent_frame_id=17}
67 {file_location_id=51 parent_frame_id=17}
68 {file_location_id=52 parent_frame_id=17}
69 {file_location_id=53 parent_frame_id=20}
70 {file_location_id=54 parent_frame_id=70}
71 {file_location_id=55 parent_frame_id=71}
72 {file_location_id=56 parent_frame_id=20}
73 {file_location_id=57 parent_frame_id=73}
74 {file_location_id=10 parent_frame_id=74}
75 {file_location_id=58 parent_frame_id=75}
76 {file_location_id=59 parent_frame_id=75}
77 {file_location_id=60 parent_frame_id=77}
78 {file_location_id=61 parent_frame_id=75}
79 {file_location_id=62 parent_frame_id=75}
80 {file_location_id=63 parent_frame_id=20}
81 {file_location_id=64 parent_frame_id=81}
82 {file_location_id=10 parent_frame_id=82}
83 {file_location_id=65 parent_frame_id=83}
84 {file_location_id=66 parent_frame_id=83}
85 {file_location_id=67 parent_frame_id=83}
86 {file_location_id=68 parent_frame_id=83}
87 {file_location_id=69 parent_frame_id=87}
88 {file_location_id=70 parent_frame_id=87}
89 {file_location_id=71 parent_frame_id=87}
90 {file_location_id=72 parent_frame_id=87}
91 {file_location_id=73 parent_frame_id=87}
92 {file_location_id=74 parent_frame_id=87}
93 {file_location_id=75 parent_frame_id=87}
94 {file_location_id=76 parent_frame_id=87}
95 {file_location_id=77 parent_frame_id=95}
96 {file_location_id=78 parent_frame_id=95}
97 {file_location_id=79 parent_frame_id=95}
98 {file_location_id=80 parent_frame_id=87}
99 {file_location_id=81 parent_frame_id=87}
100 {file_location_id=82 parent_frame_id=87}
101 {file_location_id=83 parent_frame_id=87}
102 {file_location_id=84 parent_frame_id=87}
103 {file_location_id=85 parent_frame_id=83}
104 {file_location_id=86 parent_frame_id=83}
105 {file_location_id=87 parent_frame_id=83}
106 {file_location_id=88 parent_frame_id=83}
107 {file_location_id=89 parent_frame_id=83}
108 {file_location_id=90 parent_frame_id=83}
109 {file_location_id=91 parent_frame_id=83}
110 {file_location_id=92 parent_frame_id=83}
111 {file_location_id=93 parent_frame_id=20}
112 {file_location_id=94 parent_frame_id=20}
113 {file_location_id=54 parent_frame_id=113}
114 {file_location_id=55 parent_frame_id=114}
115 {file_location_id=95 parent_frame_id=29}
116 {file_location_id=96 parent_frame_id=116}
117 {file_location_id=97 parent_frame_id=116}
118 {file_location_id=98 parent_frame_id=56}
119 {file_location_id=99 parent_frame_id=30}
120 {file_location_id=100 parent_frame_id=30}
121 {file_location_id=101 parent_frame_id=30}
122 {file_location_id=102 parent_frame_id=30}
123 {file_location_id=103 parent_frame_id=30}
124 {file_location_id=32 parent_frame_id=34}
125 {file_location_id=33 parent_frame_id=125}
126 {file_location_id=34 parent_frame_id=125}
127 {file_location_id=35 parent_frame_id=125}
128 {file_location_id=36 parent_frame_id=125}
129 {file_location_id=37 parent_frame_id=125}
130 {file_location_id=104 parent_frame_id=24}
131 {file_location_id=105 parent_frame_id=24}
132 {file_location_id=38 parent_frame_id=125}
133 {file_location_id=39 parent_frame_id=125}
134 {file_location_id=40 parent_frame_id=34}
135 {file_location_id=41 parent_frame_id=135}
136 {file_location_id=106 parent_frame_id=20}
137 {file_location_id=54 parent_frame_id=137}
138 {file_location_id=55 parent_frame_id=138}
139 {file_location_id=107 parent_frame_id=20}
140 {file_location_id=108 parent_frame_id=140}
141 {file_location_id=10 parent_frame_id=141}
142 {file_location_id=58 parent_frame_id=142}
143 {file_location_id=59 parent_frame_id=142}
144 {file_location_id=60 parent_frame_id=144}
145 {file_location_id=61 parent_frame_id=142}
146 {file_location_id=62 parent_frame_id=142}
147 {file_location_id=109 parent_frame_id=20}
148 {file_location_id=64 parent_frame_id=148}
149 {file_location_id=10 parent_frame_id=149}
150 {file_location_id=65 parent_frame_id=150}
151 {file_location_id=66 parent_frame_id=150}
152 {file_location_id=67 parent_frame_id=150}
153 {file_location_id=68 parent_frame_id=150}
154 {file_location_id=69 parent_frame_id=154}
155 {file_location_id=70 parent_frame_id=154}
156 {file_location_id=71 parent_frame_id=154}
157 {file_location_id=72 parent_frame_id=154}
158 {file_location_id=73 parent_frame_id=154}
159 {file_location_id=74 parent_frame_id=154}
160 {file_location_id=75 parent_frame_id=154}
161 {file_location_id=76 parent_frame_id=154}
162 {file_location_id=77 parent_frame_id=162}
163 {file_location_id=78 parent_frame_id=162}
164 {file_location_id=79 parent_frame_id=162}
165 {file_location_id=80 parent_frame_id=154}
166 {file_location_id=81 parent_frame_id=154}
167 {file_location_id=82 parent_frame_id=154}
168 {file_location_id=83 parent_frame_id=154}
169 {file_location_id=84 parent_frame_id=154}
170 {file_location_id=85 parent_frame_id=150}
171 {file_location_id=86 parent_frame_id=150}
172 {file_location_id=87 parent_frame_id=150}
173 {file_location_id=88 parent_frame_id=150}
174 {file_location_id=89 parent_frame_id=150}
175 {file_location_id=90 parent_frame_id=150}
176 {file_location_id=91 parent_frame_id=150}
177 {file_location_id=92 parent_frame_id=150}
178 {file_location_id=110 parent_frame_id=20}
179 {file_location_id=54 parent_frame_id=179}
180 {file_location_id=55 parent_frame_id=180}
181 {file_location_id=111 parent_frame_id=24}
182 {file_location_id=112 parent_frame_id=182}
183 {file_location_id=113 parent_frame_id=182}
184 {file_location_id=114 parent_frame_id=182}
185 {file_location_id=115 parent_frame_id=24}
186 {file_location_id=43 parent_frame_id=186}
187 {file_location_id=44 parent_frame_id=187}
188 {file_location_id=45 parent_frame_id=188}
189 {file_location_id=95 parent_frame_id=34}
190 {file_location_id=96 parent_frame_id=190}
191 {file_location_id=97 parent_frame_id=190}
192 {file_location_id=98 parent_frame_id=135}
193 {file_location_id=99 parent_frame_id=35}
194 {file_location_id=116 parent_frame_id=27}
195 {file_location_id=117 parent_frame_id=195}
196 {file_location_id=118 parent_frame_id=195}
197 {file_location_id=119 parent_frame_id=195}
198 {file_location_id=120 parent_frame_id=195}
199 {file_location_id=121 parent_frame_id=199}
200 {file_location_id=122 parent_frame_id=199}
201 {file_location_id=123 parent_frame_id=30}
202 {file_location_id=124 parent_frame_id=30}
203 {file_location_id=125 parent_frame_id=30}
204 {file_location_id=123 parent_frame_id=35}
205 {file_location_id=124 parent_frame_id=35}
206 {file_location_id=125 parent_frame_id=35}
207 {file_location_id=126 parent_frame_id=195}
208 {file_location_id=127 parent_frame_id=24}
209 {file_location_id=43 parent_frame_id=209}
210 {file_location_id=44 parent_frame_id=210}
211 {file_location_id=45 parent_frame_id=211}
212 {file_location_id=128 parent_frame_id=30}
213 {file_location_id=129 parent_frame_id=30}
214 {file_location_id=130 parent_frame_id=30}
215 {file_location_id=131 parent_frame_id=215}
216 {file_location_id=132 parent_frame_id=215}
217 {file_location_id=133 parent_frame_id=20}
218 {file_location_id=134 parent_frame_id=218}
219 {file_location_id=10 parent_frame_id=219}
220 {file_location_id=58 parent_frame_id=220}
221 {file_location_id=59 parent_frame_id=220}
222 {file_location_id=60 parent_frame_id=222}
223 {file_location_id=61 parent_frame_id=220}
224 {file_location_id=62 parent_frame_id=220}
225 {file_location_id=135 parent_frame_id=20}
226 {file_location_id=54 parent_frame_id=226}
227 {file_location_id=55 parent_frame_id=227}
228 {file_location_id=136 parent_frame_id=182}
229 {file_location_id=137 parent_frame_id=182}
230 {file_location_id=138 parent_frame_id=24}
231 {file_location_id=43 parent_frame_id=231}
232 {file_location_id=44 parent_frame_id=232}
233 {file_location_id=45 parent_frame_id=233}
234 {file_location_id=129 parent_frame_id=35}
235 {file_location_id=130 parent_frame_id=35}
236 {file_location_id=131 parent_frame_id=236}
237 {file_location_id=132 parent_frame_id=236}
238 {file_location_id=139 parent_frame_id=195}
239 {file_location_id=140 parent_frame_id=20}
240 {file_location_id=54 parent_frame_id=240}
241 {file_location_id=55 parent_frame_id=241}
242 {file_location_id=141 parent_frame_id=20}
243 {file_location_id=142 parent_frame_id=243}
244 {file_location_id=10 parent_frame_id=244}
245 {file_location_id=58 parent_frame_id=245}
246 {file_location_id=59 parent_frame_id=245}
247 {file_location_id=60 parent_frame_id=247}
248 {file_location_id=61 parent_frame_id=245}
249 {file_location_id=62 parent_frame_id=245}
250 {file_location_id=143 parent_frame_id=15}
251 {file_location_id=46 parent_frame_id=39}
252 {file_location_id=47 parent_frame_id=39}
253 {file_location_id=48 parent_frame_id=39}
254 {file_location_id=49 parent_frame_id=39}
255 {file_location_id=50 parent_frame_id=39}
256 {file_location_id=51 parent_frame_id=39}
257 {file_location_id=52 parent_frame_id=39}
258 {file_location_id=144 parent_frame_id=43}
259 {file_location_id=145 parent_frame_id=259}
260 {file_location_id=54 parent_frame_id=260}
261 {file_location_id=55 parent_frame_id=261}
262 {file_location_id=146 parent_frame_id=42}
263 {file_location_id=147 parent_frame_id=43}
264 {file_location_id=148 parent_frame_id=42}
265 {file_location_id=149 parent_frame_id=43}
266 {file_location_id=150 parent_frame_id=43}
267 {file_location_id=151 parent_frame_id=43}
268 {file_location_id=152 parent_frame_id=268}
269 {file_location_id=153 parent_frame_id=268}
270 {file_location_id=154 parent_frame_id=268}
271 {file_location_id=8 parent_frame_id=271}
272 {file_location_id=9 parent_frame_id=272}
273 {file_location_id=10 parent_frame_id=273}
274 {file_location_id=26 parent_frame_id=274}
275 {file_location_id=10 parent_frame_id=275}
276 {file_location_id=27 parent_frame_id=276}
277 {file_location_id=151 parent_frame_id=277}
278 {file_location_id=154 parent_frame_id=278}
279 {file_location_id=155 parent_frame_id=268}
280 {file_location_id=156 parent_frame_id=42}
281 {file_location_id=157 parent_frame_id=43}
282 {file_location_id=158 parent_frame_id=42}
283 {file_location_id=159 parent_frame_id=43}
284 {file_location_id=160 parent_frame_id=43}
285 {file_location_id=161 parent_frame_id=268}
286 {file_location_id=162 parent_frame_id=268}
287 {file_location_id=163 parent_frame_id=268}
288 {file_location_id=164 parent_frame_id=43}
289 {file_location_id=165 parent_frame_id=42}
290 {file_location_id=166 parent_frame_id=43}
291 {file_location_id=167 parent_frame_id=43}
292 {file_location_id=168 parent_frame_id=43}
293 {file_location_id=169 parent_frame_id=43}
294 {file_location_id=170 parent_frame_id=294}
295 {file_location_id=171 parent_frame_id=294}
296 {file_location_id=145 parent_frame_id=296}
297 {file_location_id=54 parent_frame_id=297}
298 {file_location_id=55 parent_frame_id=298}
299 {file_location_id=172 parent_frame_id=294}
300 {file_location_id=173 parent_frame_id=294}
301 {file_location_id=145 parent_frame_id=301}
302 {file_location_id=54 parent_frame_id=302}
303 {file_location_id=55 parent_frame_id=303}
304 {file_location_id=174 parent_frame_id=42}
305 {file_location_id=10 parent_frame_id=305}
306 {file_location_id=175 parent_frame_id=306}
307 {file_location_id=176 parent_frame_id=306}
308 {file_location_id=60 parent_frame_id=308}
309 {file_location_id=177 parent_frame_id=306}
310 {file_location_id=178 parent_frame_id=306}
311 {file_location_id=179 parent_frame_id=43}
312 {file_location_id=145 parent_frame_id=312}
313 {file_location_id=54 parent_frame_id=313}
314 {file_location_id=55 parent_frame_id=314}
315 {file_location_id=180 parent_frame_id=44}
316 {file_location_id=181 parent_frame_id=44}
317 {file_location_id=182 parent_frame_id=43}
318 {file_location_id=183 parent_frame_id=43}
319 {file_location_id=184 parent_frame_id=43}
320 {file_location_id=185 parent_frame_id=15}
321 {file_location_id=186 parent_frame_id=24}
322 {file_location_id=187 parent_frame_id=24}
323 {file_location_id=188 parent_frame_id=1}
324 {file_location_id=189 parent_frame_id=324}
325 {file_location_id=190 parent_frame_id=325}
326 {file_location_id=191 parent_frame_id=326}
327 {file_location_id=192 parent_frame_id=327}
328 {file_location_id=193 parent_frame_id=328}
329 {file_location_id=194 parent_frame_id=329}
330 {file_location_id=6 parent_frame_id=330}
331 {file_location_id=2 parent_frame_id=331}
332 {file_location_id=3 parent_frame_id=332}
333 {file_location_id=4 parent_frame_id=333}
334 {file_location_id=5 parent_frame_id=334}
335 {file_location_id=6 parent_frame_id=335}
336 {file_location_id=2 parent_frame_id=336}
337 {file_location_id=3 parent_frame_id=337}
338 {file_location_id=4 parent_frame_id=338}
339 {file_location_id=5 parent_frame_id=339}
340 {file_location_id=6 parent_frame_id=340}
341 {file_location_id=2 parent_frame_id=341}
342 {file_location_id=3 parent_frame_id=342}
343 {file_location_id=4 parent_frame_id=343}
344 {file_location_id=5 parent_frame_id=344}
345 {file_location_id=195 parent_frame_id=333}
346 {file_location_id=196 parent_frame_id=346}
347 {file_location_id=8 parent_frame_id=347}
348 {file_location_id=12 parent_frame_id=348}
349 {file_location_id=197 parent_frame_id=1}
350 {file_location_id=198 parent_frame_id=350}
351 {file_location_id=197 parent_frame_id=351}
352 {file_location_id=198 parent_frame_id=352}
353 {file_location_id=199 parent_frame_id=333}
354 {file_location_id=200 parent_frame_id=354}
355 {file_location_id=8 parent_frame_id=355}
356 {file_location_id=201 parent_frame_id=356}
357 {file_location_id=202 parent_frame_id=356}
358 {file_location_id=203 parent_frame_id=334}
359 {file_location_id=204 parent_frame_id=359}
360 {file_location_id=205 parent_frame_id=360}
361 {file_location_id=206 parent_frame_id=330}
362 {file_location_id=207 parent_frame_id=330}
363 {file_location_id=31 parent_frame_id=348}
364 {file_location_id=46 parent_frame_id=348}
365 {file_location_id=47 parent_frame_id=348}
366 {file_location_id=48 parent_frame_id=348}
367 {file_location_id=49 parent_frame_id=348}
368 {file_location_id=50 parent_frame_id=348}
369 {file_location_id=51 parent_frame_id=348}
370 {file_location_id=52 parent_frame_id=348}
371 {file_location_id=208 parent_frame_id=346}
372 {file_location_id=8 parent_frame_id=372}
373 {file_location_id=58 parent_frame_id=373}
374 {file_location_id=59 parent_frame_id=373}
375 {file_location_id=60 parent_frame_id=375}
376 {file_location_id=209 parent_frame_id=346}
377 {file_location_id=210 parent_frame_id=330}
378 {file_location_id=211 parent_frame_id=330}
379 {file_location_id=197 parent_frame_id=330}
380 {file_location_id=198 parent_frame_id=380}
381 {file_location_id=212 parent_frame_id=330}


%dynamic_index_in_dim.1 (Arg_0.1: f32[12,8,64], Arg_1.1: s32[]) -> f32[8,64] {
  %Arg_0.1 = f32[12,8,64]{2,1,0} parameter(0)
  %Arg_1.1 = s32[] parameter(1)
  %constant.17 = s32[] constant(0)
  %dynamic_slice.1 = f32[1,8,64]{2,1,0} dynamic-slice(%Arg_0.1, %Arg_1.1, %constant.17, %constant.17), dynamic_slice_sizes={1,8,64}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.1 = f32[8,64]{1,0} reshape(%dynamic_slice.1), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_0.2 (Arg_0.3: f32[12,2880,8,64], Arg_1.3: s32[]) -> f32[2880,8,64] {
  %Arg_0.3 = f32[12,2880,8,64]{3,2,1,0} parameter(0)
  %Arg_1.3 = s32[] parameter(1)
  %constant.19 = s32[] constant(0)
  %dynamic_slice.3 = f32[1,2880,8,64]{3,2,1,0} dynamic-slice(%Arg_0.3, %Arg_1.3, %constant.19, %constant.19, %constant.19), dynamic_slice_sizes={1,2880,8,64}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.3 = f32[2880,8,64]{2,1,0} reshape(%dynamic_slice.3), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_1.3 (Arg_0.5: f32[12,2880], Arg_1.5: s32[]) -> f32[2880] {
  %Arg_0.5 = f32[12,2880]{1,0} parameter(0)
  %Arg_1.5 = s32[] parameter(1)
  %constant.21 = s32[] constant(0)
  %dynamic_slice.5 = f32[1,2880]{1,0} dynamic-slice(%Arg_0.5, %Arg_1.5, %constant.21), dynamic_slice_sizes={1,2880}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.5 = f32[2880]{0} reshape(%dynamic_slice.5), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_2.4 (Arg_0.7: f32[12,64,64,2880], Arg_1.7: s32[]) -> f32[64,64,2880] {
  %Arg_0.7 = f32[12,64,64,2880]{3,2,1,0} parameter(0)
  %Arg_1.7 = s32[] parameter(1)
  %constant.23 = s32[] constant(0)
  %dynamic_slice.7 = f32[1,64,64,2880]{3,2,1,0} dynamic-slice(%Arg_0.7, %Arg_1.7, %constant.23, %constant.23, %constant.23), dynamic_slice_sizes={1,64,64,2880}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.7 = f32[64,64,2880]{2,1,0} reshape(%dynamic_slice.7), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_3.5 (Arg_0.9: f32[12,64,64], Arg_1.9: s32[]) -> f32[64,64] {
  %Arg_0.9 = f32[12,64,64]{2,1,0} parameter(0)
  %Arg_1.9 = s32[] parameter(1)
  %constant.25 = s32[] constant(0)
  %dynamic_slice.9 = f32[1,64,64]{2,1,0} dynamic-slice(%Arg_0.9, %Arg_1.9, %constant.25, %constant.25), dynamic_slice_sizes={1,64,64}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.9 = f32[64,64]{1,0} reshape(%dynamic_slice.9), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_4.6 (Arg_0.11: f32[12,2880,64,64], Arg_1.11: s32[]) -> f32[2880,64,64] {
  %Arg_0.11 = f32[12,2880,64,64]{3,2,1,0} parameter(0)
  %Arg_1.11 = s32[] parameter(1)
  %constant.27 = s32[] constant(0)
  %dynamic_slice.11 = f32[1,2880,64,64]{3,2,1,0} dynamic-slice(%Arg_0.11, %Arg_1.11, %constant.27, %constant.27, %constant.27), dynamic_slice_sizes={1,2880,64,64}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.11 = f32[2880,64,64]{2,1,0} reshape(%dynamic_slice.11), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_5.7 (Arg_0.13: f32[12,64], Arg_1.13: s32[]) -> f32[64] {
  %Arg_0.13 = f32[12,64]{1,0} parameter(0)
  %Arg_1.13 = s32[] parameter(1)
  %constant.29 = s32[] constant(0)
  %dynamic_slice.13 = f32[1,64]{1,0} dynamic-slice(%Arg_0.13, %Arg_1.13, %constant.29), dynamic_slice_sizes={1,64}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.13 = f32[64]{0} reshape(%dynamic_slice.13), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_6.8 (Arg_0.15: f32[12,32], Arg_1.15: s32[]) -> f32[32] {
  %Arg_0.15 = f32[12,32]{1,0} parameter(0)
  %Arg_1.15 = s32[] parameter(1)
  %constant.31 = s32[] constant(0)
  %dynamic_slice.15 = f32[1,32]{1,0} dynamic-slice(%Arg_0.15, %Arg_1.15, %constant.31), dynamic_slice_sizes={1,32}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.15 = f32[32]{0} reshape(%dynamic_slice.15), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_7.9 (Arg_0.17: f32[12,2880,32], Arg_1.17: s32[]) -> f32[2880,32] {
  %Arg_0.17 = f32[12,2880,32]{2,1,0} parameter(0)
  %Arg_1.17 = s32[] parameter(1)
  %constant.33 = s32[] constant(0)
  %dynamic_slice.17 = f32[1,2880,32]{2,1,0} dynamic-slice(%Arg_0.17, %Arg_1.17, %constant.33, %constant.33), dynamic_slice_sizes={1,2880,32}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.17 = f32[2880,32]{1,0} reshape(%dynamic_slice.17), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_8.10 (Arg_0.19: f32[12,32,2880,2880], Arg_1.19: s32[]) -> f32[32,2880,2880] {
  %Arg_0.19 = f32[12,32,2880,2880]{3,2,1,0} parameter(0)
  %Arg_1.19 = s32[] parameter(1)
  %constant.35 = s32[] constant(0)
  %dynamic_slice.19 = f32[1,32,2880,2880]{3,2,1,0} dynamic-slice(%Arg_0.19, %Arg_1.19, %constant.35, %constant.35, %constant.35), dynamic_slice_sizes={1,32,2880,2880}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.19 = f32[32,2880,2880]{2,1,0} reshape(%dynamic_slice.19), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_9.11 (Arg_0.21: f32[12,32,2880], Arg_1.21: s32[]) -> f32[32,2880] {
  %Arg_0.21 = f32[12,32,2880]{2,1,0} parameter(0)
  %Arg_1.21 = s32[] parameter(1)
  %constant.37 = s32[] constant(0)
  %dynamic_slice.21 = f32[1,32,2880]{2,1,0} dynamic-slice(%Arg_0.21, %Arg_1.21, %constant.37, %constant.37), dynamic_slice_sizes={1,32,2880}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.21 = f32[32,2880]{1,0} reshape(%dynamic_slice.21), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_10.12 (Arg_0.23: s32[12,1], Arg_1.23: s32[]) -> s32[1] {
  %Arg_0.23 = s32[12,1]{1,0} parameter(0)
  %Arg_1.23 = s32[] parameter(1)
  %constant.39 = s32[] constant(0)
  %dynamic_slice.23 = s32[1,1]{1,0} dynamic-slice(%Arg_0.23, %Arg_1.23, %constant.39), dynamic_slice_sizes={1,1}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.23 = s32[1]{0} reshape(%dynamic_slice.23), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_11.13 (Arg_0.25: s32[12,8,1984], Arg_1.25: s32[]) -> s32[8,1984] {
  %Arg_0.25 = s32[12,8,1984]{2,1,0} parameter(0)
  %Arg_1.25 = s32[] parameter(1)
  %constant.41 = s32[] constant(0)
  %dynamic_slice.25 = s32[1,8,1984]{2,1,0} dynamic-slice(%Arg_0.25, %Arg_1.25, %constant.41, %constant.41), dynamic_slice_sizes={1,8,1984}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.25 = s32[8,1984]{1,0} reshape(%dynamic_slice.25), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_12.14 (Arg_0.27: s32[12,8,64], Arg_1.27: s32[]) -> s32[8,64] {
  %Arg_0.27 = s32[12,8,64]{2,1,0} parameter(0)
  %Arg_1.27 = s32[] parameter(1)
  %constant.43 = s32[] constant(0)
  %dynamic_slice.27 = s32[1,8,64]{2,1,0} dynamic-slice(%Arg_0.27, %Arg_1.27, %constant.43, %constant.43), dynamic_slice_sizes={1,8,64}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.27 = s32[8,64]{1,0} reshape(%dynamic_slice.27), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_13.15 (Arg_0.29: bf16[12,1984,8,8,64], Arg_1.29: s32[]) -> bf16[1984,8,8,64] {
  %Arg_0.29 = bf16[12,1984,8,8,64]{4,3,2,1,0} parameter(0)
  %Arg_1.29 = s32[] parameter(1)
  %constant.45 = s32[] constant(0)
  %dynamic_slice.29 = bf16[1,1984,8,8,64]{4,3,2,1,0} dynamic-slice(%Arg_0.29, %Arg_1.29, %constant.45, %constant.45, %constant.45, /*index=5*/%constant.45), dynamic_slice_sizes={1,1984,8,8,64}, metadata={op_name="dynamic_slice" stack_frame_id=10}
