HloModule jit_apply_fn, entry_computation_layout={(f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,128]{2,1,0}, /*index=5*/bf16[4,128,4]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,4,32]{3,2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, /*index=10*/bf16[4,128,128]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,128]{2,1,0}, bf16[4,128,4]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, /*index=15*/bf16[4,128,4,32]{3,2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,1024]{2,1,0}, bf16[4,512,128]{2,1,0}, /*index=20*/bf16[4,384,384]{2,1,0}, bf16[4,384,16,24]{3,2,1,0}, f32[4,384]{1,0}, f32[4,384]{1,0}, bf16[4,16,24]{2,1,0}, /*index=25*/bf16[4,384,16,24]{3,2,1,0}, bf16[4,384,384]{2,1,0}, bf16[4,384,16,24]{3,2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, /*index=30*/bf16[4,128,16]{2,1,0}, f32[4,384]{1,0}, f32[4,384]{1,0}, bf16[4,384,3072]{2,1,0}, bf16[4,1536,384]{2,1,0}, /*index=35*/f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,256]{2,1,0}, bf16[4,128,128]{2,1,0}, f32[4,128]{1,0}, /*index=40*/f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, bf16[4,128,256]{2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, /*index=45*/bf16[4,128,256]{2,1,0}, bf16[4,128,128]{2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, /*index=50*/bf16[4,128,256]{2,1,0}, f32[384]{0}, f32[384]{0}, f32[384,24,2]{2,1,0}, f32[128,64]{1,0}, /*index=55*/f32[128]{0}, f32[128]{0}, f32[128,64]{1,0}, f32[128]{0}, f32[128]{0}, /*index=60*/f32[384,24,50]{2,1,0}, f32[384]{0}, f32[384]{0}, bf16[39,128]{1,0}, bf16[447,128]{1,0}, /*index=65*/bf16[447,128]{1,0}, f32[128,64]{1,0}, f32[4,64]{1,0}, f32[4,64]{1,0}, bf16[4,64,64]{2,1,0}, /*index=70*/bf16[4,64,64]{2,1,0}, bf16[4,128,8]{2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,64,8,8]{3,2,1,0}, /*index=75*/f32[4,64]{1,0}, f32[4,64]{1,0}, bf16[4,64,512]{2,1,0}, bf16[4,256,64]{2,1,0}, bf16[4,128]{1,0}, /*index=80*/bf16[4,32,32,128]{3,2,1,0}, f32[4,64]{1,0}, f32[4,64]{1,0}, bf16[4,64,32]{2,1,0}, bf16[4,64,32]{2,1,0}, /*index=85*/f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,128]{2,1,0}, /*index=90*/bf16[4,128,4]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,4,32]{3,2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, /*index=95*/bf16[4,128,128]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,128]{2,1,0}, bf16[4,128,4]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, /*index=100*/bf16[4,128,4,32]{3,2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,1024]{2,1,0}, bf16[4,512,128]{2,1,0}, /*index=105*/f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,256]{2,1,0}, bf16[4,128,128]{2,1,0}, f32[4,128]{1,0}, /*index=110*/f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, bf16[4,128,256]{2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, /*index=115*/bf16[4,128,256]{2,1,0}, bf16[4,128,128]{2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, /*index=120*/bf16[4,128,256]{2,1,0}, f32[48,128]{1,0}, f32[48,128]{1,0}, bf16[48,128,128]{2,1,0}, bf16[48,4,32,128]{3,2,1,0}, /*index=125*/bf16[48,128,128]{2,1,0}, bf16[48,128,4]{2,1,0}, bf16[48,4,32,128]{3,2,1,0}, bf16[48,128,4,32]{3,2,1,0}, f32[48,128]{1,0}, /*index=130*/f32[48,128]{1,0}, bf16[48,128,128]{2,1,0}, bf16[48,4,32,128]{3,2,1,0}, bf16[48,128,128]{2,1,0}, bf16[48,128,4]{2,1,0}, /*index=135*/bf16[48,4,32,128]{3,2,1,0}, bf16[48,128,4,32]{3,2,1,0}, f32[48,128]{1,0}, f32[48,128]{1,0}, bf16[48,128,1024]{2,1,0}, /*index=140*/bf16[48,512,128]{2,1,0}, bf16[48,384,384]{2,1,0}, bf16[48,384,16,24]{3,2,1,0}, f32[48,384]{1,0}, f32[48,384]{1,0}, /*index=145*/bf16[48,16,24]{2,1,0}, bf16[48,384,16,24]{3,2,1,0}, bf16[48,384,384]{2,1,0}, bf16[48,384,16,24]{3,2,1,0}, f32[48,128]{1,0}, /*index=150*/f32[48,128]{1,0}, bf16[48,128,16]{2,1,0}, f32[48,384]{1,0}, f32[48,384]{1,0}, bf16[48,384,3072]{2,1,0}, /*index=155*/bf16[48,1536,384]{2,1,0}, f32[48,128]{1,0}, f32[48,128]{1,0}, bf16[48,128,256]{2,1,0}, bf16[48,128,128]{2,1,0}, /*index=160*/f32[48,128]{1,0}, f32[48,128]{1,0}, bf16[48,128,128]{2,1,0}, bf16[48,128,256]{2,1,0}, f32[48,128]{1,0}, /*index=165*/f32[48,128]{1,0}, bf16[48,128,256]{2,1,0}, bf16[48,128,128]{2,1,0}, f32[48,128]{1,0}, f32[48,128]{1,0}, /*index=170*/bf16[48,128,128]{2,1,0}, bf16[48,128,256]{2,1,0}, bf16[1,128]{1,0}, bf16[447,64]{1,0}, bf16[447,128]{1,0}, /*index=175*/bf16[34,64]{1,0}, bf16[128,128]{1,0}, f32[128]{0}, f32[128]{0}, bf16[384,384]{1,0}, /*index=180*/f32[384]{0}, f32[384]{0}, bf16[447,128]{1,0}, bf16[447,384]{1,0}, bf16[64,128]{1,0}, /*index=185*/f32[2,64]{1,0}, f32[2,64]{1,0}, bf16[2,64,64]{2,1,0}, bf16[2,4,16,64]{3,2,1,0}, bf16[2,64,64]{2,1,0}, /*index=190*/bf16[2,64,4]{2,1,0}, bf16[2,4,16,64]{3,2,1,0}, bf16[2,64,4,16]{3,2,1,0}, f32[2,64]{1,0}, f32[2,64]{1,0}, /*index=195*/bf16[2,64,64]{2,1,0}, bf16[2,4,16,64]{3,2,1,0}, bf16[2,64,64]{2,1,0}, bf16[2,64,4]{2,1,0}, bf16[2,4,16,64]{3,2,1,0}, /*index=200*/bf16[2,64,4,16]{3,2,1,0}, f32[2,64]{1,0}, f32[2,64]{1,0}, bf16[2,64,256]{2,1,0}, bf16[2,128,64]{2,1,0}, /*index=205*/f32[2,64]{1,0}, f32[2,64]{1,0}, bf16[2,64,128]{2,1,0}, bf16[2,64,64]{2,1,0}, f32[2,64]{1,0}, /*index=210*/f32[2,64]{1,0}, bf16[2,64,64]{2,1,0}, bf16[2,64,128]{2,1,0}, f32[2,64]{1,0}, f32[2,64]{1,0}, /*index=215*/bf16[2,64,128]{2,1,0}, bf16[2,64,64]{2,1,0}, f32[2,64]{1,0}, f32[2,64]{1,0}, bf16[2,64,64]{2,1,0}, /*index=220*/bf16[2,64,128]{2,1,0}, f32[64]{0}, f32[64]{0}, f32[128]{0}, f32[128]{0}, /*index=225*/bf16[39,64]{1,0}, bf16[64]{0}, bf16[31,64]{1,0}, bf16[31,64]{1,0}, bf16[64]{0}, /*index=230*/bf16[64]{0}, bf16[64]{0}, bf16[64]{0}, bf16[128,64]{1,0}, bf16[139,128]{1,0}, /*index=235*/f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,128]{2,1,0}, /*index=240*/f32[3,128]{1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,512]{2,1,0}, f32[3,256,128]{2,1,0}, /*index=245*/f32[3,128,128]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, /*index=250*/f32[3,128,128]{2,1,0}, f32[3,4,32]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, /*index=255*/f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[16]{0}, /*index=260*/f32[16,3,4]{2,1,0}, f32[1,16]{1,0}, f32[3,16]{1,0}, f32[1,16]{1,0}, f32[256,128]{1,0}, /*index=265*/f32[1,128]{1,0}, f32[128,128]{1,0}, f32[1,128]{1,0}, f32[3,128]{1,0}, f32[16,16]{1,0}, /*index=270*/f32[16,16]{1,0}, f32[16,16]{1,0}, f32[128,384]{1,0}, f32[128,16]{1,0}, f32[128,16]{1,0}, /*index=275*/f32[128]{0}, f32[128,3]{1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, /*index=280*/f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, /*index=285*/f32[3,128,128]{2,1,0}, f32[3,128,512]{2,1,0}, f32[3,256,128]{2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, /*index=290*/f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,4,32]{2,1,0}, /*index=295*/f32[3,128,4,32]{3,2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, /*index=300*/f32[3,128,128]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[16]{0}, f32[16,3,4]{2,1,0}, f32[3,128]{1,0}, /*index=305*/f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, /*index=310*/f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,512]{2,1,0}, f32[3,256,128]{2,1,0}, f32[3,128,128]{2,1,0}, /*index=315*/f32[3,128,4,32]{3,2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, /*index=320*/f32[3,4,32]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, /*index=325*/f32[3,128,128]{2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[16]{0}, f32[16,3,4]{2,1,0}, /*index=330*/f32[1,16]{1,0}, f32[3,16]{1,0}, f32[1,16]{1,0}, f32[256,128]{1,0}, f32[1,128]{1,0}, /*index=335*/f32[128,128]{1,0}, f32[1,128]{1,0}, f32[3,128]{1,0}, f32[128,16]{1,0}, f32[384,128]{1,0}, /*index=340*/f32[128]{0}, f32[384]{0}, f32[16,16]{1,0}, f32[16,16]{1,0}, f32[16,16]{1,0}, /*index=345*/f32[128,768]{1,0}, f32[768,128]{1,0}, f32[128,16]{1,0}, f32[128,16]{1,0}, f32[256]{0}, /*index=350*/f32[256,384]{1,0}, f32[768]{0}, f32[267]{0}, f32[267,128]{1,0}, f32[128]{0}, /*index=355*/f32[128]{0}, f32[128,512]{1,0}, f32[256,128]{1,0}, f32[128]{0}, f32[128]{0}, /*index=360*/f32[128,512]{1,0}, f32[256,128]{1,0}, f32[384]{0}, f32[384,768]{1,0}, f32[831]{0}, /*index=365*/f32[831,384]{1,0}, f32[384]{0}, f32[384]{0}, f32[384,1536]{1,0}, f32[768,384]{1,0}, /*index=370*/f32[384]{0}, f32[384]{0}, f32[384,1536]{1,0}, f32[768,384]{1,0}, f32[6,4,768]{2,1,0}, /*index=375*/f32[6,4,384,768]{3,2,1,0}, f32[6,4,768]{2,1,0}, f32[6,4,384,768]{3,2,1,0}, f32[6,4,384,768]{3,2,1,0}, f32[6,4,384]{2,1,0}, /*index=380*/f32[6,4,768]{2,1,0}, f32[6,4,384,768]{3,2,1,0}, f32[6,4,768,3072]{3,2,1,0}, f32[6,4,1536,768]{3,2,1,0}, f32[6,4,768,768]{3,2,1,0}, /*index=385*/f32[6,4,768,16,48]{4,3,2,1,0}, f32[6,4,16,48]{3,2,1,0}, f32[6,4,768,16,48]{4,3,2,1,0}, f32[6,4,384,768]{3,2,1,0}, f32[6,4,384]{2,1,0}, /*index=390*/f32[6,4,768]{2,1,0}, f32[6,4,384,768]{3,2,1,0}, f32[6,4,768,768]{3,2,1,0}, f32[6,4,768,16,48]{4,3,2,1,0}, f32[6,128,4,16]{3,2,1,0}, /*index=395*/f32[128]{0}, u32[2]{0}, s32[150]{0}, s32[150]{0}, s8[16384,150]{1,0}, /*index=400*/f32[150]{0}, s32[150]{0}, s8[16384,150]{1,0}, pred[16384,150]{1,0}, pred[150,24]{1,0}, /*index=405*/f32[150,31]{1,0}, s32[113,128]{1,0}, pred[113,128]{1,0}, s32[150,24]{1,0}, pred[150,24]{1,0}, /*index=410*/s32[150,24,4]{2,1,0}, f32[150,24]{1,0}, s32[150,24]{1,0}, pred[150,24]{1,0}, f32[150,24,3]{2,1,0}, /*index=415*/s32[150,24]{1,0}, s32[150]{0}, pred[150]{0}, s32[150]{0}, s32[4,150]{1,0}, /*index=420*/pred[4,150,24]{2,1,0}, f32[4,150,24,3]{3,2,1,0}, s32[150]{0}, pred[150]{0}, s32[113,32]{1,0}, /*index=425*/pred[113,32]{1,0}, s32[150]{0}, s32[113,128]{1,0}, pred[113,128]{1,0}, s32[1500,2]{1,0}, /*index=430*/pred[1500,2]{1,0}, s32[150,2]{1,0}, pred[150,2]{1,0}, s32[113,32]{1,0}, pred[113,32]{1,0})->(f32[1]{0}, f32[1,150,24,3]{3,2,1,0}, pred[1,150,24]{2,1,0}, f32[63]{0}, f32[150,150]{1,0}, /*index=5*/f32[1,150,150]{2,1,0}, f32[1,150,150]{2,1,0}, f32[1,150,24]{2,1,0}, f32[1,150,24]{2,1,0}, f32[1,150,150]{2,1,0}, /*index=10*/f32[1,150,150]{2,1,0})}

closed_call.1 {
  Arg_0.2 = s32[] parameter(0)
  constant.39 = s32[] constant(1)
  add.20 = s32[] add(Arg_0.2, constant.39)
  Arg_1.1 = u32[2]{0} parameter(1)
  Arg_2.1 = u32[2]{0} parameter(2)
  add.21 = u32[2]{0} add(Arg_1.1, Arg_2.1)
  Arg_6.1 = u32[4]{0} parameter(6)
  slice.6 = u32[1]{0} slice(Arg_6.1), slice={[0:1]}
  squeeze.6 = u32[] reshape(slice.6)
  shift_left.8 = u32[2]{0} broadcast(squeeze.6), dimensions={}
  shift_left.9 = u32[2]{0} shift-left(Arg_2.1, shift_left.8)
  constant.38 = u32[] constant(32)
  sub.4 = u32[] subtract(constant.38, squeeze.6)
  shift_right_logical.8 = u32[2]{0} broadcast(sub.4), dimensions={}
  shift_right_logical.9 = u32[2]{0} shift-right-logical(Arg_2.1, shift_right_logical.8)
  or.4 = u32[2]{0} or(shift_left.9, shift_right_logical.9)
  xor.6 = u32[2]{0} xor(add.21, or.4)
  add.22 = u32[2]{0} add(add.21, xor.6)
  slice.7 = u32[1]{0} slice(Arg_6.1), slice={[1:2]}
  squeeze.7 = u32[] reshape(slice.7)
  shift_left.10 = u32[2]{0} broadcast(squeeze.7), dimensions={}
  shift_left.11 = u32[2]{0} shift-left(xor.6, shift_left.10)
  sub.5 = u32[] subtract(constant.38, squeeze.7)
  shift_right_logical.10 = u32[2]{0} broadcast(sub.5), dimensions={}
  shift_right_logical.11 = u32[2]{0} shift-right-logical(xor.6, shift_right_logical.10)
  or.5 = u32[2]{0} or(shift_left.11, shift_right_logical.11)
  xor.7 = u32[2]{0} xor(add.22, or.5)
  add.23 = u32[2]{0} add(add.22, xor.7)
  slice.8 = u32[1]{0} slice(Arg_6.1), slice={[2:3]}
  squeeze.8 = u32[] reshape(slice.8)
  shift_left.12 = u32[2]{0} broadcast(squeeze.8), dimensions={}
  shift_left.13 = u32[2]{0} shift-left(xor.7, shift_left.12)
  sub.6 = u32[] subtract(constant.38, squeeze.8)
  shift_right_logical.12 = u32[2]{0} broadcast(sub.6), dimensions={}
  shift_right_logical.13 = u32[2]{0} shift-right-logical(xor.7, shift_right_logical.12)
  or.6 = u32[2]{0} or(shift_left.13, shift_right_logical.13)
  xor.8 = u32[2]{0} xor(add.23, or.6)
  add.24 = u32[2]{0} add(add.23, xor.8)
  Arg_3.1 = u32[] parameter(3)
  add.25 = u32[2]{0} broadcast(Arg_3.1), dimensions={}
  add.26 = u32[2]{0} add(add.24, add.25)
  slice.9 = u32[1]{0} slice(Arg_6.1), slice={[3:4]}
  squeeze.9 = u32[] reshape(slice.9)
  shift_left.14 = u32[2]{0} broadcast(squeeze.9), dimensions={}
  shift_left.15 = u32[2]{0} shift-left(xor.8, shift_left.14)
  sub.7 = u32[] subtract(constant.38, squeeze.9)
  shift_right_logical.14 = u32[2]{0} broadcast(sub.7), dimensions={}
  shift_right_logical.15 = u32[2]{0} shift-right-logical(xor.8, shift_right_logical.14)
  or.7 = u32[2]{0} or(shift_left.15, shift_right_logical.15)
  xor.9 = u32[2]{0} xor(add.24, or.7)
  Arg_4.1 = u32[] parameter(4)
  add.27 = u32[2]{0} broadcast(Arg_4.1), dimensions={}
  add.28 = u32[2]{0} add(xor.9, add.27)
  add.29 = s32[] add(Arg_0.2, constant.39)
  convert_element_type.1 = u32[] convert(add.29)
  add.30 = u32[2]{0} broadcast(convert_element_type.1), dimensions={}
  add.31 = u32[2]{0} add(add.28, add.30)
  Arg_5.1 = u32[] parameter(5)
  Arg_7.1 = u32[4]{0} parameter(7)
  ROOT tuple.1 = (s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) tuple(add.20, add.26, add.31, Arg_4.1, Arg_5.1, Arg_3.1, Arg_7.1, Arg_6.1)
}

region_0.2 {
  arg_tuple.1 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  get-tuple-element.9 = s32[] get-tuple-element(arg_tuple.1), index=0
  constant.40 = s32[] constant(1)
  add.33 = s32[] add(get-tuple-element.9, constant.40)
  get-tuple-element.10 = s32[] get-tuple-element(arg_tuple.1), index=1
  get-tuple-element.11 = u32[2]{0} get-tuple-element(arg_tuple.1), index=2
  get-tuple-element.12 = u32[2]{0} get-tuple-element(arg_tuple.1), index=3
  get-tuple-element.13 = u32[] get-tuple-element(arg_tuple.1), index=4
  get-tuple-element.14 = u32[] get-tuple-element(arg_tuple.1), index=5
  get-tuple-element.15 = u32[] get-tuple-element(arg_tuple.1), index=6
  get-tuple-element.16 = u32[4]{0} get-tuple-element(arg_tuple.1), index=7
  get-tuple-element.17 = u32[4]{0} get-tuple-element(arg_tuple.1), index=8
  closed_call.9 = (s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) call(get-tuple-element.10, get-tuple-element.11, get-tuple-element.12, get-tuple-element.13, get-tuple-element.14, get-tuple-element.15, get-tuple-element.16, get-tuple-element.17), to_apply=closed_call.1
  closed_call.10 = s32[] get-tuple-element(closed_call.9), index=0
  closed_call.11 = u32[2]{0} get-tuple-element(closed_call.9), index=1
  closed_call.12 = u32[2]{0} get-tuple-element(closed_call.9), index=2
  closed_call.13 = u32[] get-tuple-element(closed_call.9), index=3
  closed_call.14 = u32[] get-tuple-element(closed_call.9), index=4
  closed_call.15 = u32[] get-tuple-element(closed_call.9), index=5
  closed_call.16 = u32[4]{0} get-tuple-element(closed_call.9), index=6
  closed_call.17 = u32[4]{0} get-tuple-element(closed_call.9), index=7
  ROOT tuple.3 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(add.33, closed_call.10, closed_call.11, closed_call.12, closed_call.13, closed_call.14, closed_call.15, closed_call.16, closed_call.17)
}

region_1.3 {
  arg_tuple.3 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  get-tuple-element.28 = s32[] get-tuple-element(arg_tuple.3), index=1
  get-tuple-element.29 = u32[2]{0} get-tuple-element(arg_tuple.3), index=2
  get-tuple-element.30 = u32[2]{0} get-tuple-element(arg_tuple.3), index=3
  get-tuple-element.31 = u32[] get-tuple-element(arg_tuple.3), index=4
  get-tuple-element.32 = u32[] get-tuple-element(arg_tuple.3), index=5
  get-tuple-element.33 = u32[] get-tuple-element(arg_tuple.3), index=6
  get-tuple-element.34 = u32[4]{0} get-tuple-element(arg_tuple.3), index=7
  get-tuple-element.35 = u32[4]{0} get-tuple-element(arg_tuple.3), index=8
  get-tuple-element.27 = s32[] get-tuple-element(arg_tuple.3), index=0
  constant.42 = s32[] constant(5)
  ROOT lt.2 = pred[] compare(get-tuple-element.27, constant.42), direction=LT
}

threefry2x32.4 {
  constant.43 = s32[] constant(0)
  PRNGSequence_reserve.6 = u32[2]{0} parameter(2)
  PRNGSequence_reserve.4 = u32[] parameter(0)
  add.34 = u32[2]{0} broadcast(PRNGSequence_reserve.4), dimensions={}
  add.35 = u32[2]{0} add(PRNGSequence_reserve.6, add.34)
  PRNGSequence_reserve.7 = u32[2]{0} parameter(3)
  PRNGSequence_reserve.5 = u32[] parameter(1)
  add.36 = u32[2]{0} broadcast(PRNGSequence_reserve.5), dimensions={}
  add.37 = u32[2]{0} add(PRNGSequence_reserve.7, add.36)
  xor.10 = u32[] xor(PRNGSequence_reserve.4, PRNGSequence_reserve.5)
  constant.44 = u32[] constant(466688986)
  xor.11 = u32[] xor(xor.10, constant.44)
  constant.45 = u32[4]{0} constant({13, 15, 26, 6})
  constant.46 = u32[4]{0} constant({17, 29, 16, 24})
  while.11 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(constant.43, constant.43, add.35, add.37, PRNGSequence_reserve.5, xor.11, PRNGSequence_reserve.4, constant.45, constant.46)
  while.12 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], /*index=5*/u32[], u32[], u32[4]{0}, u32[4]{0}) while(while.11), condition=region_1.3, body=region_0.2
  while.13 = s32[] get-tuple-element(while.12), index=0
  while.14 = s32[] get-tuple-element(while.12), index=1
  while.17 = u32[] get-tuple-element(while.12), index=4
  while.18 = u32[] get-tuple-element(while.12), index=5
  while.19 = u32[] get-tuple-element(while.12), index=6
  while.20 = u32[4]{0} get-tuple-element(while.12), index=7
  while.21 = u32[4]{0} get-tuple-element(while.12), index=8
  while.15 = u32[2]{0} get-tuple-element(while.12), index=2
  while.16 = u32[2]{0} get-tuple-element(while.12), index=3
  ROOT tuple.5 = (u32[2]{0}, u32[2]{0}) tuple(while.15, while.16)
}

_threefry_split.5 {
  Arg_0.3 = u32[2]{0} parameter(0)
  slice.10 = u32[1]{0} slice(Arg_0.3), slice={[0:1]}
  squeeze.10 = u32[] reshape(slice.10)
  slice.11 = u32[1]{0} slice(Arg_0.3), slice={[1:2]}
  squeeze.11 = u32[] reshape(slice.11)
  iota_2x32_shape.4 = u64[2]{0} iota(), iota_dimension=0
  constant.47 = u64[] constant(32)
  broadcast.8 = u64[2]{0} broadcast(constant.47), dimensions={}
  iota_2x32_shape.5 = u64[2]{0} shift-right-logical(iota_2x32_shape.4, broadcast.8)
  iota_2x32_shape.7 = u32[2]{0} convert(iota_2x32_shape.5)
  iota_2x32_shape.6 = u32[2]{0} convert(iota_2x32_shape.4)
  PRNGSequence_reserve.11 = (u32[2]{0}, u32[2]{0}) call(squeeze.10, squeeze.11, iota_2x32_shape.7, iota_2x32_shape.6), to_apply=threefry2x32.4
  PRNGSequence_reserve.12 = u32[2]{0} get-tuple-element(PRNGSequence_reserve.11), index=0
  stack.3 = u32[2,1]{1,0} reshape(PRNGSequence_reserve.12)
  PRNGSequence_reserve.13 = u32[2]{0} get-tuple-element(PRNGSequence_reserve.11), index=1
  stack.4 = u32[2,1]{1,0} reshape(PRNGSequence_reserve.13)
  ROOT stack.5 = u32[2,2]{1,0} concatenate(stack.3, stack.4), dimensions={1}
}

_one_hot.6 {
  Arg_0.5 = s32[150]{0} parameter(0)
  broadcast_in_dim.3 = s32[150,1]{1,0} reshape(Arg_0.5)
  eq.7 = s32[150,1]{1,0} broadcast(broadcast_in_dim.3), dimensions={0,1}
  eq.8 = s32[150]{0} reshape(eq.7)
  eq.9 = s32[150,31]{1,0} broadcast(eq.8), dimensions={0}
  iota.2 = s32[31]{0} iota(), iota_dimension=0
  iota.3 = s32[1,31]{1,0} reshape(iota.2)
  eq.10 = s32[1,31]{1,0} broadcast(iota.3), dimensions={0,1}
  eq.11 = s32[31]{0} reshape(eq.10)
  eq.12 = s32[150,31]{1,0} broadcast(eq.11), dimensions={1}
  eq.13 = pred[150,31]{1,0} compare(eq.9, eq.12), direction=EQ
  ROOT convert_element_type.3 = f32[150,31]{1,0} convert(eq.13)
}

_one_hot_0.7 {
  Arg_0.7 = s32[150,24]{1,0} parameter(0)
  broadcast_in_dim.7 = s32[150,24,1]{2,1,0} reshape(Arg_0.7)
  eq.21 = s32[150,24,1]{2,1,0} broadcast(broadcast_in_dim.7), dimensions={0,1,2}
  eq.22 = s32[150,24]{1,0} reshape(eq.21)
  eq.23 = s32[150,24,128]{2,1,0} broadcast(eq.22), dimensions={0,1}
  iota.6 = s32[128]{0} iota(), iota_dimension=0
  iota.7 = s32[1,1,128]{2,1,0} reshape(iota.6)
  eq.24 = s32[1,1,128]{2,1,0} broadcast(iota.7), dimensions={0,1,2}
  eq.25 = s32[128]{0} reshape(eq.24)
  eq.26 = s32[150,24,128]{2,1,0} broadcast(eq.25), dimensions={2}
  eq.27 = pred[150,24,128]{2,1,0} compare(eq.23, eq.26), direction=EQ
  ROOT convert_element_type.7 = f32[150,24,128]{2,1,0} convert(eq.27)
}

_one_hot_1.8 {
  Arg_0.9 = s32[150,24,4]{2,1,0} parameter(0)
  broadcast_in_dim.10 = s32[150,24,4,1]{3,2,1,0} reshape(Arg_0.9)
  eq.35 = s32[150,24,4,1]{3,2,1,0} broadcast(broadcast_in_dim.10), dimensions={0,1,2,3}
  eq.36 = s32[150,24,4]{2,1,0} reshape(eq.35)
  eq.37 = s32[150,24,4,64]{3,2,1,0} broadcast(eq.36), dimensions={0,1,2}
  iota.10 = s32[64]{0} iota(), iota_dimension=0
  iota.11 = s32[1,1,1,64]{3,2,1,0} reshape(iota.10)
  eq.38 = s32[1,1,1,64]{3,2,1,0} broadcast(iota.11), dimensions={0,1,2,3}
  eq.39 = s32[64]{0} reshape(eq.38)
  eq.40 = s32[150,24,4,64]{3,2,1,0} broadcast(eq.39), dimensions={3}
  eq.41 = pred[150,24,4,64]{3,2,1,0} compare(eq.37, eq.40), direction=EQ
  ROOT convert_element_type.9 = f32[150,24,4,64]{3,2,1,0} convert(eq.41)
}

relu.9 {
  Arg_0.11 = f32[113,32,128]{2,1,0} parameter(0)
  constant.49 = f32[] constant(0)
  max.4 = f32[113,32,128]{2,1,0} broadcast(constant.49), dimensions={}
  ROOT max.5 = f32[113,32,128]{2,1,0} maximum(Arg_0.11, max.4)
}

relu_2.10 {
  Arg_0.13 = f32[113,128,128]{2,1,0} parameter(0)
  constant.51 = f32[] constant(0)
  max.8 = f32[113,128,128]{2,1,0} broadcast(constant.51), dimensions={}
  ROOT max.9 = f32[113,128,128]{2,1,0} maximum(Arg_0.13, max.8)
}

region_2.11 {
  reduce_sum.3 = f32[] parameter(0)
  reduce_sum.4 = f32[] parameter(1)
  ROOT reduce_sum.5 = f32[] add(reduce_sum.3, reduce_sum.4)
}

relu_3.12 {
  Arg_0.15 = f32[113,32,128,16]{3,2,1,0} parameter(0)
  constant.53 = f32[] constant(0)
  max.12 = f32[113,32,128,16]{3,2,1,0} broadcast(constant.53), dimensions={}
  ROOT max.13 = f32[113,32,128,16]{3,2,1,0} maximum(Arg_0.15, max.12)
}

region_3.13 {
  reduce_sum.10 = f32[] parameter(0)
  reduce_sum.11 = f32[] parameter(1)
  ROOT reduce_sum.12 = f32[] add(reduce_sum.10, reduce_sum.11)
}

region_4.14 {
  reduce_sum.17 = f32[] parameter(0)
  reduce_sum.18 = f32[] parameter(1)
  ROOT reduce_sum.19 = f32[] add(reduce_sum.17, reduce_sum.18)
}

region_5.15 {
  reduce_sum.24 = f32[] parameter(0)
  reduce_sum.25 = f32[] parameter(1)
  ROOT reduce_sum.26 = f32[] add(reduce_sum.24, reduce_sum.25)
}

_where.16 {
  Arg_0.18 = pred[] parameter(0)
  select_n.11 = pred[113,32,128,1]{3,2,1,0} broadcast(Arg_0.18), dimensions={}
  Arg_1.4 = f32[113,32,128,1]{3,2,1,0} parameter(1)
  Arg_2.3 = f32[] parameter(2)
  broadcast_in_dim.35 = f32[113,32,128,1]{3,2,1,0} broadcast(Arg_2.3), dimensions={}
  ROOT select_n.12 = f32[113,32,128,1]{3,2,1,0} select(select_n.11, Arg_1.4, broadcast_in_dim.35)
}

_var.17 {
  constant.60 = f32[] constant(16)
  Arg_1.5 = s32[] parameter(1)
  convert_element_type.22 = f32[] convert(Arg_1.5)
  sub.24 = f32[] subtract(constant.60, convert_element_type.22)
  constant.61 = f32[] constant(0)
  gt.1 = pred[] compare(sub.24, constant.61), direction=GT
  Arg_0.19 = f32[113,32,128,16]{3,2,1,0} parameter(0)
  reduce_sum.28 = f32[113,32,128]{2,1,0} reduce(Arg_0.19, constant.61), dimensions={3}, to_apply=region_4.14
  broadcast_in_dim.36 = f32[113,32,128,1]{3,2,1,0} reshape(reduce_sum.28)
  constant.58 = f32[] constant(16)
  div.7 = f32[113,32,128,1]{3,2,1,0} broadcast(constant.58), dimensions={}
  div.8 = f32[113,32,128,1]{3,2,1,0} divide(broadcast_in_dim.36, div.7)
  sub.20 = f32[113,32,128,1]{3,2,1,0} broadcast(div.8), dimensions={0,1,2,3}
  sub.21 = f32[113,32,128]{2,1,0} reshape(sub.20)
  sub.22 = f32[113,32,128,16]{3,2,1,0} broadcast(sub.21), dimensions={0,1,2}
  sub.23 = f32[113,32,128,16]{3,2,1,0} subtract(Arg_0.19, sub.22)
  square.2 = f32[113,32,128,16]{3,2,1,0} multiply(sub.23, sub.23)
  reduce_sum.29 = f32[113,32,128]{2,1,0} reduce(square.2, constant.61), dimensions={3}, to_apply=region_5.15
  broadcast_in_dim.37 = f32[113,32,128,1]{3,2,1,0} reshape(reduce_sum.29)
  div.9 = f32[113,32,128,1]{3,2,1,0} broadcast(sub.24), dimensions={}
  div.10 = f32[113,32,128,1]{3,2,1,0} divide(broadcast_in_dim.37, div.9)
  constant.59 = f32[] constant(nan)
  ROOT jit__where_.1 = f32[113,32,128,1]{3,2,1,0} call(gt.1, div.10, constant.59), to_apply=_where.16
}

dynamic_index_in_dim.18 {
  Arg_0.21 = f32[3,128]{1,0} parameter(0)
  Arg_1.7 = s32[] parameter(1)
  constant.64 = s32[] constant(0)
  dynamic_slice.1 = f32[1,128]{1,0} dynamic-slice(Arg_0.21, Arg_1.7, constant.64), dynamic_slice_sizes={1,128}
  ROOT squeeze.17 = f32[128]{0} reshape(dynamic_slice.1)
}

dynamic_index_in_dim_4.19 {
  Arg_0.23 = f32[3,128,128]{2,1,0} parameter(0)
  Arg_1.9 = s32[] parameter(1)
  constant.66 = s32[] constant(0)
  dynamic_slice.3 = f32[1,128,128]{2,1,0} dynamic-slice(Arg_0.23, Arg_1.9, constant.66, constant.66), dynamic_slice_sizes={1,128,128}
  ROOT squeeze.19 = f32[128,128]{1,0} reshape(dynamic_slice.3)
}

dynamic_index_in_dim_5.20 {
  Arg_0.25 = f32[3,128,512]{2,1,0} parameter(0)
  Arg_1.11 = s32[] parameter(1)
  constant.68 = s32[] constant(0)
  dynamic_slice.5 = f32[1,128,512]{2,1,0} dynamic-slice(Arg_0.25, Arg_1.11, constant.68, constant.68), dynamic_slice_sizes={1,128,512}
  ROOT squeeze.21 = f32[128,512]{1,0} reshape(dynamic_slice.5)
}

dynamic_index_in_dim_6.21 {
  Arg_0.27 = f32[3,256,128]{2,1,0} parameter(0)
  Arg_1.13 = s32[] parameter(1)
  constant.70 = s32[] constant(0)
  dynamic_slice.7 = f32[1,256,128]{2,1,0} dynamic-slice(Arg_0.27, Arg_1.13, constant.70, constant.70), dynamic_slice_sizes={1,256,128}
  ROOT squeeze.23 = f32[256,128]{1,0} reshape(dynamic_slice.7)
}

dynamic_index_in_dim_7.22 {
  Arg_0.29 = f32[3,128,4,32]{3,2,1,0} parameter(0)
  Arg_1.15 = s32[] parameter(1)
  constant.72 = s32[] constant(0)
  dynamic_slice.9 = f32[1,128,4,32]{3,2,1,0} dynamic-slice(Arg_0.29, Arg_1.15, constant.72, constant.72, constant.72), dynamic_slice_sizes={1,128,4,32}
  ROOT squeeze.25 = f32[128,4,32]{2,1,0} reshape(dynamic_slice.9)
}

dynamic_index_in_dim_8.23 {
  Arg_0.31 = f32[3,4,32]{2,1,0} parameter(0)
  Arg_1.17 = s32[] parameter(1)
  constant.74 = s32[] constant(0)
  dynamic_slice.11 = f32[1,4,32]{2,1,0} dynamic-slice(Arg_0.31, Arg_1.17, constant.74, constant.74), dynamic_slice_sizes={1,4,32}
  ROOT squeeze.27 = f32[4,32]{1,0} reshape(dynamic_slice.11)
}

dynamic_index_in_dim_9.24 {
  Arg_0.33 = f32[3,113,4,32,128]{4,3,2,1,0} parameter(0)
  Arg_1.19 = s32[] parameter(1)
  constant.76 = s32[] constant(0)
  dynamic_slice.13 = f32[1,113,4,32,128]{4,3,2,1,0} dynamic-slice(Arg_0.33, Arg_1.19, constant.76, constant.76, constant.76, constant.76), dynamic_slice_sizes={1,113,4,32,128}
  ROOT squeeze.29 = f32[113,4,32,128]{3,2,1,0} reshape(dynamic_slice.13)
}

region_7.25 {
  reduce_sum.33 = f32[] parameter(0)
  reduce_sum.34 = f32[] parameter(1)
  ROOT reduce_sum.35 = f32[] add(reduce_sum.33, reduce_sum.34)
}

region_8.26 {
  reduce_sum.40 = f32[] parameter(0)
  reduce_sum.41 = f32[] parameter(1)
  ROOT reduce_sum.42 = f32[] add(reduce_sum.40, reduce_sum.41)
}

region_9.27 {
  reduce_sum.47 = f32[] parameter(0)
  reduce_sum.48 = f32[] parameter(1)
  ROOT reduce_sum.49 = f32[] add(reduce_sum.47, reduce_sum.48)
}

_where_12.28 {
  Arg_0.37 = pred[] parameter(0)
  select_n.16 = pred[113,32,1]{2,1,0} broadcast(Arg_0.37), dimensions={}
  Arg_1.23 = f32[113,32,1]{2,1,0} parameter(1)
  Arg_2.6 = f32[] parameter(2)
  broadcast_in_dim.45 = f32[113,32,1]{2,1,0} broadcast(Arg_2.6), dimensions={}
  ROOT select_n.17 = f32[113,32,1]{2,1,0} select(select_n.16, Arg_1.23, broadcast_in_dim.45)
}

_var_11.29 {
  constant.99 = f32[] constant(128)
  Arg_1.24 = s32[] parameter(1)
  convert_element_type.27 = f32[] convert(Arg_1.24)
  sub.42 = f32[] subtract(constant.99, convert_element_type.27)
  constant.100 = f32[] constant(0)
  gt.3 = pred[] compare(sub.42, constant.100), direction=GT
  Arg_0.38 = f32[113,32,128]{2,1,0} parameter(0)
  reduce_sum.51 = f32[113,32]{1,0} reduce(Arg_0.38, constant.100), dimensions={2}, to_apply=region_8.26
  broadcast_in_dim.46 = f32[113,32,1]{2,1,0} reshape(reduce_sum.51)
  constant.97 = f32[] constant(128)
  div.16 = f32[113,32,1]{2,1,0} broadcast(constant.97), dimensions={}
  div.17 = f32[113,32,1]{2,1,0} divide(broadcast_in_dim.46, div.16)
  sub.38 = f32[113,32,1]{2,1,0} broadcast(div.17), dimensions={0,1,2}
  sub.39 = f32[113,32]{1,0} reshape(sub.38)
  sub.40 = f32[113,32,128]{2,1,0} broadcast(sub.39), dimensions={0,1}
  sub.41 = f32[113,32,128]{2,1,0} subtract(Arg_0.38, sub.40)
  square.4 = f32[113,32,128]{2,1,0} multiply(sub.41, sub.41)
  reduce_sum.52 = f32[113,32]{1,0} reduce(square.4, constant.100), dimensions={2}, to_apply=region_9.27
  broadcast_in_dim.47 = f32[113,32,1]{2,1,0} reshape(reduce_sum.52)
  div.18 = f32[113,32,1]{2,1,0} broadcast(sub.42), dimensions={}
  div.19 = f32[113,32,1]{2,1,0} divide(broadcast_in_dim.47, div.18)
  constant.98 = f32[] constant(nan)
  ROOT jit__where_.3 = f32[113,32,1]{2,1,0} call(gt.3, div.19, constant.98), to_apply=_where_12.28
}

region_10.30 {
  reduce_sum.56 = f32[] parameter(0)
  reduce_sum.57 = f32[] parameter(1)
  ROOT reduce_sum.58 = f32[] add(reduce_sum.56, reduce_sum.57)
}

region_11.31 {
  reduce_sum.63 = f32[] parameter(0)
  reduce_sum.64 = f32[] parameter(1)
  ROOT reduce_sum.65 = f32[] add(reduce_sum.63, reduce_sum.64)
}

region_12.32 {
  reduce_sum.70 = f32[] parameter(0)
  reduce_sum.71 = f32[] parameter(1)
  ROOT reduce_sum.72 = f32[] add(reduce_sum.70, reduce_sum.71)
}

region_13.33 {
  reduce_sum.77 = f32[] parameter(0)
  reduce_sum.78 = f32[] parameter(1)
  ROOT reduce_sum.79 = f32[] add(reduce_sum.77, reduce_sum.78)
}

_where_14.34 {
  Arg_0.41 = pred[] parameter(0)
  select_n.20 = pred[113,128,1]{2,1,0} broadcast(Arg_0.41), dimensions={}
  Arg_1.27 = f32[113,128,1]{2,1,0} parameter(1)
  Arg_2.8 = f32[] parameter(2)
  broadcast_in_dim.54 = f32[113,128,1]{2,1,0} broadcast(Arg_2.8), dimensions={}
  ROOT select_n.21 = f32[113,128,1]{2,1,0} select(select_n.20, Arg_1.27, broadcast_in_dim.54)
}

_var_13.35 {
  constant.107 = f32[] constant(128)
  Arg_1.28 = s32[] parameter(1)
  convert_element_type.29 = f32[] convert(Arg_1.28)
  sub.60 = f32[] subtract(constant.107, convert_element_type.29)
  constant.108 = f32[] constant(0)
  gt.5 = pred[] compare(sub.60, constant.108), direction=GT
  Arg_0.42 = f32[113,128,128]{2,1,0} parameter(0)
  reduce_sum.81 = f32[113,128]{1,0} reduce(Arg_0.42, constant.108), dimensions={2}, to_apply=region_12.32
  broadcast_in_dim.55 = f32[113,128,1]{2,1,0} reshape(reduce_sum.81)
  constant.105 = f32[] constant(128)
  div.27 = f32[113,128,1]{2,1,0} broadcast(constant.105), dimensions={}
  div.28 = f32[113,128,1]{2,1,0} divide(broadcast_in_dim.55, div.27)
  sub.56 = f32[113,128,1]{2,1,0} broadcast(div.28), dimensions={0,1,2}
  sub.57 = f32[113,128]{1,0} reshape(sub.56)
  sub.58 = f32[113,128,128]{2,1,0} broadcast(sub.57), dimensions={0,1}
  sub.59 = f32[113,128,128]{2,1,0} subtract(Arg_0.42, sub.58)
  square.6 = f32[113,128,128]{2,1,0} multiply(sub.59, sub.59)
  reduce_sum.82 = f32[113,128]{1,0} reduce(square.6, constant.108), dimensions={2}, to_apply=region_13.33
  broadcast_in_dim.56 = f32[113,128,1]{2,1,0} reshape(reduce_sum.82)
  div.29 = f32[113,128,1]{2,1,0} broadcast(sub.60), dimensions={}
  div.30 = f32[113,128,1]{2,1,0} divide(broadcast_in_dim.56, div.29)
  constant.106 = f32[] constant(nan)
  ROOT jit__where_.5 = f32[113,128,1]{2,1,0} call(gt.5, div.30, constant.106), to_apply=_where_14.34
}

region_14.36 {
  reduce_sum.86 = f32[] parameter(0)
  reduce_sum.87 = f32[] parameter(1)
  ROOT reduce_sum.88 = f32[] add(reduce_sum.86, reduce_sum.87)
}

region_15.37 {
  reduce_max.3 = f32[] parameter(0)
  reduce_max.4 = f32[] parameter(1)
  ROOT reduce_max.5 = f32[] maximum(reduce_max.3, reduce_max.4)
}

region_16.38 {
  reduce_sum.93 = f32[] parameter(0)
  reduce_sum.94 = f32[] parameter(1)
  ROOT reduce_sum.95 = f32[] add(reduce_sum.93, reduce_sum.94)
}

region_17.39 {
  reduce_sum.100 = f32[] parameter(0)
  reduce_sum.101 = f32[] parameter(1)
  ROOT reduce_sum.102 = f32[] add(reduce_sum.100, reduce_sum.101)
}

region_18.40 {
  reduce_sum.107 = f32[] parameter(0)
  reduce_sum.108 = f32[] parameter(1)
  ROOT reduce_sum.109 = f32[] add(reduce_sum.107, reduce_sum.108)
}

silu.41 {
  Arg_0.44 = f32[113,32,256]{2,1,0} parameter(0)
  constant.110 = f32[] constant(1)
  broadcast.16 = f32[113,32,256]{2,1,0} broadcast(constant.110), dimensions={}
  neg.6 = f32[113,32,256]{2,1,0} negate(Arg_0.44)
  exp.7 = f32[113,32,256]{2,1,0} exponential(neg.6)
  add.107 = f32[113,32,256]{2,1,0} add(exp.7, broadcast.16)
  div.43 = f32[113,32,256]{2,1,0} divide(broadcast.16, add.107)
  ROOT mul.101 = f32[113,32,256]{2,1,0} multiply(Arg_0.44, div.43)
}

closed_call_10.42 {
  Arg_6.3 = f32[113,32,128]{2,1,0} parameter(6)
  constant.116 = f32[] constant(1)
  broadcast.20 = f32[113,32,128]{2,1,0} broadcast(constant.116), dimensions={}
  Arg_4.3 = f32[113,32,128]{2,1,0} parameter(4)
  Arg_8.1 = f32[128,128]{1,0} parameter(8)
  dot_general.42 = f32[113,32,128]{2,1,0} dot(Arg_4.3, Arg_8.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  Arg_7.3 = f32[128]{0} parameter(7)
  broadcast_in_dim.79 = f32[1,1,128]{2,1,0} reshape(Arg_7.3)
  add.142 = f32[1,1,128]{2,1,0} broadcast(broadcast_in_dim.79), dimensions={0,1,2}
  add.143 = f32[128]{0} reshape(add.142)
  add.144 = f32[113,32,128]{2,1,0} broadcast(add.143), dimensions={2}
  add.145 = f32[113,32,128]{2,1,0} add(dot_general.42, add.144)
  neg.11 = f32[113,32,128]{2,1,0} negate(add.145)
  exp.13 = f32[113,32,128]{2,1,0} exponential(neg.11)
  add.146 = f32[113,32,128]{2,1,0} add(exp.13, broadcast.20)
  div.56 = f32[113,32,128]{2,1,0} divide(broadcast.20, add.146)
  constant.113 = f32[] constant(1)
  broadcast.17 = f32[113,128,128]{2,1,0} broadcast(constant.113), dimensions={}
  Arg_20.1 = f32[128]{0} parameter(20)
  reshape.27 = f32[1,1,128]{2,1,0} reshape(Arg_20.1)
  mul.135 = f32[1,1,128]{2,1,0} broadcast(reshape.27), dimensions={0,1,2}
  mul.136 = f32[128]{0} reshape(mul.135)
  mul.137 = f32[113,128,128]{2,1,0} broadcast(mul.136), dimensions={2}
  Arg_5.3 = f32[113,128,128]{2,1,0} parameter(5)
  constant.126 = s32[] constant(0)
  jit__var_.10 = f32[113,128,1]{2,1,0} call(Arg_5.3, constant.126), to_apply=_var_13.35
  constant.114 = f32[] constant(1e-05)
  broadcast.18 = f32[113,128,1]{2,1,0} broadcast(constant.114), dimensions={}
  add.125 = f32[113,128,1]{2,1,0} add(jit__var_.10, broadcast.18)
  rsqrt.10 = f32[113,128,1]{2,1,0} rsqrt(add.125)
  mul.138 = f32[113,128,1]{2,1,0} broadcast(rsqrt.10), dimensions={0,1,2}
  mul.139 = f32[113,128]{1,0} reshape(mul.138)
  mul.140 = f32[113,128,128]{2,1,0} broadcast(mul.139), dimensions={0,1}
  mul.141 = f32[113,128,128]{2,1,0} multiply(mul.137, mul.140)
  constant.125 = f32[] constant(0)
  reduce_sum.114 = f32[113,128]{1,0} reduce(Arg_5.3, constant.125), dimensions={2}, to_apply=region_14.36
  broadcast_in_dim.74 = f32[113,128,1]{2,1,0} reshape(reduce_sum.114)
  constant.115 = f32[] constant(128)
  broadcast.19 = f32[113,128,1]{2,1,0} broadcast(constant.115), dimensions={}
  div.49 = f32[113,128,1]{2,1,0} divide(broadcast_in_dim.74, broadcast.19)
  sub.97 = f32[113,128,1]{2,1,0} broadcast(div.49), dimensions={0,1,2}
  sub.98 = f32[113,128]{1,0} reshape(sub.97)
  sub.99 = f32[113,128,128]{2,1,0} broadcast(sub.98), dimensions={0,1}
  sub.100 = f32[113,128,128]{2,1,0} subtract(Arg_5.3, sub.99)
  mul.142 = f32[113,128,128]{2,1,0} multiply(mul.141, sub.100)
  Arg_22.1 = f32[128,128]{1,0} parameter(22)
  dot_general.33 = f32[113,128,128]{2,1,0} dot(mul.142, Arg_22.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  Arg_21.1 = f32[128]{0} parameter(21)
  broadcast_in_dim.75 = f32[1,1,128]{2,1,0} reshape(Arg_21.1)
  add.126 = f32[1,1,128]{2,1,0} broadcast(broadcast_in_dim.75), dimensions={0,1,2}
  add.127 = f32[128]{0} reshape(add.126)
  add.128 = f32[113,128,128]{2,1,0} broadcast(add.127), dimensions={2}
  add.129 = f32[113,128,128]{2,1,0} add(dot_general.33, add.128)
  neg.9 = f32[113,128,128]{2,1,0} negate(add.129)
  exp.10 = f32[113,128,128]{2,1,0} exponential(neg.9)
  add.130 = f32[113,128,128]{2,1,0} add(exp.10, broadcast.17)
  div.50 = f32[113,128,128]{2,1,0} divide(broadcast.17, add.130)
  reshape.24 = f32[3616,128]{1,0} reshape(Arg_6.3)
  Arg_0.45 = s32[113,128]{1,0} parameter(0)
  constant.123 = s32[] constant(0)
  lt.14 = s32[113,128]{1,0} broadcast(constant.123), dimensions={}
  lt.15 = pred[113,128]{1,0} compare(Arg_0.45, lt.14), direction=LT
  constant.122 = s32[] constant(3616)
  add.114 = s32[113,128]{1,0} broadcast(constant.122), dimensions={}
  add.115 = s32[113,128]{1,0} add(Arg_0.45, add.114)
  select_n.22 = s32[113,128]{1,0} select(lt.15, add.115, Arg_0.45)
  broadcast_in_dim.67 = s32[113,128,1]{2,1,0} reshape(select_n.22)
  gather.10 = f32[113,128,128]{2,1,0} gather(reshape.24, broadcast_in_dim.67), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,128}
  Arg_1.29 = pred[113,128]{1,0} parameter(1)
  reshape.25 = pred[113,128,1]{2,1,0} reshape(Arg_1.29)
  convert_element_type.30 = f32[113,128,1]{2,1,0} convert(reshape.25)
  mul.106 = f32[113,128,1]{2,1,0} broadcast(convert_element_type.30), dimensions={0,1,2}
  mul.107 = f32[113,128]{1,0} reshape(mul.106)
  mul.108 = f32[113,128,128]{2,1,0} broadcast(mul.107), dimensions={0,1}
  mul.109 = f32[113,128,128]{2,1,0} multiply(gather.10, mul.108)
  jit__var_.9 = f32[113,128,1]{2,1,0} call(mul.109, constant.126), to_apply=_var_13.35
  add.124 = f32[113,128,1]{2,1,0} add(jit__var_.9, broadcast.18)
  rsqrt.9 = f32[113,128,1]{2,1,0} rsqrt(add.124)
  mul.131 = f32[113,128,1]{2,1,0} broadcast(rsqrt.9), dimensions={0,1,2}
  mul.132 = f32[113,128]{1,0} reshape(mul.131)
  mul.133 = f32[113,128,128]{2,1,0} broadcast(mul.132), dimensions={0,1}
  reduce_sum.113 = f32[113,128]{1,0} reduce(mul.109, constant.125), dimensions={2}, to_apply=region_11.31
  broadcast_in_dim.73 = f32[113,128,1]{2,1,0} reshape(reduce_sum.113)
  div.48 = f32[113,128,1]{2,1,0} divide(broadcast_in_dim.73, broadcast.19)
  sub.93 = f32[113,128,1]{2,1,0} broadcast(div.48), dimensions={0,1,2}
  sub.94 = f32[113,128]{1,0} reshape(sub.93)
  sub.95 = f32[113,128,128]{2,1,0} broadcast(sub.94), dimensions={0,1}
  sub.96 = f32[113,128,128]{2,1,0} subtract(mul.109, sub.95)
  mul.134 = f32[113,128,128]{2,1,0} multiply(mul.133, sub.96)
  mul.143 = f32[113,128,128]{2,1,0} multiply(div.50, mul.134)
  Arg_19.1 = f32[128,128]{1,0} parameter(19)
  dot_general.34 = f32[113,128,128]{2,1,0} dot(mul.142, Arg_19.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  add.131 = f32[113,128,128]{2,1,0} add(mul.143, dot_general.34)
  Arg_30.1 = f32[128,4,32]{2,1,0} parameter(30)
  dot_general.38 = f32[113,128,4,32]{3,2,1,0} dot(add.131, Arg_30.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  Arg_26.1 = f32[128]{0} parameter(26)
  reshape.26 = f32[1,1,128]{2,1,0} reshape(Arg_26.1)
  mul.122 = f32[1,1,128]{2,1,0} broadcast(reshape.26), dimensions={0,1,2}
  mul.123 = f32[128]{0} reshape(mul.122)
  mul.124 = f32[113,32,128]{2,1,0} broadcast(mul.123), dimensions={2}
  jit__var_.8 = f32[113,32,1]{2,1,0} call(Arg_4.3, constant.126), to_apply=_var_11.29
  constant.117 = f32[] constant(1e-05)
  broadcast.21 = f32[113,32,1]{2,1,0} broadcast(constant.117), dimensions={}
  add.117 = f32[113,32,1]{2,1,0} add(jit__var_.8, broadcast.21)
  rsqrt.8 = f32[113,32,1]{2,1,0} rsqrt(add.117)
  mul.125 = f32[113,32,1]{2,1,0} broadcast(rsqrt.8), dimensions={0,1,2}
  mul.126 = f32[113,32]{1,0} reshape(mul.125)
  mul.127 = f32[113,32,128]{2,1,0} broadcast(mul.126), dimensions={0,1}
  mul.128 = f32[113,32,128]{2,1,0} multiply(mul.124, mul.127)
  reduce_sum.112 = f32[113,32]{1,0} reduce(Arg_4.3, constant.125), dimensions={2}, to_apply=region_10.30
  broadcast_in_dim.71 = f32[113,32,1]{2,1,0} reshape(reduce_sum.112)
  constant.118 = f32[] constant(128)
  broadcast.22 = f32[113,32,1]{2,1,0} broadcast(constant.118), dimensions={}
  div.46 = f32[113,32,1]{2,1,0} divide(broadcast_in_dim.71, broadcast.22)
  sub.89 = f32[113,32,1]{2,1,0} broadcast(div.46), dimensions={0,1,2}
  sub.90 = f32[113,32]{1,0} reshape(sub.89)
  sub.91 = f32[113,32,128]{2,1,0} broadcast(sub.90), dimensions={0,1}
  sub.92 = f32[113,32,128]{2,1,0} subtract(Arg_4.3, sub.91)
  mul.129 = f32[113,32,128]{2,1,0} multiply(mul.128, sub.92)
  Arg_28.1 = f32[128,128]{1,0} parameter(28)
  dot_general.31 = f32[113,32,128]{2,1,0} dot(mul.129, Arg_28.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  Arg_27.1 = f32[128]{0} parameter(27)
  broadcast_in_dim.72 = f32[1,1,128]{2,1,0} reshape(Arg_27.1)
  add.118 = f32[1,1,128]{2,1,0} broadcast(broadcast_in_dim.72), dimensions={0,1,2}
  add.119 = f32[128]{0} reshape(add.118)
  add.120 = f32[113,32,128]{2,1,0} broadcast(add.119), dimensions={2}
  add.121 = f32[113,32,128]{2,1,0} add(dot_general.31, add.120)
  neg.8 = f32[113,32,128]{2,1,0} negate(add.121)
  exp.9 = f32[113,32,128]{2,1,0} exponential(neg.8)
  add.122 = f32[113,32,128]{2,1,0} add(exp.9, broadcast.20)
  div.47 = f32[113,32,128]{2,1,0} divide(broadcast.20, add.122)
  jit__var_.7 = f32[113,32,1]{2,1,0} call(Arg_6.3, constant.126), to_apply=_var_11.29
  add.116 = f32[113,32,1]{2,1,0} add(jit__var_.7, broadcast.21)
  rsqrt.7 = f32[113,32,1]{2,1,0} rsqrt(add.116)
  mul.118 = f32[113,32,1]{2,1,0} broadcast(rsqrt.7), dimensions={0,1,2}
  mul.119 = f32[113,32]{1,0} reshape(mul.118)
  mul.120 = f32[113,32,128]{2,1,0} broadcast(mul.119), dimensions={0,1}
  reduce_sum.111 = f32[113,32]{1,0} reduce(Arg_6.3, constant.125), dimensions={2}, to_apply=region_7.25
  broadcast_in_dim.70 = f32[113,32,1]{2,1,0} reshape(reduce_sum.111)
  div.45 = f32[113,32,1]{2,1,0} divide(broadcast_in_dim.70, broadcast.22)
  sub.85 = f32[113,32,1]{2,1,0} broadcast(div.45), dimensions={0,1,2}
  sub.86 = f32[113,32]{1,0} reshape(sub.85)
  sub.87 = f32[113,32,128]{2,1,0} broadcast(sub.86), dimensions={0,1}
  sub.88 = f32[113,32,128]{2,1,0} subtract(Arg_6.3, sub.87)
  mul.121 = f32[113,32,128]{2,1,0} multiply(mul.120, sub.88)
  mul.130 = f32[113,32,128]{2,1,0} multiply(div.47, mul.121)
  Arg_25.1 = f32[128,128]{1,0} parameter(25)
  dot_general.32 = f32[113,32,128]{2,1,0} dot(mul.129, Arg_25.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  add.123 = f32[113,32,128]{2,1,0} add(mul.130, dot_general.32)
  Arg_24.1 = f32[128,4,32]{2,1,0} parameter(24)
  dot_general.35 = f32[113,32,4,32]{3,2,1,0} dot(add.123, Arg_24.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  Arg_23.1 = f32[4,32]{1,0} parameter(23)
  broadcast_in_dim.76 = f32[1,1,4,32]{3,2,1,0} reshape(Arg_23.1)
  add.132 = f32[1,1,4,32]{3,2,1,0} broadcast(broadcast_in_dim.76), dimensions={0,1,2,3}
  add.133 = f32[4,32]{1,0} reshape(add.132)
  add.134 = f32[113,32,4,32]{3,2,1,0} broadcast(add.133), dimensions={2,3}
  add.135 = f32[113,32,4,32]{3,2,1,0} add(dot_general.35, add.134)
  constant.112 = f32[] constant(0.176776692)
  mul.104 = f32[113,32,4,32]{3,2,1,0} broadcast(constant.112), dimensions={}
  mul.144 = f32[113,32,4,32]{3,2,1,0} multiply(add.135, mul.104)
  Arg_18.1 = f32[128,4,32]{2,1,0} parameter(18)
  dot_general.36 = f32[113,128,4,32]{3,2,1,0} dot(add.131, Arg_18.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  dot_general.37 = f32[113,4,32,128]{3,2,1,0} dot(mul.144, dot_general.36), lhs_batch_dims={0,2}, lhs_contracting_dims={3}, rhs_batch_dims={0,2}, rhs_contracting_dims={3}
  Arg_2.9 = pred[113,32]{1,0} parameter(2)
  convert_element_type.31 = f32[113,32]{1,0} convert(Arg_2.9)
  constant.121 = f32[] constant(1)
  sub.82 = f32[113,32]{1,0} broadcast(constant.121), dimensions={}
  sub.83 = f32[113,32]{1,0} subtract(convert_element_type.31, sub.82)
  broadcast_in_dim.68 = f32[113,1,32,1]{3,2,1,0} reshape(sub.83)
  constant.120 = f32[] constant(1e+09)
  mul.105 = f32[113,1,32,1]{3,2,1,0} broadcast(constant.120), dimensions={}
  mul.110 = f32[113,1,32,1]{3,2,1,0} multiply(broadcast_in_dim.68, mul.105)
  mul.111 = f32[113,1,32,1]{3,2,1,0} broadcast(mul.110), dimensions={0,1,2,3}
  mul.112 = f32[113,1,32]{2,1,0} reshape(mul.111)
  mul.113 = f32[113,1,32,128]{3,2,1,0} broadcast(mul.112), dimensions={0,1,2}
  Arg_3.3 = pred[113,128]{1,0} parameter(3)
  convert_element_type.32 = f32[113,128]{1,0} convert(Arg_3.3)
  constant.119 = f32[] constant(1)
  sub.81 = f32[113,128]{1,0} broadcast(constant.119), dimensions={}
  sub.84 = f32[113,128]{1,0} subtract(convert_element_type.32, sub.81)
  broadcast_in_dim.69 = f32[113,1,1,128]{3,2,1,0} reshape(sub.84)
  mul.114 = f32[113,1,1,128]{3,2,1,0} broadcast(broadcast_in_dim.69), dimensions={0,1,2,3}
  mul.115 = f32[113,1,128]{2,1,0} reshape(mul.114)
  mul.116 = f32[113,1,32,128]{3,2,1,0} broadcast(mul.115), dimensions={0,1,3}
  mul.117 = f32[113,1,32,128]{3,2,1,0} multiply(mul.113, mul.116)
  add.136 = f32[113,1,32,128]{3,2,1,0} broadcast(mul.117), dimensions={0,1,2,3}
  add.137 = f32[113,32,128]{2,1,0} reshape(add.136)
  add.138 = f32[113,4,32,128]{3,2,1,0} broadcast(add.137), dimensions={0,2,3}
  add.139 = f32[113,4,32,128]{3,2,1,0} add(dot_general.37, add.138)
  Arg_31.1 = f32[113,4,32,128]{3,2,1,0} parameter(31)
  add.140 = f32[113,4,32,128]{3,2,1,0} add(add.139, Arg_31.1)
  constant.124 = f32[] constant(-inf)
  reduce_max.7 = f32[113,4,32]{2,1,0} reduce(add.140, constant.124), dimensions={3}, to_apply=region_15.37
  constant.111 = f32[] constant(-inf)
  max.16 = f32[113,4,32]{2,1,0} broadcast(constant.111), dimensions={}
  max.17 = f32[113,4,32]{2,1,0} maximum(reduce_max.7, max.16)
  broadcast_in_dim.77 = f32[113,4,32,1]{3,2,1,0} reshape(max.17)
  sub.101 = f32[113,4,32,1]{3,2,1,0} broadcast(broadcast_in_dim.77), dimensions={0,1,2,3}
  sub.102 = f32[113,4,32]{2,1,0} reshape(sub.101)
  sub.103 = f32[113,4,32,128]{3,2,1,0} broadcast(sub.102), dimensions={0,1,2}
  sub.104 = f32[113,4,32,128]{3,2,1,0} subtract(add.140, sub.103)
  exp.11 = f32[113,4,32,128]{3,2,1,0} exponential(sub.104)
  reduce_sum.115 = f32[113,4,32]{2,1,0} reduce(exp.11, constant.125), dimensions={3}, to_apply=region_16.38
  broadcast_in_dim.78 = f32[113,4,32,1]{3,2,1,0} reshape(reduce_sum.115)
  div.51 = f32[113,4,32,1]{3,2,1,0} broadcast(broadcast_in_dim.78), dimensions={0,1,2,3}
  div.52 = f32[113,4,32]{2,1,0} reshape(div.51)
  div.53 = f32[113,4,32,128]{3,2,1,0} broadcast(div.52), dimensions={0,1,2}
  div.54 = f32[113,4,32,128]{3,2,1,0} divide(exp.11, div.53)
  dot_general.39 = f32[113,4,32,32]{3,2,1,0} dot(dot_general.38, div.54), lhs_batch_dims={0,2}, lhs_contracting_dims={1}, rhs_batch_dims={0,1}, rhs_contracting_dims={3}
  transpose.2 = f32[113,32,4,32]{1,3,2,0} transpose(dot_general.39), dimensions={0,3,1,2}
  reshape.28 = f32[113,32,128]{2,1,0} reshape(transpose.2)
  Arg_17.1 = f32[128,128]{1,0} parameter(17)
  dot_general.40 = f32[113,32,128]{2,1,0} dot(add.123, Arg_17.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  neg.10 = f32[113,32,128]{2,1,0} negate(dot_general.40)
  exp.12 = f32[113,32,128]{2,1,0} exponential(neg.10)
  add.141 = f32[113,32,128]{2,1,0} add(exp.12, broadcast.20)
  div.55 = f32[113,32,128]{2,1,0} divide(broadcast.20, add.141)
  mul.145 = f32[113,32,128]{2,1,0} multiply(reshape.28, div.55)
  Arg_29.1 = f32[128,128]{1,0} parameter(29)
  dot_general.41 = f32[113,32,128]{2,1,0} dot(mul.145, Arg_29.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  mul.146 = f32[113,32,128]{2,1,0} multiply(div.56, dot_general.41)
  add.147 = f32[113,32,128]{2,1,0} add(Arg_6.3, mul.146)
  Arg_10.1 = f32[128,128]{1,0} parameter(10)
  dot_general.47 = f32[113,32,128]{2,1,0} dot(Arg_4.3, Arg_10.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  Arg_9.1 = f32[128]{0} parameter(9)
  broadcast_in_dim.83 = f32[1,1,128]{2,1,0} reshape(Arg_9.1)
  add.156 = f32[1,1,128]{2,1,0} broadcast(broadcast_in_dim.83), dimensions={0,1,2}
  add.157 = f32[128]{0} reshape(add.156)
  add.158 = f32[113,32,128]{2,1,0} broadcast(add.157), dimensions={2}
  add.159 = f32[113,32,128]{2,1,0} add(dot_general.47, add.158)
  neg.13 = f32[113,32,128]{2,1,0} negate(add.159)
  exp.15 = f32[113,32,128]{2,1,0} exponential(neg.13)
  add.160 = f32[113,32,128]{2,1,0} add(exp.15, broadcast.20)
  div.60 = f32[113,32,128]{2,1,0} divide(broadcast.20, add.160)
  Arg_12.1 = f32[128]{0} parameter(12)
  reshape.29 = f32[1,1,128]{2,1,0} reshape(Arg_12.1)
  mul.151 = f32[1,1,128]{2,1,0} broadcast(reshape.29), dimensions={0,1,2}
  mul.152 = f32[128]{0} reshape(mul.151)
  mul.153 = f32[113,32,128]{2,1,0} broadcast(mul.152), dimensions={2}
  jit__var_.12 = f32[113,32,1]{2,1,0} call(Arg_4.3, constant.126), to_apply=_var_11.29
  add.149 = f32[113,32,1]{2,1,0} add(jit__var_.12, broadcast.21)
  rsqrt.12 = f32[113,32,1]{2,1,0} rsqrt(add.149)
  mul.154 = f32[113,32,1]{2,1,0} broadcast(rsqrt.12), dimensions={0,1,2}
  mul.155 = f32[113,32]{1,0} reshape(mul.154)
  mul.156 = f32[113,32,128]{2,1,0} broadcast(mul.155), dimensions={0,1}
  mul.157 = f32[113,32,128]{2,1,0} multiply(mul.153, mul.156)
  reduce_sum.117 = f32[113,32]{1,0} reduce(Arg_4.3, constant.125), dimensions={2}, to_apply=region_18.40
  broadcast_in_dim.81 = f32[113,32,1]{2,1,0} reshape(reduce_sum.117)
  div.58 = f32[113,32,1]{2,1,0} divide(broadcast_in_dim.81, broadcast.22)
  sub.109 = f32[113,32,1]{2,1,0} broadcast(div.58), dimensions={0,1,2}
  sub.110 = f32[113,32]{1,0} reshape(sub.109)
  sub.111 = f32[113,32,128]{2,1,0} broadcast(sub.110), dimensions={0,1}
  sub.112 = f32[113,32,128]{2,1,0} subtract(Arg_4.3, sub.111)
  mul.158 = f32[113,32,128]{2,1,0} multiply(mul.157, sub.112)
  Arg_14.1 = f32[128,128]{1,0} parameter(14)
  dot_general.43 = f32[113,32,128]{2,1,0} dot(mul.158, Arg_14.1), lhs_contracting_dims={2}, rhs_contracting_dims={0}
  Arg_13.1 = f32[128]{0} parameter(13)
  broadcast_in_dim.82 = f32[1,1,128]{2,1,0} reshape(Arg_13.1)
  add.150 = f32[1,1,128]{2,1,0} broadcast(broadcast_in_dim.82), dimensions={0,1,2}
  add.151 = f32[128]{0} reshape(add.150)
