HloModule jit_apply_fn, entry_computation_layout={(f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,128]{2,1,0}, /*index=5*/bf16[4,128,4]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,4,32]{3,2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, /*index=10*/bf16[4,128,128]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,128]{2,1,0}, bf16[4,128,4]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, /*index=15*/bf16[4,128,4,32]{3,2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,1024]{2,1,0}, bf16[4,512,128]{2,1,0}, /*index=20*/bf16[4,384,384]{2,1,0}, bf16[4,384,16,24]{3,2,1,0}, f32[4,384]{1,0}, f32[4,384]{1,0}, bf16[4,16,24]{2,1,0}, /*index=25*/bf16[4,384,16,24]{3,2,1,0}, bf16[4,384,384]{2,1,0}, bf16[4,384,16,24]{3,2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, /*index=30*/bf16[4,128,16]{2,1,0}, f32[4,384]{1,0}, f32[4,384]{1,0}, bf16[4,384,3072]{2,1,0}, bf16[4,1536,384]{2,1,0}, /*index=35*/f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,256]{2,1,0}, bf16[4,128,128]{2,1,0}, f32[4,128]{1,0}, /*index=40*/f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, bf16[4,128,256]{2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, /*index=45*/bf16[4,128,256]{2,1,0}, bf16[4,128,128]{2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, /*index=50*/bf16[4,128,256]{2,1,0}, f32[384]{0}, f32[384]{0}, f32[384,24,2]{2,1,0}, f32[128,64]{1,0}, /*index=55*/f32[128]{0}, f32[128]{0}, f32[128,64]{1,0}, f32[128]{0}, f32[128]{0}, /*index=60*/f32[384,24,50]{2,1,0}, f32[384]{0}, f32[384]{0}, bf16[39,128]{1,0}, bf16[447,128]{1,0}, /*index=65*/bf16[447,128]{1,0}, f32[128,64]{1,0}, f32[4,64]{1,0}, f32[4,64]{1,0}, bf16[4,64,64]{2,1,0}, /*index=70*/bf16[4,64,64]{2,1,0}, bf16[4,128,8]{2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,64,8,8]{3,2,1,0}, /*index=75*/f32[4,64]{1,0}, f32[4,64]{1,0}, bf16[4,64,512]{2,1,0}, bf16[4,256,64]{2,1,0}, bf16[4,128]{1,0}, /*index=80*/bf16[4,32,32,128]{3,2,1,0}, f32[4,64]{1,0}, f32[4,64]{1,0}, bf16[4,64,32]{2,1,0}, bf16[4,64,32]{2,1,0}, /*index=85*/f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,128]{2,1,0}, /*index=90*/bf16[4,128,4]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,4,32]{3,2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, /*index=95*/bf16[4,128,128]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, bf16[4,128,128]{2,1,0}, bf16[4,128,4]{2,1,0}, bf16[4,4,32,128]{3,2,1,0}, /*index=100*/bf16[4,128,4,32]{3,2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,1024]{2,1,0}, bf16[4,512,128]{2,1,0}, /*index=105*/f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,256]{2,1,0}, bf16[4,128,128]{2,1,0}, f32[4,128]{1,0}, /*index=110*/f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, bf16[4,128,256]{2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, /*index=115*/bf16[4,128,256]{2,1,0}, bf16[4,128,128]{2,1,0}, f32[4,128]{1,0}, f32[4,128]{1,0}, bf16[4,128,128]{2,1,0}, /*index=120*/bf16[4,128,256]{2,1,0}, f32[48,128]{1,0}, f32[48,128]{1,0}, bf16[48,128,128]{2,1,0}, bf16[48,4,32,128]{3,2,1,0}, /*index=125*/bf16[48,128,128]{2,1,0}, bf16[48,128,4]{2,1,0}, bf16[48,4,32,128]{3,2,1,0}, bf16[48,128,4,32]{3,2,1,0}, f32[48,128]{1,0}, /*index=130*/f32[48,128]{1,0}, bf16[48,128,128]{2,1,0}, bf16[48,4,32,128]{3,2,1,0}, bf16[48,128,128]{2,1,0}, bf16[48,128,4]{2,1,0}, /*index=135*/bf16[48,4,32,128]{3,2,1,0}, bf16[48,128,4,32]{3,2,1,0}, f32[48,128]{1,0}, f32[48,128]{1,0}, bf16[48,128,1024]{2,1,0}, /*index=140*/bf16[48,512,128]{2,1,0}, bf16[48,384,384]{2,1,0}, bf16[48,384,16,24]{3,2,1,0}, f32[48,384]{1,0}, f32[48,384]{1,0}, /*index=145*/bf16[48,16,24]{2,1,0}, bf16[48,384,16,24]{3,2,1,0}, bf16[48,384,384]{2,1,0}, bf16[48,384,16,24]{3,2,1,0}, f32[48,128]{1,0}, /*index=150*/f32[48,128]{1,0}, bf16[48,128,16]{2,1,0}, f32[48,384]{1,0}, f32[48,384]{1,0}, bf16[48,384,3072]{2,1,0}, /*index=155*/bf16[48,1536,384]{2,1,0}, f32[48,128]{1,0}, f32[48,128]{1,0}, bf16[48,128,256]{2,1,0}, bf16[48,128,128]{2,1,0}, /*index=160*/f32[48,128]{1,0}, f32[48,128]{1,0}, bf16[48,128,128]{2,1,0}, bf16[48,128,256]{2,1,0}, f32[48,128]{1,0}, /*index=165*/f32[48,128]{1,0}, bf16[48,128,256]{2,1,0}, bf16[48,128,128]{2,1,0}, f32[48,128]{1,0}, f32[48,128]{1,0}, /*index=170*/bf16[48,128,128]{2,1,0}, bf16[48,128,256]{2,1,0}, bf16[1,128]{1,0}, bf16[447,64]{1,0}, bf16[447,128]{1,0}, /*index=175*/bf16[34,64]{1,0}, bf16[128,128]{1,0}, f32[128]{0}, f32[128]{0}, bf16[384,384]{1,0}, /*index=180*/f32[384]{0}, f32[384]{0}, bf16[447,128]{1,0}, bf16[447,384]{1,0}, bf16[64,128]{1,0}, /*index=185*/f32[2,64]{1,0}, f32[2,64]{1,0}, bf16[2,64,64]{2,1,0}, bf16[2,4,16,64]{3,2,1,0}, bf16[2,64,64]{2,1,0}, /*index=190*/bf16[2,64,4]{2,1,0}, bf16[2,4,16,64]{3,2,1,0}, bf16[2,64,4,16]{3,2,1,0}, f32[2,64]{1,0}, f32[2,64]{1,0}, /*index=195*/bf16[2,64,64]{2,1,0}, bf16[2,4,16,64]{3,2,1,0}, bf16[2,64,64]{2,1,0}, bf16[2,64,4]{2,1,0}, bf16[2,4,16,64]{3,2,1,0}, /*index=200*/bf16[2,64,4,16]{3,2,1,0}, f32[2,64]{1,0}, f32[2,64]{1,0}, bf16[2,64,256]{2,1,0}, bf16[2,128,64]{2,1,0}, /*index=205*/f32[2,64]{1,0}, f32[2,64]{1,0}, bf16[2,64,128]{2,1,0}, bf16[2,64,64]{2,1,0}, f32[2,64]{1,0}, /*index=210*/f32[2,64]{1,0}, bf16[2,64,64]{2,1,0}, bf16[2,64,128]{2,1,0}, f32[2,64]{1,0}, f32[2,64]{1,0}, /*index=215*/bf16[2,64,128]{2,1,0}, bf16[2,64,64]{2,1,0}, f32[2,64]{1,0}, f32[2,64]{1,0}, bf16[2,64,64]{2,1,0}, /*index=220*/bf16[2,64,128]{2,1,0}, f32[64]{0}, f32[64]{0}, f32[128]{0}, f32[128]{0}, /*index=225*/bf16[39,64]{1,0}, bf16[64]{0}, bf16[31,64]{1,0}, bf16[31,64]{1,0}, bf16[64]{0}, /*index=230*/bf16[64]{0}, bf16[64]{0}, bf16[64]{0}, bf16[128,64]{1,0}, bf16[139,128]{1,0}, /*index=235*/f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,128]{2,1,0}, /*index=240*/f32[3,128]{1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,512]{2,1,0}, f32[3,256,128]{2,1,0}, /*index=245*/f32[3,128,128]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, /*index=250*/f32[3,128,128]{2,1,0}, f32[3,4,32]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, /*index=255*/f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[16]{0}, /*index=260*/f32[16,3,4]{2,1,0}, f32[1,16]{1,0}, f32[3,16]{1,0}, f32[1,16]{1,0}, f32[256,128]{1,0}, /*index=265*/f32[1,128]{1,0}, f32[128,128]{1,0}, f32[1,128]{1,0}, f32[3,128]{1,0}, f32[16,16]{1,0}, /*index=270*/f32[16,16]{1,0}, f32[16,16]{1,0}, f32[128,384]{1,0}, f32[128,16]{1,0}, f32[128,16]{1,0}, /*index=275*/f32[128]{0}, f32[128,3]{1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, /*index=280*/f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, /*index=285*/f32[3,128,128]{2,1,0}, f32[3,128,512]{2,1,0}, f32[3,256,128]{2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, /*index=290*/f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,4,32]{2,1,0}, /*index=295*/f32[3,128,4,32]{3,2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, /*index=300*/f32[3,128,128]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[16]{0}, f32[16,3,4]{2,1,0}, f32[3,128]{1,0}, /*index=305*/f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, /*index=310*/f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, f32[3,128,512]{2,1,0}, f32[3,256,128]{2,1,0}, f32[3,128,128]{2,1,0}, /*index=315*/f32[3,128,4,32]{3,2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, f32[3,128,128]{2,1,0}, /*index=320*/f32[3,4,32]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128]{1,0}, f32[3,128]{1,0}, /*index=325*/f32[3,128,128]{2,1,0}, f32[3,128,128]{2,1,0}, f32[3,128,4,32]{3,2,1,0}, f32[16]{0}, f32[16,3,4]{2,1,0}, /*index=330*/f32[1,16]{1,0}, f32[3,16]{1,0}, f32[1,16]{1,0}, f32[256,128]{1,0}, f32[1,128]{1,0}, /*index=335*/f32[128,128]{1,0}, f32[1,128]{1,0}, f32[3,128]{1,0}, f32[128,16]{1,0}, f32[384,128]{1,0}, /*index=340*/f32[128]{0}, f32[384]{0}, f32[16,16]{1,0}, f32[16,16]{1,0}, f32[16,16]{1,0}, /*index=345*/f32[128,768]{1,0}, f32[768,128]{1,0}, f32[128,16]{1,0}, f32[128,16]{1,0}, f32[256]{0}, /*index=350*/f32[256,384]{1,0}, f32[768]{0}, f32[267]{0}, f32[267,128]{1,0}, f32[128]{0}, /*index=355*/f32[128]{0}, f32[128,512]{1,0}, f32[256,128]{1,0}, f32[128]{0}, f32[128]{0}, /*index=360*/f32[128,512]{1,0}, f32[256,128]{1,0}, f32[384]{0}, f32[384,768]{1,0}, f32[831]{0}, /*index=365*/f32[831,384]{1,0}, f32[384]{0}, f32[384]{0}, f32[384,1536]{1,0}, f32[768,384]{1,0}, /*index=370*/f32[384]{0}, f32[384]{0}, f32[384,1536]{1,0}, f32[768,384]{1,0}, f32[6,4,768]{2,1,0}, /*index=375*/f32[6,4,384,768]{3,2,1,0}, f32[6,4,768]{2,1,0}, f32[6,4,384,768]{3,2,1,0}, f32[6,4,384,768]{3,2,1,0}, f32[6,4,384]{2,1,0}, /*index=380*/f32[6,4,768]{2,1,0}, f32[6,4,384,768]{3,2,1,0}, f32[6,4,768,3072]{3,2,1,0}, f32[6,4,1536,768]{3,2,1,0}, f32[6,4,768,768]{3,2,1,0}, /*index=385*/f32[6,4,768,16,48]{4,3,2,1,0}, f32[6,4,16,48]{3,2,1,0}, f32[6,4,768,16,48]{4,3,2,1,0}, f32[6,4,384,768]{3,2,1,0}, f32[6,4,384]{2,1,0}, /*index=390*/f32[6,4,768]{2,1,0}, f32[6,4,384,768]{3,2,1,0}, f32[6,4,768,768]{3,2,1,0}, f32[6,4,768,16,48]{4,3,2,1,0}, f32[6,128,4,16]{3,2,1,0}, /*index=395*/f32[128]{0}, u32[2]{0}, s32[150]{0}, s32[150]{0}, s8[16384,150]{1,0}, /*index=400*/f32[150]{0}, s32[150]{0}, s8[16384,150]{1,0}, pred[16384,150]{1,0}, pred[150,24]{1,0}, /*index=405*/f32[150,31]{1,0}, s32[113,128]{1,0}, pred[113,128]{1,0}, s32[150,24]{1,0}, pred[150,24]{1,0}, /*index=410*/s32[150,24,4]{2,1,0}, f32[150,24]{1,0}, s32[150,24]{1,0}, pred[150,24]{1,0}, f32[150,24,3]{2,1,0}, /*index=415*/s32[150,24]{1,0}, s32[150]{0}, pred[150]{0}, s32[150]{0}, s32[4,150]{1,0}, /*index=420*/pred[4,150,24]{2,1,0}, f32[4,150,24,3]{3,2,1,0}, s32[150]{0}, pred[150]{0}, s32[113,32]{1,0}, /*index=425*/pred[113,32]{1,0}, s32[150]{0}, s32[113,128]{1,0}, pred[113,128]{1,0}, s32[1500,2]{1,0}, /*index=430*/pred[1500,2]{1,0}, s32[150,2]{1,0}, pred[150,2]{1,0}, s32[113,32]{1,0}, pred[113,32]{1,0})->(f32[1]{0}, f32[1,150,24,3]{3,2,1,0}, pred[1,150,24]{2,1,0}, f32[63]{0}, f32[150,150]{1,0}, /*index=5*/f32[1,150,150]{2,1,0}, f32[1,150,150]{2,1,0}, f32[1,150,24]{2,1,0}, f32[1,150,24]{2,1,0}, f32[1,150,150]{2,1,0}, /*index=10*/f32[1,150,150]{2,1,0})}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={false,false,false,false,false,false,false,false,false,false,false}, num_partitions=2, frontend_attributes={xla.sdy.meshes={mesh = #sdy.mesh<["fsdp"=2]>}}

FileNames
1 "/usr/local/lib/python3.12/dist-packages/haiku/_src/transform.py"
2 "/root/hlo_dump/af3_mgpu.py"
3 "/usr/local/lib/python3.12/dist-packages/haiku/_src/module.py"
4 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/model.py"
5 "/usr/local/lib/python3.12/dist-packages/haiku/_src/base.py"
6 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/network/atom_cross_attention.py"
7 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/network/diffusion_transformer.py"
8 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/components/haiku_modules.py"
9 "/usr/local/lib/python3.12/dist-packages/haiku/_src/layer_norm.py"
10 "/usr/local/lib/python3.12/dist-packages/haiku/_src/layer_stack.py"
11 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/atom_layout/atom_layout.py"
12 "/usr/local/lib/python3.12/dist-packages/tokamax/_src/ops/gated_linear_unit/api.py"
13 "/usr/local/lib/python3.12/dist-packages/tokamax/_src/ops/op.py"
14 "/usr/local/lib/python3.12/dist-packages/tokamax/_src/batching.py"
15 "/usr/local/lib/python3.12/dist-packages/jaxtyping/_decorator.py"
16 "/usr/local/lib/python3.12/dist-packages/tokamax/_src/ops/gated_linear_unit/base.py"
17 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/components/utils.py"
18 "/usr/local/lib/python3.12/dist-packages/haiku/_src/stateful.py"
19 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/network/evoformer.py"
20 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/network/template_modules.py"
21 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/network/modules.py"
22 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/components/mapping.py"
23 "/usr/local/lib/python3.12/dist-packages/tokamax/_src/ops/attention/api.py"
24 "/usr/local/lib/python3.12/dist-packages/tokamax/_src/ops/attention/base.py"
25 "/usr/local/lib/python3.12/dist-packages/alphafold3/jax/geometry/vector.py"
26 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/scoring/scoring.py"
27 "/usr/local/lib/python3.12/dist-packages/alphafold3/jax/geometry/utils.py"
28 "/usr/local/lib/python3.12/dist-packages/alphafold3/jax/geometry/rotation_matrix.py"
29 "/usr/local/lib/python3.12/dist-packages/alphafold3/jax/geometry/struct_of_array.py"
30 "/usr/local/lib/python3.12/dist-packages/alphafold3/jax/geometry/rigid_matrix_vector.py"
31 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/network/featurization.py"
32 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/features.py"
33 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/network/diffusion_head.py"
34 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/network/noise_level_embeddings.py"
35 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/network/confidence_head.py"
36 "/usr/local/lib/python3.12/dist-packages/alphafold3/model/network/distogram_head.py"

FunctionNames
1 "without_state.<locals>.apply_fn"
2 "transform_with_state.<locals>.apply_fn"
3 "forward_fn"
4 "wrap_method.<locals>.wrapped"
5 "run_interceptors"
6 "Model.__call__"
7 "next_rng_key"
8 "next_rng_key_internal"
9 "PRNGSequence.__next__"
10 "PRNGSequence.reserve"
11 "<module>"
12 "create_target_feat_embedding"
13 "atom_cross_att_encoder"
14 "CrossAttTransformer.__call__"
15 "LayerNorm.__call__"
16 "layer_stack.<locals>.iterate.<locals>.wrapped"
17 "_LayerStack.__call__"
18 "_LayerStack.__call__.<locals>.layer"
19 "_LayerStackWithPerLayer._call_wrapped"
20 "CrossAttTransformer.__call__.<locals>.block"
21 "cross_attention"
22 "adaptive_layernorm"
23 "transition_block"
24 "convert"
25 "Linear.__call__"
26 "adaptive_zero_init"
27 "gated_linear_unit"
28 "Op.__call__"
29 "Op.__call__.<locals>.f"
30 "capture_batched_args.<locals>.wrapped"
31 "capture_batched_args.<locals>.wrapped.<locals>.fn_flat"
32 "Op.__call__.<locals>.fwd"
33 "jaxtyped.<locals>.wrapped_fn"
34 "jaxtyped.<locals>.wrapped_fn_impl"
35 "GatedLinearUnit._fwd"
36 "mask_mean"
37 "fori_loop.<locals>.pure_body_fun"
38 "Model.__call__.<locals>.recycle_body"
39 "Evoformer.__call__"
40 "Evoformer._embed_bonds"
41 "Evoformer._embed_template_pair"
42 "TemplateEmbedding.__call__"
43 "scan"
44 "scan.<locals>.stateful_fun"
45 "TemplateEmbedding.__call__.<locals>.scan_fn"
46 "SingleTemplateEmbedding.__call__"
47 "SingleTemplateEmbedding.__call__.<locals>.construct_input"
48 "dgram_from_positions"
49 "_LayerStackNoPerLayer._call_wrapped"
50 "SingleTemplateEmbedding.__call__.<locals>.template_iteration_fn"
51 "PairFormerIteration.__call__"
52 "TriangleMultiplication.__call__"
53 "GridSelfAttention.__call__"
54 "inference_subbatch"
55 "sharded_apply.<locals>.mapped_fn"
56 "sharded_apply.<locals>.mapped_fn.<locals>.scan_iteration"
57 "sharded_apply.<locals>.mapped_fn.<locals>.compute_shard"
58 "sharded_apply.<locals>.mapped_fn.<locals>.apply_fun_to_slice"
59 "inference_subbatch.<locals>.run_module"
60 "GridSelfAttention._attention"
61 "dot_product_attention"
62 "DotProductAttention.__call__"
63 "DotProductAttention.__call__.<locals>.fwd_closed"
64 "_softmax"
65 "DotProductAttention._fwd"
66 "sharded_apply.<locals>.mapped_fn.<locals>.apply_fun_to_slice.<locals>.<lambda>"
67 "_maybe_slice"
68 "sharded_apply.<locals>.mapped_fn.<locals>.dynamic_update_slice_in_dim"
69 "TransitionBlock.__call__"
70 "Vec3Array.normalized"
71 "Vec3Array.norm"
72 "pseudo_beta_fn"
73 "Vec3Array.from_array"
74 "unstack"
75 "make_backbone_rigid"
76 "make_backbone_rigid.<locals>.<lambda>"
77 "Vec3Array.__sub__"
78 "Vec3Array.__sub__.<locals>.<lambda>"
79 "Rot3Array.from_two_vectors"
80 "Vec3Array.dot"
81 "Vec3Array.__truediv__"
82 "Vec3Array.__truediv__.<locals>.<lambda>"
83 "Vec3Array.__rmul__"
84 "Vec3Array.__mul__"
85 "Vec3Array.__mul__.<locals>.<lambda>"
86 "Vec3Array.cross"
87 "get_item"
88 "get_item.<locals>.<lambda>"
89 "Rigid3Array.inverse"
90 "Vec3Array.__neg__"
91 "Vec3Array.__neg__.<locals>.<lambda>"
92 "Rot3Array.apply_to_point"
93 "Rigid3Array.apply_to_point"
94 "Vec3Array.__add__"
95 "Vec3Array.__add__.<locals>.<lambda>"
96 "_get_rng_stack"
97 "maybe_next_rng_key"
98 "reserve_up_to_full_rng_block"
99 "PRNGSequence.reserve_up_to_full"
100 "Evoformer._embed_process_msa"
101 "shuffle_msa"
102 "gumbel_argsort_sample_idx"
103 "_padding_consistent_rng.<locals>.inner"
104 "_grid_keys"
105 "Evoformer._embed_process_msa.<locals>.evoformer_fn"
106 "EvoformerIteration.__call__"
107 "OuterProductMean.__call__"
108 "OuterProductMean.__call__.<locals>.compute_chunk"
109 "MSAAttention.__call__"
110 "Evoformer.__call__.<locals>.pairformer_fn"
111 "self_attention"
112 "create_msa_feat"
113 "Evoformer._relative_encoding"
114 "create_relative_encoding"
115 "Evoformer._seq_pair_embedding"
116 "MSA.index_msa_rows"
117 "truncate_msa_batch"
118 "fori_loop"
119 "Model._sample_diffusion"
120 "sample"
121 "vmap.<locals>.mapped_fun"
122 "vmap.<locals>.pure_fun"
123 "sample.<locals>.apply_denoising_step"
124 "random_augmentation"
125 "DiffusionHead.__call__"
126 "DiffusionHead._conditioning"
127 "Transformer.__call__"
128 "Transformer.__call__.<locals>.super_block"
129 "Transformer.__call__.<locals>.block"
130 "atom_cross_att_decoder"
131 "_per_atom_conditioning"
132 "noise_embeddings"
133 "random_rotation"
134 "capture_batched_args.<locals>.wrapped.<locals>.vmap_rule"
135 "capture_batched_args.<locals>.wrapped.<locals>.vmap_rule.<locals>.vmap_fn_flat"
136 "Model.__call__.<locals>.<lambda>"
137 "ConfidenceHead.__call__"
138 "ConfidenceHead._embed_features"
139 "ConfidenceHead.__call__.<locals>.pairformer_fn"
140 "ConfidenceHead._get_tmscore_adjusted_pae"
141 "ConfidenceHead._get_tmscore_adjusted_pae.<locals>.get_tmscore_adjusted_pae"
142 "DistogramHead.__call__"
143 "noise_schedule"
144 "create_target_feat"

FileLocations
1 {file_name_id=1 function_name_id=1 line=183 end_line=183 column=17 end_column=55}
2 {file_name_id=1 function_name_id=2 line=458 end_line=458 column=14 end_column=32}
3 {file_name_id=2 function_name_id=3 line=36 end_line=36 column=11 end_column=34}
4 {file_name_id=3 function_name_id=4 line=464 end_line=464 column=12 end_column=30}
5 {file_name_id=3 function_name_id=5 line=305 end_line=305 column=11 end_column=40}
6 {file_name_id=4 function_name_id=6 line=276 end_line=276 column=12 end_column=29}
7 {file_name_id=5 function_name_id=7 line=1152 end_line=1152 column=9 end_column=32}
8 {file_name_id=5 function_name_id=8 line=1191 end_line=1191 column=9 end_column=22}
9 {file_name_id=5 function_name_id=9 line=1094 end_line=1094 column=6 end_column=56}
10 {file_name_id=5 function_name_id=10 line=1067 end_line=1067 column=23 end_column=59}
11 {file_name_id=2 function_name_id=11 line=45 end_line=45 column=58 end_column=92}
12 {file_name_id=4 function_name_id=6 line=283 end_line=287 column=18 end_column=5}
13 {file_name_id=4 function_name_id=12 line=167 end_line=175 column=10 end_column=5}
14 {file_name_id=6 function_name_id=13 line=299 end_line=299 column=13 end_column=50}
15 {file_name_id=6 function_name_id=13 line=325 end_line=335 column=16 end_column=3}
16 {file_name_id=7 function_name_id=14 line=396 end_line=400 column=15 end_column=16}
17 {file_name_id=8 function_name_id=15 line=116 end_line=116 column=10 end_column=57}
18 {file_name_id=9 function_name_id=15 line=160 end_line=160 column=11 end_column=53}
19 {file_name_id=7 function_name_id=14 line=409 end_line=411 column=11 end_column=38}
20 {file_name_id=10 function_name_id=16 line=391 end_line=391 column=15 end_column=38}
21 {file_name_id=10 function_name_id=17 line=212 end_line=214 column=26 end_column=24}
22 {file_name_id=10 function_name_id=18 line=196 end_line=197 column=26 end_column=66}
23 {file_name_id=10 function_name_id=19 line=281 end_line=281 column=11 end_column=38}
24 {file_name_id=7 function_name_id=20 line=374 end_line=385 column=21 end_column=7}
25 {file_name_id=7 function_name_id=21 line=294 end_line=294 column=8 end_column=63}
26 {file_name_id=7 function_name_id=22 line=39 end_line=44 column=8 end_column=8}
27 {file_name_id=7 function_name_id=22 line=45 end_line=49 column=18 end_column=18}
28 {file_name_id=7 function_name_id=21 line=295 end_line=295 column=8 end_column=63}
29 {file_name_id=7 function_name_id=21 line=317 end_line=317 column=12 end_column=43}
30 {file_name_id=7 function_name_id=20 line=386 end_line=392 column=21 end_column=7}
31 {file_name_id=7 function_name_id=23 line=99 end_line=99 column=6 end_column=60}
32 {file_name_id=7 function_name_id=21 line=314 end_line=314 column=47 end_column=68}
33 {file_name_id=7 function_name_id=21 line=291 end_line=291 column=9 end_column=21}
34 {file_name_id=7 function_name_id=21 line=289 end_line=290 column=6 end_column=42}
35 {file_name_id=7 function_name_id=21 line=290 end_line=290 column=9 end_column=21}
36 {file_name_id=7 function_name_id=20 line=370 end_line=372 column=17 end_column=7}
37 {file_name_id=11 function_name_id=24 line=978 end_line=978 column=14 end_column=57}
38 {file_name_id=11 function_name_id=24 line=976 end_line=976 column=18 end_column=50}
39 {file_name_id=11 function_name_id=24 line=999 end_line=999 column=13 end_column=68}
40 {file_name_id=11 function_name_id=24 line=999 end_line=999 column=2 end_column=68}
41 {file_name_id=7 function_name_id=21 line=290 end_line=290 column=8 end_column=42}
42 {file_name_id=7 function_name_id=21 line=291 end_line=291 column=8 end_column=42}
43 {file_name_id=9 function_name_id=15 line=165 end_line=165 column=17 end_column=58}
44 {file_name_id=9 function_name_id=15 line=206 end_line=206 column=32 end_column=46}
45 {file_name_id=9 function_name_id=15 line=206 end_line=206 column=18 end_column=47}
46 {file_name_id=9 function_name_id=15 line=207 end_line=207 column=18 end_column=31}
47 {file_name_id=9 function_name_id=15 line=207 end_line=207 column=11 end_column=32}
48 {file_name_id=8 function_name_id=15 line=108 end_line=108 column=14 end_column=50}
49 {file_name_id=9 function_name_id=15 line=206 end_line=206 column=10 end_column=47}
50 {file_name_id=7 function_name_id=22 line=50 end_line=55 column=19 end_column=18}
51 {file_name_id=8 function_name_id=25 line=313 end_line=313 column=15 end_column=78}
52 {file_name_id=8 function_name_id=25 line=322 end_line=322 column=6 end_column=20}
53 {file_name_id=7 function_name_id=22 line=56 end_line=58 column=18 end_column=18}
54 {file_name_id=7 function_name_id=22 line=59 end_line=59 column=8 end_column=36}
55 {file_name_id=7 function_name_id=21 line=302 end_line=304 column=6 end_column=8}
56 {file_name_id=7 function_name_id=21 line=305 end_line=307 column=6 end_column=8}
57 {file_name_id=7 function_name_id=21 line=314 end_line=314 column=11 end_column=72}
58 {file_name_id=7 function_name_id=21 line=316 end_line=316 column=4 end_column=25}
59 {file_name_id=7 function_name_id=21 line=320 end_line=322 column=6 end_column=8}
60 {file_name_id=7 function_name_id=21 line=323 end_line=323 column=17 end_column=64}
61 {file_name_id=7 function_name_id=21 line=324 end_line=324 column=17 end_column=75}
62 {file_name_id=7 function_name_id=21 line=326 end_line=331 column=16 end_column=8}
63 {file_name_id=7 function_name_id=21 line=332 end_line=332 column=18 end_column=45}
64 {file_name_id=7 function_name_id=21 line=332 end_line=332 column=2 end_column=45}
65 {file_name_id=7 function_name_id=21 line=334 end_line=336 column=11 end_column=3}
66 {file_name_id=7 function_name_id=26 line=74 end_line=74 column=13 end_column=66}
67 {file_name_id=7 function_name_id=26 line=76 end_line=82 column=11 end_column=18}
68 {file_name_id=7 function_name_id=26 line=83 end_line=83 column=13 end_column=33}
69 {file_name_id=7 function_name_id=20 line=374 end_line=385 column=6 end_column=7}
70 {file_name_id=7 function_name_id=23 line=108 end_line=108 column=14 end_column=72}
71 {file_name_id=7 function_name_id=23 line=109 end_line=109 column=8 end_column=80}
72 {file_name_id=12 function_name_id=27 line=108 end_line=108 column=13 end_column=71}
73 {file_name_id=13 function_name_id=28 line=293 end_line=293 column=11 end_column=21}
74 {file_name_id=13 function_name_id=29 line=250 end_line=250 column=13 end_column=40}
75 {file_name_id=14 function_name_id=30 line=213 end_line=213 column=11 end_column=27}
76 {file_name_id=14 function_name_id=31 line=191 end_line=191 column=13 end_column=70}
77 {file_name_id=13 function_name_id=32 line=243 end_line=243 column=25 end_column=66}
78 {file_name_id=15 function_name_id=33 line=541 end_line=541 column=27 end_column=70}
79 {file_name_id=15 function_name_id=34 line=465 end_line=465 column=22 end_column=41}
80 {file_name_id=16 function_name_id=35 line=114 end_line=114 column=8 end_column=70}
81 {file_name_id=16 function_name_id=35 line=118 end_line=118 column=8 end_column=31}
82 {file_name_id=16 function_name_id=35 line=117 end_line=121 column=23 end_column=5}
83 {file_name_id=16 function_name_id=35 line=123 end_line=123 column=13 end_column=29}
84 {file_name_id=16 function_name_id=35 line=124 end_line=124 column=11 end_column=28}
85 {file_name_id=7 function_name_id=23 line=117 end_line=119 column=11 end_column=3}
86 {file_name_id=7 function_name_id=20 line=386 end_line=392 column=6 end_column=7}
87 {file_name_id=6 function_name_id=13 line=348 end_line=350 column=14 end_column=3}
88 {file_name_id=17 function_name_id=36 line=91 end_line=91 column=9 end_column=60}
89 {file_name_id=17 function_name_id=36 line=93 end_line=93 column=10 end_column=53}
90 {file_name_id=18 function_name_id=37 line=676 end_line=676 column=12 end_column=28}
91 {file_name_id=4 function_name_id=38 line=292 end_line=297 column=19 end_column=7}
92 {file_name_id=19 function_name_id=39 line=279 end_line=281 column=10 end_column=11}
93 {file_name_id=9 function_name_id=15 line=162 end_line=162 column=24 end_column=78}
94 {file_name_id=19 function_name_id=39 line=286 end_line=288 column=25 end_column=7}
95 {file_name_id=19 function_name_id=40 line=144 end_line=144 column=8 end_column=63}
96 {file_name_id=19 function_name_id=40 line=157 end_line=159 column=32 end_column=5}
97 {file_name_id=19 function_name_id=39 line=290 end_line=295 column=30 end_column=7}
98 {file_name_id=19 function_name_id=41 line=200 end_line=205 column=19 end_column=5}
99 {file_name_id=20 function_name_id=42 line=203 end_line=205 column=36 end_column=5}
100 {file_name_id=18 function_name_id=43 line=644 end_line=645 column=23 end_column=61}
101 {file_name_id=18 function_name_id=44 line=627 end_line=627 column=21 end_column=32}
102 {file_name_id=20 function_name_id=45 line=191 end_line=197 column=18 end_column=7}
103 {file_name_id=20 function_name_id=46 line=345 end_line=345 column=10 end_column=73}
104 {file_name_id=20 function_name_id=47 line=278 end_line=280 column=14 end_column=7}
105 {file_name_id=20 function_name_id=48 line=61 end_line=68 column=10 end_column=3}
106 {file_name_id=20 function_name_id=47 line=326 end_line=328 column=24 end_column=7}
107 {file_name_id=20 function_name_id=46 line=357 end_line=357 column=12 end_column=31}
108 {file_name_id=10 function_name_id=16 line=404 end_line=404 column=14 end_column=35}
109 {file_name_id=10 function_name_id=49 line=250 end_line=250 column=10 end_column=31}
110 {file_name_id=20 function_name_id=50 line=350 end_line=352 column=15 end_column=43}
111 {file_name_id=21 function_name_id=51 line=475 end_line=479 column=11 end_column=21}
112 {file_name_id=21 function_name_id=52 line=285 end_line=285 column=10 end_column=51}
113 {file_name_id=21 function_name_id=52 line=323 end_line=323 column=10 end_column=69}
114 {file_name_id=21 function_name_id=51 line=481 end_line=485 column=11 end_column=21}
115 {file_name_id=21 function_name_id=51 line=487 end_line=492 column=11 end_column=21}
116 {file_name_id=21 function_name_id=53 line=223 end_line=223 column=10 end_column=44}
117 {file_name_id=21 function_name_id=53 line=241 end_line=246 column=10 end_column=5}
118 {file_name_id=22 function_name_id=54 line=255 end_line=255 column=11 end_column=40}
119 {file_name_id=22 function_name_id=55 line=215 end_line=215 column=19 end_column=65}
120 {file_name_id=22 function_name_id=56 line=204 end_line=204 column=20 end_column=57}
121 {file_name_id=22 function_name_id=57 line=199 end_line=199 column=18 end_column=61}
122 {file_name_id=22 function_name_id=58 line=167 end_line=167 column=13 end_column=40}
123 {file_name_id=22 function_name_id=59 line=246 end_line=246 column=10 end_column=23}
124 {file_name_id=21 function_name_id=60 line=183 end_line=190 column=19 end_column=5}
125 {file_name_id=23 function_name_id=61 line=179 end_line=189 column=13 end_column=7}
126 {file_name_id=24 function_name_id=62 line=400 end_line=402 column=13 end_column=7}
127 {file_name_id=24 function_name_id=63 line=379 end_line=397 column=13 end_column=7}
128 {file_name_id=24 function_name_id=64 line=666 end_line=666 column=10 end_column=58}
129 {file_name_id=24 function_name_id=64 line=668 end_line=668 column=10 end_column=55}
130 {file_name_id=24 function_name_id=65 line=609 end_line=609 column=4 end_column=26}
131 {file_name_id=22 function_name_id=58 line=160 end_line=166 column=20 end_column=7}
132 {file_name_id=22 function_name_id=66 line=161 end_line=163 column=30 end_column=11}
133 {file_name_id=22 function_name_id=67 line=44 end_line=46 column=11 end_column=5}
134 {file_name_id=21 function_name_id=60 line=172 end_line=174 column=8 end_column=10}
135 {file_name_id=21 function_name_id=60 line=175 end_line=177 column=8 end_column=10}
136 {file_name_id=21 function_name_id=60 line=178 end_line=178 column=8 end_column=70}
137 {file_name_id=21 function_name_id=60 line=181 end_line=181 column=11 end_column=35}
138 {file_name_id=24 function_name_id=65 line=601 end_line=607 column=13 end_column=5}
139 {file_name_id=24 function_name_id=65 line=612 end_line=612 column=16 end_column=29}
140 {file_name_id=24 function_name_id=65 line=626 end_line=626 column=15 end_column=63}
141 {file_name_id=24 function_name_id=64 line=667 end_line=667 column=25 end_column=34}
142 {file_name_id=24 function_name_id=64 line=667 end_line=667 column=17 end_column=35}
143 {file_name_id=24 function_name_id=64 line=669 end_line=669 column=9 end_column=29}
144 {file_name_id=24 function_name_id=65 line=633 end_line=639 column=10 end_column=5}
145 {file_name_id=24 function_name_id=65 line=639 end_line=639 column=6 end_column=21}
146 {file_name_id=21 function_name_id=60 line=191 end_line=191 column=19 end_column=77}
147 {file_name_id=21 function_name_id=60 line=193 end_line=199 column=18 end_column=10}
148 {file_name_id=21 function_name_id=60 line=200 end_line=200 column=20 end_column=47}
149 {file_name_id=21 function_name_id=60 line=200 end_line=200 column=4 end_column=47}
150 {file_name_id=21 function_name_id=60 line=202 end_line=206 column=11 end_column=19}
151 {file_name_id=22 function_name_id=57 line=201 end_line=201 column=13 end_column=70}
152 {file_name_id=22 function_name_id=68 line=196 end_line=196 column=13 end_column=77}
153 {file_name_id=22 function_name_id=55 line=219 end_line=219 column=16 end_column=72}
154 {file_name_id=21 function_name_id=51 line=494 end_line=499 column=11 end_column=21}
155 {file_name_id=21 function_name_id=51 line=511 end_line=511 column=11 end_column=32}
156 {file_name_id=21 function_name_id=69 line=69 end_line=69 column=10 end_column=52}
157 {file_name_id=21 function_name_id=52 line=278 end_line=278 column=11 end_column=26}
158 {file_name_id=8 function_name_id=15 line=95 end_line=95 column=10 end_column=31}
159 {file_name_id=8 function_name_id=15 line=114 end_line=114 column=15 end_column=52}
160 {file_name_id=9 function_name_id=15 line=162 end_line=162 column=33 end_column=51}
161 {file_name_id=9 function_name_id=15 line=163 end_line=163 column=35 end_column=51}
162 {file_name_id=9 function_name_id=15 line=163 end_line=163 column=17 end_column=51}
163 {file_name_id=8 function_name_id=15 line=119 end_line=119 column=12 end_column=29}
164 {file_name_id=21 function_name_id=52 line=298 end_line=298 column=20 end_column=73}
165 {file_name_id=21 function_name_id=52 line=300 end_line=302 column=19 end_column=7}
166 {file_name_id=16 function_name_id=35 line=124 end_line=124 column=10 end_column=45}
167 {file_name_id=21 function_name_id=52 line=303 end_line=303 column=19 end_column=55}
168 {file_name_id=21 function_name_id=52 line=304 end_line=304 column=6 end_column=24}
169 {file_name_id=21 function_name_id=52 line=319 end_line=319 column=17 end_column=75}
170 {file_name_id=21 function_name_id=52 line=320 end_line=320 column=11 end_column=43}
171 {file_name_id=21 function_name_id=52 line=321 end_line=321 column=11 end_column=33}
172 {file_name_id=21 function_name_id=52 line=321 end_line=321 column=35 end_column=57}
173 {file_name_id=21 function_name_id=52 line=322 end_line=322 column=10 end_column=36}
174 {file_name_id=21 function_name_id=52 line=325 end_line=325 column=10 end_column=39}
175 {file_name_id=21 function_name_id=52 line=326 end_line=330 column=10 end_column=10}
176 {file_name_id=21 function_name_id=52 line=332 end_line=337 column=15 end_column=16}
177 {file_name_id=21 function_name_id=52 line=338 end_line=338 column=11 end_column=35}
178 {file_name_id=21 function_name_id=52 line=338 end_line=338 column=4 end_column=35}
179 {file_name_id=21 function_name_id=51 line=475 end_line=479 column=4 end_column=21}
180 {file_name_id=21 function_name_id=51 line=481 end_line=485 column=4 end_column=21}
181 {file_name_id=21 function_name_id=53 line=222 end_line=222 column=16 end_column=47}
182 {file_name_id=21 function_name_id=53 line=225 end_line=227 column=22 end_column=10}
183 {file_name_id=21 function_name_id=53 line=228 end_line=228 column=22 end_column=63}
184 {file_name_id=21 function_name_id=53 line=239 end_line=239 column=16 end_column=43}
185 {file_name_id=21 function_name_id=51 line=487 end_line=492 column=4 end_column=21}
186 {file_name_id=21 function_name_id=53 line=237 end_line=237 column=12 end_column=37}
187 {file_name_id=21 function_name_id=53 line=249 end_line=249 column=12 end_column=37}
188 {file_name_id=21 function_name_id=51 line=494 end_line=499 column=4 end_column=21}
189 {file_name_id=21 function_name_id=69 line=78 end_line=78 column=16 end_column=73}
190 {file_name_id=21 function_name_id=69 line=79 end_line=81 column=10 end_column=7}
191 {file_name_id=21 function_name_id=69 line=89 end_line=93 column=11 end_column=8}
192 {file_name_id=21 function_name_id=51 line=511 end_line=511 column=4 end_column=32}
193 {file_name_id=20 function_name_id=46 line=359 end_line=359 column=10 end_column=53}
194 {file_name_id=20 function_name_id=47 line=311 end_line=311 column=20 end_column=42}
195 {file_name_id=25 function_name_id=70 line=111 end_line=111 column=18 end_column=36}
196 {file_name_id=25 function_name_id=71 line=103 end_line=103 column=14 end_column=44}
197 {file_name_id=20 function_name_id=47 line=269 end_line=269 column=30 end_column=56}
198 {file_name_id=20 function_name_id=47 line=269 end_line=269 column=6 end_column=56}
199 {file_name_id=20 function_name_id=47 line=271 end_line=273 column=48 end_column=7}
200 {file_name_id=26 function_name_id=72 line=57 end_line=59 column=29 end_column=3}
201 {file_name_id=26 function_name_id=72 line=61 end_line=65 column=21 end_column=3}
202 {file_name_id=26 function_name_id=72 line=68 end_line=68 column=28 end_column=61}
203 {file_name_id=26 function_name_id=72 line=67 end_line=69 column=16 end_column=3}
204 {file_name_id=26 function_name_id=72 line=73 end_line=73 column=24 end_column=51}
205 {file_name_id=26 function_name_id=72 line=72 end_line=74 column=21 end_column=3}
206 {file_name_id=26 function_name_id=72 line=74 end_line=74 column=4 end_column=23}
207 {file_name_id=20 function_name_id=47 line=275 end_line=275 column=10 end_column=63}
208 {file_name_id=20 function_name_id=47 line=277 end_line=277 column=6 end_column=47}
209 {file_name_id=20 function_name_id=48 line=56 end_line=56 column=17 end_column=78}
210 {file_name_id=20 function_name_id=48 line=57 end_line=57 column=17 end_column=41}
211 {file_name_id=20 function_name_id=48 line=59 end_line=59 column=7 end_column=23}
212 {file_name_id=20 function_name_id=48 line=58 end_line=60 column=17 end_column=3}
213 {file_name_id=20 function_name_id=48 line=63 end_line=64 column=10 end_column=47}
214 {file_name_id=20 function_name_id=48 line=62 end_line=65 column=6 end_column=7}
215 {file_name_id=20 function_name_id=48 line=70 end_line=70 column=11 end_column=31}
216 {file_name_id=20 function_name_id=48 line=70 end_line=70 column=10 end_column=52}
217 {file_name_id=20 function_name_id=48 line=71 end_line=71 column=6 end_column=26}
218 {file_name_id=20 function_name_id=48 line=72 end_line=72 column=4 end_column=23}
219 {file_name_id=20 function_name_id=47 line=281 end_line=281 column=15 end_column=45}
220 {file_name_id=20 function_name_id=47 line=281 end_line=281 column=6 end_column=45}
221 {file_name_id=20 function_name_id=47 line=282 end_line=282 column=14 end_column=33}
222 {file_name_id=20 function_name_id=47 line=283 end_line=283 column=28 end_column=61}
223 {file_name_id=20 function_name_id=47 line=286 end_line=291 column=15 end_column=7}
224 {file_name_id=20 function_name_id=47 line=292 end_line=292 column=24 end_column=42}
225 {file_name_id=20 function_name_id=47 line=293 end_line=293 column=24 end_column=42}
226 {file_name_id=20 function_name_id=47 line=299 end_line=303 column=31 end_column=7}
227 {file_name_id=20 function_name_id=47 line=305 end_line=305 column=10 end_column=61}
228 {file_name_id=25 function_name_id=73 line=127 end_line=127 column=16 end_column=36}
229 {file_name_id=27 function_name_id=74 line=31 end_line=31 column=15 end_column=61}
230 {file_name_id=27 function_name_id=74 line=30 end_line=30 column=6 end_column=31}
231 {file_name_id=20 function_name_id=47 line=304 end_line=308 column=29 end_column=7}
232 {file_name_id=20 function_name_id=75 line=91 end_line=91 column=21 end_column=40}
233 {file_name_id=20 function_name_id=75 line=96 end_line=96 column=13 end_column=37}
234 {file_name_id=20 function_name_id=75 line=100 end_line=100 column=6 end_column=26}
235 {file_name_id=20 function_name_id=76 line=98 end_line=98 column=38 end_column=42}
236 {file_name_id=20 function_name_id=75 line=100 end_line=100 column=29 end_column=49}
237 {file_name_id=20 function_name_id=75 line=100 end_line=100 column=52 end_column=72}
238 {file_name_id=20 function_name_id=75 line=101 end_line=101 column=4 end_column=23}
239 {file_name_id=20 function_name_id=75 line=106 end_line=106 column=8 end_column=75}
240 {file_name_id=20 function_name_id=76 line=106 end_line=106 column=44 end_column=63}
241 {file_name_id=20 function_name_id=75 line=110 end_line=110 column=6 end_column=45}
242 {file_name_id=25 function_name_id=77 line=70 end_line=70 column=11 end_column=56}
243 {file_name_id=25 function_name_id=78 line=70 end_line=70 column=37 end_column=42}
244 {file_name_id=20 function_name_id=75 line=111 end_line=111 column=6 end_column=45}
245 {file_name_id=20 function_name_id=75 line=109 end_line=112 column=13 end_column=3}
246 {file_name_id=28 function_name_id=79 line=182 end_line=182 column=9 end_column=24}
247 {file_name_id=25 function_name_id=71 line=101 end_line=101 column=12 end_column=26}
248 {file_name_id=25 function_name_id=80 line=96 end_line=96 column=11 end_column=27}
249 {file_name_id=25 function_name_id=80 line=96 end_line=96 column=30 end_column=46}
250 {file_name_id=25 function_name_id=80 line=96 end_line=96 column=49 end_column=65}
251 {file_name_id=25 function_name_id=71 line=104 end_line=104 column=11 end_column=26}
252 {file_name_id=25 function_name_id=70 line=111 end_line=111 column=11 end_column=36}
253 {file_name_id=25 function_name_id=81 line=79 end_line=79 column=11 end_column=50}
254 {file_name_id=25 function_name_id=82 line=79 end_line=79 column=34 end_column=43}
255 {file_name_id=28 function_name_id=79 line=184 end_line=184 column=8 end_column=18}
256 {file_name_id=28 function_name_id=79 line=185 end_line=185 column=15 end_column=21}
257 {file_name_id=25 function_name_id=83 line=76 end_line=76 column=11 end_column=23}
258 {file_name_id=25 function_name_id=84 line=73 end_line=73 column=11 end_column=50}
259 {file_name_id=25 function_name_id=85 line=73 end_line=73 column=34 end_column=43}
260 {file_name_id=28 function_name_id=79 line=185 end_line=185 column=10 end_column=21}
261 {file_name_id=28 function_name_id=79 line=185 end_line=185 column=9 end_column=35}
262 {file_name_id=28 function_name_id=79 line=187 end_line=187 column=9 end_column=21}
263 {file_name_id=25 function_name_id=86 line=89 end_line=89 column=12 end_column=28}
264 {file_name_id=25 function_name_id=86 line=89 end_line=89 column=31 end_column=47}
265 {file_name_id=25 function_name_id=86 line=90 end_line=90 column=12 end_column=28}
266 {file_name_id=25 function_name_id=86 line=90 end_line=90 column=31 end_column=47}
267 {file_name_id=25 function_name_id=86 line=91 end_line=91 column=12 end_column=28}
268 {file_name_id=25 function_name_id=86 line=91 end_line=91 column=31 end_column=47}
269 {file_name_id=20 function_name_id=47 line=310 end_line=310 column=18 end_column=32}
270 {file_name_id=29 function_name_id=87 line=34 end_line=37 column=25 end_column=5}
271 {file_name_id=29 function_name_id=88 line=35 end_line=35 column=18 end_column=29}
272 {file_name_id=30 function_name_id=89 line=123 end_line=123 column=50 end_column=67}
273 {file_name_id=25 function_name_id=90 line=82 end_line=82 column=11 end_column=43}
274 {file_name_id=25 function_name_id=91 line=82 end_line=82 column=34 end_column=36}
275 {file_name_id=30 function_name_id=89 line=123 end_line=123 column=22 end_column=68}
276 {file_name_id=28 function_name_id=92 line=144 end_line=144 column=8 end_column=25}
277 {file_name_id=28 function_name_id=92 line=144 end_line=144 column=28 end_column=45}
278 {file_name_id=28 function_name_id=92 line=144 end_line=144 column=48 end_column=65}
279 {file_name_id=28 function_name_id=92 line=145 end_line=145 column=8 end_column=25}
280 {file_name_id=28 function_name_id=92 line=145 end_line=145 column=28 end_column=45}
281 {file_name_id=28 function_name_id=92 line=145 end_line=145 column=48 end_column=65}
282 {file_name_id=28 function_name_id=92 line=146 end_line=146 column=8 end_column=25}
283 {file_name_id=28 function_name_id=92 line=146 end_line=146 column=28 end_column=45}
284 {file_name_id=28 function_name_id=92 line=146 end_line=146 column=48 end_column=65}
285 {file_name_id=30 function_name_id=93 line=128 end_line=128 column=11 end_column=46}
286 {file_name_id=25 function_name_id=94 line=67 end_line=67 column=11 end_column=56}
287 {file_name_id=25 function_name_id=95 line=67 end_line=67 column=37 end_column=42}
288 {file_name_id=20 function_name_id=47 line=314 end_line=314 column=21 end_column=36}
289 {file_name_id=20 function_name_id=47 line=315 end_line=315 column=22 end_column=49}
290 {file_name_id=20 function_name_id=47 line=317 end_line=317 column=25 end_column=47}
291 {file_name_id=20 function_name_id=47 line=317 end_line=317 column=50 end_column=72}
292 {file_name_id=20 function_name_id=47 line=318 end_line=318 column=6 end_column=44}
293 {file_name_id=20 function_name_id=47 line=319 end_line=319 column=21 end_column=41}
294 {file_name_id=20 function_name_id=47 line=337 end_line=342 column=15 end_column=12}
295 {file_name_id=8 function_name_id=25 line=280 end_line=282 column=15 end_column=7}
296 {file_name_id=8 function_name_id=25 line=283 end_line=283 column=15 end_column=31}
297 {file_name_id=20 function_name_id=47 line=337 end_line=342 column=8 end_column=12}
298 {file_name_id=10 function_name_id=17 line=200 end_line=200 column=10 end_column=31}
299 {file_name_id=10 function_name_id=96 line=52 end_line=52 column=8 end_column=33}
300 {file_name_id=5 function_name_id=97 line=1222 end_line=1222 column=11 end_column=24}
301 {file_name_id=5 function_name_id=10 line=1067 end_line=1067 column=17 end_column=60}
302 {file_name_id=20 function_name_id=45 line=198 end_line=198 column=13 end_column=30}
303 {file_name_id=18 function_name_id=44 line=628 end_line=628 column=6 end_column=36}
304 {file_name_id=18 function_name_id=98 line=96 end_line=96 column=4 end_column=32}
305 {file_name_id=5 function_name_id=99 line=1075 end_line=1075 column=6 end_column=27}
306 {file_name_id=19 function_name_id=39 line=296 end_line=302 column=30 end_column=7}
307 {file_name_id=19 function_name_id=100 line=219 end_line=219 column=21 end_column=62}
308 {file_name_id=31 function_name_id=101 line=274 end_line=274 column=21 end_column=47}
309 {file_name_id=31 function_name_id=101 line=275 end_line=275 column=16 end_column=61}
310 {file_name_id=31 function_name_id=102 line=109 end_line=109 column=6 end_column=31}
311 {file_name_id=31 function_name_id=103 line=77 end_line=77 column=11 end_column=33}
312 {file_name_id=31 function_name_id=104 line=47 end_line=49 column=13 end_column=3}
313 {file_name_id=31 function_name_id=102 line=114 end_line=116 column=12 end_column=3}
314 {file_name_id=19 function_name_id=100 line=248 end_line=248 column=23 end_column=55}
315 {file_name_id=19 function_name_id=105 line=237 end_line=242 column=13 end_column=7}
316 {file_name_id=21 function_name_id=106 line=580 end_line=585 column=16 end_column=24}
317 {file_name_id=21 function_name_id=107 line=365 end_line=365 column=10 end_column=52}
318 {file_name_id=21 function_name_id=108 line=405 end_line=405 column=12 end_column=73}
319 {file_name_id=21 function_name_id=108 line=406 end_line=406 column=13 end_column=27}
320 {file_name_id=21 function_name_id=107 line=408 end_line=415 column=10 end_column=5}
321 {file_name_id=21 function_name_id=106 line=587 end_line=589 column=15 end_column=43}
322 {file_name_id=21 function_name_id=109 line=110 end_line=110 column=10 end_column=44}
323 {file_name_id=21 function_name_id=109 line=111 end_line=111 column=15 end_column=55}
324 {file_name_id=21 function_name_id=109 line=116 end_line=116 column=21 end_column=48}
325 {file_name_id=21 function_name_id=109 line=117 end_line=117 column=14 end_column=45}
326 {file_name_id=21 function_name_id=106 line=591 end_line=593 column=15 end_column=14}
327 {file_name_id=21 function_name_id=106 line=595 end_line=599 column=16 end_column=26}
328 {file_name_id=21 function_name_id=106 line=601 end_line=605 column=16 end_column=26}
329 {file_name_id=21 function_name_id=106 line=607 end_line=612 column=16 end_column=26}
330 {file_name_id=21 function_name_id=106 line=614 end_line=619 column=16 end_column=26}
331 {file_name_id=21 function_name_id=106 line=631 end_line=631 column=16 end_column=42}
332 {file_name_id=21 function_name_id=109 line=116 end_line=116 column=14 end_column=49}
333 {file_name_id=21 function_name_id=107 line=419 end_line=419 column=18 end_column=32}
334 {file_name_id=21 function_name_id=107 line=364 end_line=364 column=11 end_column=26}
335 {file_name_id=21 function_name_id=107 line=367 end_line=371 column=22 end_column=10}
336 {file_name_id=21 function_name_id=107 line=367 end_line=371 column=15 end_column=10}
337 {file_name_id=21 function_name_id=107 line=373 end_line=377 column=23 end_column=10}
