HloModule jit__prefill_jit, entry_computation_layout={(s32[64]{0}, f32[4096]{0}, f32[4096,32,14336]{2,1,0}, f32[4096,32,14336]{2,1,0}, f32[14336,32,4096]{2,1,0}, /*index=5*/f32[4096,32]{1,0}, f32[4096,32]{1,0}, f32[4096,32,8,128]{3,2,1,0}, f32[32,32,128,4096]{3,2,1,0}, f32[4096,32,32,128]{3,2,1,0}, /*index=10*/f32[4096,32,8,128]{3,2,1,0}, f32[4096,128256]{1,0}, f32[128256,4096]{1,0}, s32[])->(s32[32,1]{1,0}, s32[32,1,1984]{2,1,0}, s32[32,1,64]{2,1,0}, bf16[32,1984,8,1,128]{4,3,2,1,0}, s32[32,1]{1,0}, /*index=5*/bf16[32,1984,8,1,128]{4,3,2,1,0}, bf16[32,64,8,1,128]{4,3,2,1,0}, bf16[32,64,8,1,128]{4,3,2,1,0}, s32[1,1]{1,0}, f32[1,1,128256]{2,1,0}, /*index=10*/s32[1,1]{1,0}, f32[1,1]{1,0}, s32[1,1]{1,0}, s32[1,3]{1,0}, f32[1,1]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true,false,false,false,false,false,false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, num_partitions=8, frontend_attributes={xla.sdy.meshes={empty_mesh = #sdy.mesh<[]>, mesh = #sdy.mesh<["diloco"=1, "data"=1, "stage"=1, "fsdp"=1, "fsdp_transpose"=1, "context"=1, "context_autoregressive"=1, "tensor"=8, "tensor_transpose"=1, "tensor_sequence"=1, "expert"=1, "autoregressive"=1]>}}

FileNames
1 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/maxengine/maxengine.py"
2 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/models/models.py"
3 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/decoders.py"
4 "/usr/local/lib/python3.12/dist-packages/flax/core/axes_scan.py"
5 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/nnx_wrappers.py"
6 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/models/llama2.py"
7 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/normalizations.py"
8 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/attentions.py"
9 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/attention_op.py"
10 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/utils/sharding.py"
11 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/linears.py"
12 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/embeddings.py"
13 "/usr/local/lib/python3.12/dist-packages/flax/nnx/pytreelib.py"
14 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/kvcache.py"
15 "<frozen runpy>"
16 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/decode.py"
17 "/usr/local/lib/python3.12/dist-packages/absl/app.py"
18 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/inference_utils.py"

FunctionNames
1 "MaxEngine._prefill_jit"
2 "TransformerLinenPure.apply"
3 "TransformerLinenPure.__call__"
4 "Decoder.__call__"
5 "scan.<locals>.scan_fn"
6 "scan.<locals>.scan_fn.<locals>.body_fn"
7 "ToLinen.__call__"
8 "LlamaDecoderLayer.__call__"
9 "_fix_for_qwix_quantization.<locals>.wrap.<locals>.wrapped"
10 "RMSNorm.__call__"
11 "Attention.__call__"
12 "AttentionOp.__call__"
13 "AttentionOp.apply_attention"
14 "AttentionOp.apply_attention_dot"
15 "AttentionOp.compute_local_attention"
16 "maybe_shard_with_logical"
17 "maybe_shard_with_name"
18 "Attention.kv_projection"
19 "DenseGeneral.__call__"
20 "_compute_dot_general_nnx"
21 "AttentionOp.generate_attention_mask"
22 "apply_mask_to_logits"
23 "Attention.apply_rotary_embedding"
24 "LLaMARotaryEmbedding.__call__"
25 "LLaMARotaryEmbedding.timescale"
26 "LLaMARotaryEmbedding._apply_scaling_factor"
27 "LLaMARotaryEmbedding._apply_scaling_factor.<locals>.bigger_or_equal_wavelen"
28 "LLaMARotaryEmbedding._apply_scaling_factor.<locals>.bigger_or_equal_wavelen.<locals>.equal_wavelen"
29 "LLaMARotaryEmbedding._apply_scaling_factor.<locals>.bigger_or_equal_wavelen.<locals>.bigger_wavelen"
30 "Attention.query_projection"
31 "AttentionOp.qk_product"
32 "AttentionOp.wv_product"
33 "Attention.out_projection"
34 "MlpBlock.__call__"
35 "PytreeMeta.__call__"
36 "_graph_node_meta_call"
37 "PytreeMeta._pytree_meta_construct"
38 "LlamaDecoderLayer.__init__"
39 "Attention.__init__"
40 "Attention.init_kv_caches"
41 "KVCache.__init__"
42 "KVCache._initialize_ar_cache_vars"
43 "Attention.update_kv_caches"
44 "KVCache.__call__"
45 "KVCache.kv_cache_prefill"
46 "_run_module_as_main"
47 "_run_code"
48 "<module>"
49 "run"
50 "_run_main"
51 "main"
52 "MaxEngine.prefill"
53 "Decoder.apply_output_head"
54 "sampling"
55 "Decoder._apply_embedding"
56 "Embed.__call__"
57 "scan.<locals>.transpose_to_front"
58 "scan.<locals>.transpose_to_front.<locals>.trans"

FileLocations
1 {file_name_id=1 function_name_id=1 line=798 end_line=815 column=32 end_column=9}
2 {file_name_id=2 function_name_id=2 line=71 end_line=71 column=11 end_column=51}
3 {file_name_id=2 function_name_id=3 line=202 end_line=215 column=38 end_column=5}
4 {file_name_id=3 function_name_id=4 line=1133 end_line=1142 column=19 end_column=41}
5 {file_name_id=4 function_name_id=5 line=200 end_line=203 column=14 end_column=7}
6 {file_name_id=4 function_name_id=6 line=157 end_line=157 column=29 end_column=53}
7 {file_name_id=5 function_name_id=7 line=549 end_line=549 column=10 end_column=44}
8 {file_name_id=6 function_name_id=8 line=166 end_line=166 column=10 end_column=79}
9 {file_name_id=5 function_name_id=9 line=383 end_line=383 column=15 end_column=39}
10 {file_name_id=7 function_name_id=10 line=72 end_line=72 column=12 end_column=59}
11 {file_name_id=6 function_name_id=8 line=170 end_line=182 column=30 end_column=5}
12 {file_name_id=8 function_name_id=11 line=1225 end_line=1236 column=12 end_column=7}
13 {file_name_id=9 function_name_id=12 line=2106 end_line=2123 column=86 end_column=5}
14 {file_name_id=9 function_name_id=13 line=972 end_line=986 column=13 end_column=7}
15 {file_name_id=9 function_name_id=14 line=1919 end_line=1919 column=11 end_column=109}
16 {file_name_id=9 function_name_id=15 line=1770 end_line=1770 column=16 end_column=55}
17 {file_name_id=9 function_name_id=15 line=1772 end_line=1772 column=16 end_column=68}
18 {file_name_id=6 function_name_id=8 line=188 end_line=188 column=20 end_column=103}
19 {file_name_id=7 function_name_id=10 line=90 end_line=90 column=12 end_column=42}
20 {file_name_id=6 function_name_id=8 line=163 end_line=163 column=13 end_column=79}
21 {file_name_id=10 function_name_id=16 line=147 end_line=155 column=9 end_column=3}
22 {file_name_id=10 function_name_id=17 line=113 end_line=113 column=11 end_column=67}
23 {file_name_id=7 function_name_id=10 line=71 end_line=71 column=8 end_column=35}
24 {file_name_id=7 function_name_id=10 line=72 end_line=72 column=21 end_column=34}
25 {file_name_id=7 function_name_id=10 line=73 end_line=73 column=34 end_column=54}
26 {file_name_id=7 function_name_id=10 line=73 end_line=73 column=24 end_column=55}
27 {file_name_id=7 function_name_id=10 line=73 end_line=73 column=20 end_column=55}
28 {file_name_id=7 function_name_id=10 line=73 end_line=73 column=8 end_column=68}
29 {file_name_id=7 function_name_id=10 line=92 end_line=92 column=11 end_column=84}
30 {file_name_id=6 function_name_id=8 line=167 end_line=167 column=10 end_column=73}
31 {file_name_id=8 function_name_id=11 line=1125 end_line=1125 column=16 end_column=75}
32 {file_name_id=8 function_name_id=11 line=1147 end_line=1147 column=16 end_column=91}
33 {file_name_id=8 function_name_id=18 line=670 end_line=670 column=13 end_column=61}
34 {file_name_id=11 function_name_id=19 line=231 end_line=231 column=15 end_column=46}
35 {file_name_id=11 function_name_id=19 line=238 end_line=247 column=13 end_column=5}
36 {file_name_id=11 function_name_id=20 line=102 end_line=104 column=9 end_column=3}
37 {file_name_id=8 function_name_id=11 line=1197 end_line=1197 column=14 end_column=82}
38 {file_name_id=9 function_name_id=14 line=1866 end_line=1874 column=16 end_column=5}
39 {file_name_id=9 function_name_id=21 line=700 end_line=700 column=13 end_column=44}
40 {file_name_id=9 function_name_id=21 line=700 end_line=700 column=48 end_column=79}
41 {file_name_id=9 function_name_id=21 line=701 end_line=701 column=13 end_column=38}
42 {file_name_id=9 function_name_id=21 line=723 end_line=723 column=16 end_column=66}
43 {file_name_id=9 function_name_id=21 line=722 end_line=722 column=16 end_column=66}
44 {file_name_id=9 function_name_id=21 line=726 end_line=726 column=21 end_column=50}
45 {file_name_id=9 function_name_id=21 line=726 end_line=726 column=20 end_column=75}
46 {file_name_id=9 function_name_id=21 line=730 end_line=730 column=20 end_column=54}
47 {file_name_id=9 function_name_id=21 line=787 end_line=787 column=11 end_column=58}
48 {file_name_id=9 function_name_id=14 line=1906 end_line=1906 column=21 end_column=66}
49 {file_name_id=9 function_name_id=22 line=121 end_line=121 column=20 end_column=52}
50 {file_name_id=8 function_name_id=11 line=1143 end_line=1143 column=12 end_column=85}
51 {file_name_id=8 function_name_id=18 line=668 end_line=668 column=13 end_column=59}
52 {file_name_id=8 function_name_id=11 line=1174 end_line=1174 column=14 end_column=106}
53 {file_name_id=8 function_name_id=23 line=935 end_line=935 column=13 end_column=60}
54 {file_name_id=12 function_name_id=24 line=718 end_line=718 column=14 end_column=26}
55 {file_name_id=12 function_name_id=24 line=708 end_line=708 column=15 end_column=55}
56 {file_name_id=12 function_name_id=24 line=709 end_line=709 column=19 end_column=44}
57 {file_name_id=12 function_name_id=24 line=709 end_line=709 column=30 end_column=44}
58 {file_name_id=12 function_name_id=25 line=631 end_line=631 column=19 end_column=52}
59 {file_name_id=12 function_name_id=25 line=631 end_line=631 column=15 end_column=52}
60 {file_name_id=12 function_name_id=25 line=632 end_line=632 column=15 end_column=38}
61 {file_name_id=12 function_name_id=25 line=633 end_line=633 column=37 end_column=90}
62 {file_name_id=12 function_name_id=25 line=637 end_line=637 column=61 end_column=76}
63 {file_name_id=12 function_name_id=25 line=637 end_line=637 column=24 end_column=77}
64 {file_name_id=12 function_name_id=26 line=651 end_line=651 column=14 end_column=31}
65 {file_name_id=12 function_name_id=26 line=667 end_line=667 column=25 end_column=52}
66 {file_name_id=12 function_name_id=26 line=668 end_line=668 column=11 end_column=89}
67 {file_name_id=12 function_name_id=27 line=664 end_line=664 column=28 end_column=54}
68 {file_name_id=12 function_name_id=27 line=665 end_line=665 column=13 end_column=83}
69 {file_name_id=12 function_name_id=28 line=661 end_line=661 column=18 end_column=43}
70 {file_name_id=12 function_name_id=28 line=661 end_line=661 column=17 end_column=101}
71 {file_name_id=12 function_name_id=28 line=662 end_line=662 column=16 end_column=26}
72 {file_name_id=12 function_name_id=28 line=662 end_line=662 column=15 end_column=34}
73 {file_name_id=12 function_name_id=28 line=662 end_line=662 column=52 end_column=65}
74 {file_name_id=12 function_name_id=29 line=658 end_line=658 column=15 end_column=34}
75 {file_name_id=12 function_name_id=25 line=637 end_line=637 column=18 end_column=77}
76 {file_name_id=12 function_name_id=25 line=640 end_line=640 column=11 end_column=62}
77 {file_name_id=12 function_name_id=24 line=712 end_line=712 column=10 end_column=31}
78 {file_name_id=12 function_name_id=24 line=695 end_line=695 column=20 end_column=68}
79 {file_name_id=12 function_name_id=24 line=695 end_line=695 column=12 end_column=72}
80 {file_name_id=12 function_name_id=24 line=694 end_line=697 column=8 end_column=9}
81 {file_name_id=12 function_name_id=24 line=693 end_line=700 column=21 end_column=5}
82 {file_name_id=12 function_name_id=24 line=691 end_line=691 column=43 end_column=58}
83 {file_name_id=12 function_name_id=24 line=691 end_line=691 column=60 end_column=75}
84 {file_name_id=12 function_name_id=24 line=691 end_line=691 column=26 end_column=86}
85 {file_name_id=12 function_name_id=24 line=692 end_line=692 column=44 end_column=60}
86 {file_name_id=12 function_name_id=24 line=692 end_line=692 column=62 end_column=78}
87 {file_name_id=12 function_name_id=24 line=692 end_line=692 column=27 end_column=89}
88 {file_name_id=12 function_name_id=24 line=718 end_line=718 column=29 end_column=49}
89 {file_name_id=12 function_name_id=24 line=711 end_line=711 column=10 end_column=31}
90 {file_name_id=12 function_name_id=24 line=715 end_line=715 column=11 end_column=65}
91 {file_name_id=12 function_name_id=24 line=721 end_line=721 column=16 end_column=48}
92 {file_name_id=8 function_name_id=11 line=1196 end_line=1196 column=12 end_column=76}
93 {file_name_id=8 function_name_id=11 line=1124 end_line=1124 column=15 end_column=73}
94 {file_name_id=8 function_name_id=11 line=1142 end_line=1142 column=14 end_column=72}
95 {file_name_id=8 function_name_id=30 line=614 end_line=614 column=11 end_column=58}
96 {file_name_id=8 function_name_id=11 line=1172 end_line=1172 column=14 end_column=108}
97 {file_name_id=8 function_name_id=11 line=1195 end_line=1195 column=14 end_column=82}
98 {file_name_id=9 function_name_id=14 line=1850 end_line=1850 column=19 end_column=88}
99 {file_name_id=9 function_name_id=31 line=1957 end_line=1957 column=14 end_column=60}
100 {file_name_id=9 function_name_id=31 line=1960 end_line=1960 column=15 end_column=74}
101 {file_name_id=9 function_name_id=22 line=121 end_line=121 column=9 end_column=82}
102 {file_name_id=9 function_name_id=15 line=1761 end_line=1761 column=13 end_column=54}
103 {file_name_id=9 function_name_id=15 line=1771 end_line=1771 column=34 end_column=52}
104 {file_name_id=9 function_name_id=15 line=1771 end_line=1771 column=26 end_column=53}
105 {file_name_id=9 function_name_id=15 line=1776 end_line=1776 column=17 end_column=60}
106 {file_name_id=9 function_name_id=15 line=1780 end_line=1780 column=16 end_column=81}
107 {file_name_id=9 function_name_id=32 line=2010 end_line=2010 column=12 end_column=80}
108 {file_name_id=9 function_name_id=32 line=2012 end_line=2012 column=15 end_column=52}
109 {file_name_id=9 function_name_id=15 line=1778 end_line=1778 column=16 end_column=54}
110 {file_name_id=9 function_name_id=12 line=2128 end_line=2128 column=15 end_column=69}
111 {file_name_id=8 function_name_id=11 line=1239 end_line=1239 column=12 end_column=76}
112 {file_name_id=8 function_name_id=11 line=1247 end_line=1247 column=10 end_column=61}
113 {file_name_id=8 function_name_id=33 line=733 end_line=733 column=11 end_column=51}
114 {file_name_id=6 function_name_id=8 line=184 end_line=184 column=20 end_column=93}
115 {file_name_id=6 function_name_id=8 line=185 end_line=185 column=26 end_column=48}
116 {file_name_id=6 function_name_id=8 line=189 end_line=189 column=20 end_column=93}
117 {file_name_id=6 function_name_id=8 line=193 end_line=198 column=14 end_column=5}
118 {file_name_id=11 function_name_id=34 line=517 end_line=517 column=12 end_column=62}
119 {file_name_id=11 function_name_id=34 line=521 end_line=521 column=12 end_column=54}
120 {file_name_id=11 function_name_id=34 line=525 end_line=525 column=8 end_column=51}
121 {file_name_id=11 function_name_id=34 line=528 end_line=528 column=8 end_column=68}
122 {file_name_id=11 function_name_id=34 line=529 end_line=529 column=13 end_column=50}
123 {file_name_id=6 function_name_id=8 line=199 end_line=199 column=14 end_column=81}
124 {file_name_id=6 function_name_id=8 line=201 end_line=201 column=19 end_column=48}
125 {file_name_id=6 function_name_id=8 line=203 end_line=203 column=19 end_column=91}
126 {file_name_id=5 function_name_id=7 line=488 end_line=488 column=13 end_column=59}
127 {file_name_id=13 function_name_id=35 line=420 end_line=420 column=13 end_column=56}
128 {file_name_id=13 function_name_id=36 line=431 end_line=431 column=2 end_column=51}
129 {file_name_id=13 function_name_id=37 line=423 end_line=423 column=4 end_column=34}
130 {file_name_id=6 function_name_id=38 line=77 end_line=104 column=26 end_column=5}
131 {file_name_id=8 function_name_id=39 line=438 end_line=438 column=8 end_column=60}
132 {file_name_id=8 function_name_id=40 line=956 end_line=973 column=11 end_column=5}
133 {file_name_id=14 function_name_id=41 line=332 end_line=332 column=6 end_column=48}
134 {file_name_id=14 function_name_id=42 line=513 end_line=513 column=8 end_column=74}
135 {file_name_id=8 function_name_id=11 line=1224 end_line=1224 column=24 end_column=106}
136 {file_name_id=8 function_name_id=43 line=994 end_line=1001 column=36 end_column=5}
137 {file_name_id=14 function_name_id=44 line=957 end_line=957 column=15 end_column=69}
138 {file_name_id=14 function_name_id=45 line=699 end_line=699 column=27 end_column=76}
139 {file_name_id=14 function_name_id=45 line=700 end_line=700 column=29 end_column=80}
140 {file_name_id=15 function_name_id=46 line=198 end_line=199 column=11 end_column=42}
141 {file_name_id=15 function_name_id=47 line=88 end_line=88 column=4 end_column=27}
142 {file_name_id=16 function_name_id=48 line=245 end_line=245 column=2 end_column=15}
143 {file_name_id=17 function_name_id=49 line=410 end_line=410 column=6 end_column=27}
144 {file_name_id=17 function_name_id=50 line=355 end_line=355 column=13 end_column=23}
145 {file_name_id=16 function_name_id=51 line=181 end_line=194 column=36 end_column=7}
146 {file_name_id=1 function_name_id=52 line=913 end_line=934 column=11 end_column=5}
147 {file_name_id=3 function_name_id=4 line=1289 end_line=1289 column=15 end_column=96}
148 {file_name_id=3 function_name_id=53 line=795 end_line=802 column=8 end_column=40}
149 {file_name_id=1 function_name_id=1 line=831 end_line=838 column=28 end_column=5}
150 {file_name_id=18 function_name_id=54 line=135 end_line=135 column=11 end_column=38}
151 {file_name_id=3 function_name_id=4 line=872 end_line=879 column=8 end_column=5}
152 {file_name_id=3 function_name_id=55 line=706 end_line=706 column=8 end_column=85}
153 {file_name_id=12 function_name_id=56 line=155 end_line=158 column=16 end_column=5}
154 {file_name_id=1 function_name_id=1 line=747 end_line=747 column=19 end_column=52}
155 {file_name_id=12 function_name_id=56 line=182 end_line=182 column=15 end_column=66}
156 {file_name_id=4 function_name_id=5 line=150 end_line=150 column=9 end_column=66}
157 {file_name_id=4 function_name_id=57 line=126 end_line=126 column=11 end_column=44}
158 {file_name_id=4 function_name_id=58 line=124 end_line=124 column=13 end_column=35}
159 {file_name_id=1 function_name_id=1 line=766 end_line=766 column=17 end_column=83}
160 {file_name_id=1 function_name_id=1 line=767 end_line=767 column=19 end_column=48}
161 {file_name_id=1 function_name_id=1 line=768 end_line=768 column=19 end_column=68}
162 {file_name_id=1 function_name_id=1 line=769 end_line=769 column=25 end_column=57}
163 {file_name_id=1 function_name_id=1 line=753 end_line=753 column=34 end_column=100}
164 {file_name_id=1 function_name_id=1 line=753 end_line=753 column=18 end_column=104}
165 {file_name_id=3 function_name_id=53 line=831 end_line=844 column=15 end_column=7}
166 {file_name_id=3 function_name_id=53 line=847 end_line=847 column=15 end_column=41}
167 {file_name_id=1 function_name_id=1 line=824 end_line=824 column=12 end_column=27}
168 {file_name_id=1 function_name_id=1 line=822 end_line=826 column=22 end_column=5}
169 {file_name_id=1 function_name_id=1 line=827 end_line=827 column=22 end_column=97}
170 {file_name_id=1 function_name_id=1 line=865 end_line=865 column=17 end_column=68}
171 {file_name_id=1 function_name_id=1 line=846 end_line=846 column=13 end_column=90}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=1}
7 {file_location_id=7 parent_frame_id=7}
8 {file_location_id=8 parent_frame_id=8}
9 {file_location_id=9 parent_frame_id=9}
10 {file_location_id=10 parent_frame_id=10}
11 {file_location_id=11 parent_frame_id=8}
12 {file_location_id=9 parent_frame_id=12}
13 {file_location_id=12 parent_frame_id=13}
14 {file_location_id=9 parent_frame_id=14}
15 {file_location_id=13 parent_frame_id=15}
16 {file_location_id=14 parent_frame_id=16}
17 {file_location_id=15 parent_frame_id=17}
18 {file_location_id=16 parent_frame_id=18}
19 {file_location_id=17 parent_frame_id=18}
20 {file_location_id=18 parent_frame_id=8}
21 {file_location_id=9 parent_frame_id=21}
22 {file_location_id=10 parent_frame_id=22}
23 {file_location_id=19 parent_frame_id=22}
24 {file_location_id=20 parent_frame_id=8}
25 {file_location_id=21 parent_frame_id=25}
26 {file_location_id=22 parent_frame_id=26}
27 {file_location_id=19 parent_frame_id=10}
28 {file_location_id=23 parent_frame_id=10}
29 {file_location_id=24 parent_frame_id=10}
30 {file_location_id=25 parent_frame_id=10}
31 {file_location_id=26 parent_frame_id=10}
32 {file_location_id=27 parent_frame_id=10}
33 {file_location_id=28 parent_frame_id=10}
34 {file_location_id=29 parent_frame_id=10}
35 {file_location_id=30 parent_frame_id=8}
36 {file_location_id=21 parent_frame_id=36}
37 {file_location_id=22 parent_frame_id=37}
38 {file_location_id=31 parent_frame_id=13}
39 {file_location_id=21 parent_frame_id=39}
40 {file_location_id=22 parent_frame_id=40}
41 {file_location_id=32 parent_frame_id=13}
42 {file_location_id=33 parent_frame_id=42}
43 {file_location_id=9 parent_frame_id=43}
44 {file_location_id=34 parent_frame_id=44}
45 {file_location_id=35 parent_frame_id=44}
46 {file_location_id=36 parent_frame_id=46}
47 {file_location_id=37 parent_frame_id=13}
48 {file_location_id=21 parent_frame_id=48}
49 {file_location_id=22 parent_frame_id=49}
50 {file_location_id=38 parent_frame_id=17}
51 {file_location_id=39 parent_frame_id=51}
52 {file_location_id=40 parent_frame_id=51}
53 {file_location_id=41 parent_frame_id=51}
54 {file_location_id=42 parent_frame_id=51}
55 {file_location_id=43 parent_frame_id=51}
56 {file_location_id=44 parent_frame_id=51}
57 {file_location_id=45 parent_frame_id=51}
58 {file_location_id=46 parent_frame_id=51}
59 {file_location_id=47 parent_frame_id=51}
60 {file_location_id=48 parent_frame_id=17}
61 {file_location_id=49 parent_frame_id=61}
62 {file_location_id=50 parent_frame_id=13}
63 {file_location_id=51 parent_frame_id=63}
64 {file_location_id=9 parent_frame_id=64}
65 {file_location_id=34 parent_frame_id=65}
66 {file_location_id=35 parent_frame_id=65}
67 {file_location_id=36 parent_frame_id=67}
68 {file_location_id=52 parent_frame_id=13}
69 {file_location_id=53 parent_frame_id=69}
70 {file_location_id=9 parent_frame_id=70}
71 {file_location_id=54 parent_frame_id=71}
72 {file_location_id=55 parent_frame_id=71}
73 {file_location_id=56 parent_frame_id=71}
74 {file_location_id=57 parent_frame_id=71}
75 {file_location_id=58 parent_frame_id=75}
76 {file_location_id=59 parent_frame_id=75}
77 {file_location_id=60 parent_frame_id=75}
78 {file_location_id=61 parent_frame_id=75}
79 {file_location_id=62 parent_frame_id=75}
80 {file_location_id=63 parent_frame_id=75}
81 {file_location_id=64 parent_frame_id=81}
82 {file_location_id=65 parent_frame_id=81}
83 {file_location_id=66 parent_frame_id=81}
84 {file_location_id=67 parent_frame_id=7}
85 {file_location_id=68 parent_frame_id=7}
86 {file_location_id=69 parent_frame_id=7}
87 {file_location_id=70 parent_frame_id=7}
88 {file_location_id=71 parent_frame_id=7}
89 {file_location_id=72 parent_frame_id=7}
90 {file_location_id=73 parent_frame_id=7}
91 {file_location_id=74 parent_frame_id=7}
92 {file_location_id=75 parent_frame_id=75}
93 {file_location_id=76 parent_frame_id=75}
94 {file_location_id=77 parent_frame_id=71}
95 {file_location_id=78 parent_frame_id=71}
96 {file_location_id=79 parent_frame_id=71}
97 {file_location_id=80 parent_frame_id=71}
98 {file_location_id=81 parent_frame_id=71}
99 {file_location_id=82 parent_frame_id=71}
100 {file_location_id=83 parent_frame_id=71}
101 {file_location_id=84 parent_frame_id=71}
102 {file_location_id=85 parent_frame_id=71}
103 {file_location_id=86 parent_frame_id=71}
104 {file_location_id=87 parent_frame_id=71}
105 {file_location_id=88 parent_frame_id=71}
106 {file_location_id=89 parent_frame_id=71}
107 {file_location_id=90 parent_frame_id=71}
108 {file_location_id=91 parent_frame_id=71}
109 {file_location_id=92 parent_frame_id=13}
110 {file_location_id=21 parent_frame_id=110}
111 {file_location_id=22 parent_frame_id=111}
112 {file_location_id=93 parent_frame_id=13}
113 {file_location_id=21 parent_frame_id=113}
114 {file_location_id=22 parent_frame_id=114}
115 {file_location_id=94 parent_frame_id=13}
116 {file_location_id=95 parent_frame_id=116}
117 {file_location_id=9 parent_frame_id=117}
118 {file_location_id=34 parent_frame_id=118}
119 {file_location_id=35 parent_frame_id=118}
120 {file_location_id=36 parent_frame_id=120}
121 {file_location_id=96 parent_frame_id=13}
122 {file_location_id=53 parent_frame_id=122}
123 {file_location_id=9 parent_frame_id=123}
124 {file_location_id=54 parent_frame_id=124}
125 {file_location_id=55 parent_frame_id=124}
126 {file_location_id=56 parent_frame_id=124}
127 {file_location_id=57 parent_frame_id=124}
128 {file_location_id=58 parent_frame_id=128}
129 {file_location_id=59 parent_frame_id=128}
130 {file_location_id=60 parent_frame_id=128}
131 {file_location_id=61 parent_frame_id=128}
132 {file_location_id=62 parent_frame_id=128}
133 {file_location_id=63 parent_frame_id=128}
134 {file_location_id=64 parent_frame_id=134}
135 {file_location_id=65 parent_frame_id=134}
136 {file_location_id=66 parent_frame_id=134}
137 {file_location_id=75 parent_frame_id=128}
138 {file_location_id=76 parent_frame_id=128}
139 {file_location_id=77 parent_frame_id=124}
140 {file_location_id=78 parent_frame_id=124}
141 {file_location_id=79 parent_frame_id=124}
142 {file_location_id=80 parent_frame_id=124}
143 {file_location_id=81 parent_frame_id=124}
144 {file_location_id=82 parent_frame_id=124}
145 {file_location_id=83 parent_frame_id=124}
146 {file_location_id=84 parent_frame_id=124}
147 {file_location_id=85 parent_frame_id=124}
148 {file_location_id=86 parent_frame_id=124}
149 {file_location_id=87 parent_frame_id=124}
150 {file_location_id=88 parent_frame_id=124}
151 {file_location_id=89 parent_frame_id=124}
152 {file_location_id=90 parent_frame_id=124}
153 {file_location_id=91 parent_frame_id=124}
154 {file_location_id=97 parent_frame_id=13}
155 {file_location_id=21 parent_frame_id=155}
156 {file_location_id=22 parent_frame_id=156}
157 {file_location_id=98 parent_frame_id=17}
158 {file_location_id=99 parent_frame_id=158}
159 {file_location_id=100 parent_frame_id=158}
160 {file_location_id=101 parent_frame_id=61}
161 {file_location_id=102 parent_frame_id=18}
162 {file_location_id=103 parent_frame_id=18}
163 {file_location_id=104 parent_frame_id=18}
164 {file_location_id=105 parent_frame_id=18}
165 {file_location_id=106 parent_frame_id=18}
166 {file_location_id=107 parent_frame_id=166}
167 {file_location_id=108 parent_frame_id=166}
168 {file_location_id=109 parent_frame_id=18}
169 {file_location_id=110 parent_frame_id=15}
170 {file_location_id=111 parent_frame_id=13}
171 {file_location_id=21 parent_frame_id=171}
172 {file_location_id=22 parent_frame_id=172}
173 {file_location_id=112 parent_frame_id=13}
174 {file_location_id=113 parent_frame_id=174}
175 {file_location_id=9 parent_frame_id=175}
176 {file_location_id=34 parent_frame_id=176}
177 {file_location_id=35 parent_frame_id=176}
178 {file_location_id=36 parent_frame_id=178}
179 {file_location_id=114 parent_frame_id=8}
180 {file_location_id=21 parent_frame_id=180}
181 {file_location_id=22 parent_frame_id=181}
182 {file_location_id=115 parent_frame_id=8}
183 {file_location_id=23 parent_frame_id=22}
184 {file_location_id=24 parent_frame_id=22}
185 {file_location_id=25 parent_frame_id=22}
186 {file_location_id=26 parent_frame_id=22}
187 {file_location_id=27 parent_frame_id=22}
188 {file_location_id=28 parent_frame_id=22}
189 {file_location_id=29 parent_frame_id=22}
190 {file_location_id=116 parent_frame_id=8}
191 {file_location_id=21 parent_frame_id=191}
192 {file_location_id=22 parent_frame_id=192}
193 {file_location_id=117 parent_frame_id=8}
194 {file_location_id=9 parent_frame_id=194}
195 {file_location_id=118 parent_frame_id=195}
196 {file_location_id=9 parent_frame_id=196}
197 {file_location_id=34 parent_frame_id=197}
198 {file_location_id=35 parent_frame_id=197}
199 {file_location_id=36 parent_frame_id=199}
200 {file_location_id=119 parent_frame_id=195}
201 {file_location_id=120 parent_frame_id=195}
202 {file_location_id=121 parent_frame_id=195}
203 {file_location_id=21 parent_frame_id=203}
204 {file_location_id=22 parent_frame_id=204}
205 {file_location_id=122 parent_frame_id=195}
206 {file_location_id=9 parent_frame_id=206}
207 {file_location_id=34 parent_frame_id=207}
208 {file_location_id=35 parent_frame_id=207}
209 {file_location_id=36 parent_frame_id=209}
210 {file_location_id=123 parent_frame_id=8}
211 {file_location_id=21 parent_frame_id=211}
212 {file_location_id=22 parent_frame_id=212}
213 {file_location_id=124 parent_frame_id=8}
214 {file_location_id=125 parent_frame_id=8}
215 {file_location_id=21 parent_frame_id=215}
216 {file_location_id=22 parent_frame_id=216}
217 {file_location_id=126 parent_frame_id=7}
218 {file_location_id=127 parent_frame_id=218}
219 {file_location_id=128 parent_frame_id=219}
220 {file_location_id=129 parent_frame_id=220}
221 {file_location_id=130 parent_frame_id=221}
222 {file_location_id=127 parent_frame_id=222}
223 {file_location_id=128 parent_frame_id=223}
224 {file_location_id=129 parent_frame_id=224}
225 {file_location_id=131 parent_frame_id=225}
226 {file_location_id=132 parent_frame_id=226}
227 {file_location_id=127 parent_frame_id=227}
228 {file_location_id=128 parent_frame_id=228}
229 {file_location_id=129 parent_frame_id=229}
230 {file_location_id=133 parent_frame_id=230}
231 {file_location_id=134 parent_frame_id=231}
232 {file_location_id=135 parent_frame_id=13}
233 {file_location_id=136 parent_frame_id=233}
234 {file_location_id=9 parent_frame_id=234}
235 {file_location_id=137 parent_frame_id=235}
236 {file_location_id=138 parent_frame_id=236}
237 {file_location_id=139 parent_frame_id=236}
238 {file_location_id=140 parent_frame_id=1}
239 {file_location_id=141 parent_frame_id=239}
240 {file_location_id=142 parent_frame_id=240}
241 {file_location_id=143 parent_frame_id=241}
242 {file_location_id=144 parent_frame_id=242}
243 {file_location_id=145 parent_frame_id=243}
244 {file_location_id=146 parent_frame_id=244}
245 {file_location_id=1 parent_frame_id=245}
246 {file_location_id=2 parent_frame_id=246}
247 {file_location_id=3 parent_frame_id=247}
248 {file_location_id=4 parent_frame_id=248}
249 {file_location_id=5 parent_frame_id=249}
250 {file_location_id=1 parent_frame_id=250}
251 {file_location_id=2 parent_frame_id=251}
252 {file_location_id=3 parent_frame_id=252}
253 {file_location_id=4 parent_frame_id=253}
254 {file_location_id=5 parent_frame_id=254}
255 {file_location_id=1 parent_frame_id=255}
256 {file_location_id=2 parent_frame_id=256}
257 {file_location_id=3 parent_frame_id=257}
258 {file_location_id=4 parent_frame_id=258}
259 {file_location_id=5 parent_frame_id=259}
260 {file_location_id=147 parent_frame_id=248}
261 {file_location_id=148 parent_frame_id=261}
262 {file_location_id=7 parent_frame_id=262}
263 {file_location_id=10 parent_frame_id=263}
264 {file_location_id=149 parent_frame_id=1}
265 {file_location_id=150 parent_frame_id=265}
266 {file_location_id=149 parent_frame_id=266}
267 {file_location_id=150 parent_frame_id=267}
268 {file_location_id=151 parent_frame_id=248}
269 {file_location_id=152 parent_frame_id=269}
270 {file_location_id=7 parent_frame_id=270}
271 {file_location_id=153 parent_frame_id=271}
272 {file_location_id=154 parent_frame_id=245}
273 {file_location_id=155 parent_frame_id=271}
274 {file_location_id=156 parent_frame_id=249}
275 {file_location_id=157 parent_frame_id=275}
276 {file_location_id=158 parent_frame_id=276}
277 {file_location_id=159 parent_frame_id=245}
278 {file_location_id=160 parent_frame_id=245}
279 {file_location_id=161 parent_frame_id=245}
280 {file_location_id=162 parent_frame_id=245}
281 {file_location_id=163 parent_frame_id=245}
282 {file_location_id=164 parent_frame_id=245}
283 {file_location_id=19 parent_frame_id=263}
284 {file_location_id=23 parent_frame_id=263}
285 {file_location_id=24 parent_frame_id=263}
286 {file_location_id=25 parent_frame_id=263}
287 {file_location_id=26 parent_frame_id=263}
288 {file_location_id=27 parent_frame_id=263}
289 {file_location_id=28 parent_frame_id=263}
290 {file_location_id=29 parent_frame_id=263}
291 {file_location_id=165 parent_frame_id=261}
292 {file_location_id=7 parent_frame_id=292}
293 {file_location_id=34 parent_frame_id=293}
294 {file_location_id=35 parent_frame_id=293}
295 {file_location_id=36 parent_frame_id=295}
296 {file_location_id=166 parent_frame_id=261}
297 {file_location_id=167 parent_frame_id=245}
298 {file_location_id=168 parent_frame_id=245}
299 {file_location_id=169 parent_frame_id=245}
300 {file_location_id=170 parent_frame_id=245}
301 {file_location_id=149 parent_frame_id=245}
302 {file_location_id=150 parent_frame_id=302}
303 {file_location_id=171 parent_frame_id=245}


%dynamic_index_in_dim.1 (Arg_0.1: f32[32,4096,14336], Arg_1.1: s32[]) -> f32[4096,14336] {
  %Arg_0.1 = f32[32,4096,14336]{2,1,0} parameter(0)
  %Arg_1.1 = s32[] parameter(1)
  %constant.19 = s32[] constant(0)
  %dynamic_slice.1 = f32[1,4096,14336]{2,1,0} dynamic-slice(%Arg_0.1, %Arg_1.1, %constant.19, %constant.19), dynamic_slice_sizes={1,4096,14336}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.1 = f32[4096,14336]{1,0} reshape(%dynamic_slice.1), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_0.2 (Arg_0.3: f32[32,14336,4096], Arg_1.3: s32[]) -> f32[14336,4096] {
  %Arg_0.3 = f32[32,14336,4096]{2,1,0} parameter(0)
  %Arg_1.3 = s32[] parameter(1)
  %constant.21 = s32[] constant(0)
  %dynamic_slice.3 = f32[1,14336,4096]{2,1,0} dynamic-slice(%Arg_0.3, %Arg_1.3, %constant.21, %constant.21), dynamic_slice_sizes={1,14336,4096}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.3 = f32[14336,4096]{1,0} reshape(%dynamic_slice.3), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_1.3 (Arg_0.5: f32[32,4096], Arg_1.5: s32[]) -> f32[4096] {
  %Arg_0.5 = f32[32,4096]{1,0} parameter(0)
  %Arg_1.5 = s32[] parameter(1)
  %constant.23 = s32[] constant(0)
  %dynamic_slice.5 = f32[1,4096]{1,0} dynamic-slice(%Arg_0.5, %Arg_1.5, %constant.23), dynamic_slice_sizes={1,4096}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.5 = f32[4096]{0} reshape(%dynamic_slice.5), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_2.4 (Arg_0.7: f32[32,4096,8,128], Arg_1.7: s32[]) -> f32[4096,8,128] {
  %Arg_0.7 = f32[32,4096,8,128]{3,2,1,0} parameter(0)
  %Arg_1.7 = s32[] parameter(1)
  %constant.25 = s32[] constant(0)
  %dynamic_slice.7 = f32[1,4096,8,128]{3,2,1,0} dynamic-slice(%Arg_0.7, %Arg_1.7, %constant.25, %constant.25, %constant.25), dynamic_slice_sizes={1,4096,8,128}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.7 = f32[4096,8,128]{2,1,0} reshape(%dynamic_slice.7), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_3.5 (Arg_0.9: f32[32,32,128,4096], Arg_1.9: s32[]) -> f32[32,128,4096] {
  %Arg_0.9 = f32[32,32,128,4096]{3,2,1,0} parameter(0)
  %Arg_1.9 = s32[] parameter(1)
  %constant.27 = s32[] constant(0)
  %dynamic_slice.9 = f32[1,32,128,4096]{3,2,1,0} dynamic-slice(%Arg_0.9, %Arg_1.9, %constant.27, %constant.27, %constant.27), dynamic_slice_sizes={1,32,128,4096}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.9 = f32[32,128,4096]{2,1,0} reshape(%dynamic_slice.9), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_4.6 (Arg_0.11: f32[32,4096,32,128], Arg_1.11: s32[]) -> f32[4096,32,128] {
  %Arg_0.11 = f32[32,4096,32,128]{3,2,1,0} parameter(0)
  %Arg_1.11 = s32[] parameter(1)
  %constant.29 = s32[] constant(0)
  %dynamic_slice.11 = f32[1,4096,32,128]{3,2,1,0} dynamic-slice(%Arg_0.11, %Arg_1.11, %constant.29, %constant.29, %constant.29), dynamic_slice_sizes={1,4096,32,128}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.11 = f32[4096,32,128]{2,1,0} reshape(%dynamic_slice.11), metadata={op_name="squeeze" stack_frame_id=5}
}

%region_1.7 (reduce_sum.3: f32[], reduce_sum.4: f32[]) -> f32[] {
  %reduce_sum.3 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.4 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.5 = f32[] add(%reduce_sum.3, %reduce_sum.4), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=10}
}

%_where_5.10 (Arg_0.18: pred[1,1,1,64,64], Arg_1.18: f32[], Arg_2.4: f32[]) -> f32[1,1,1,64,64] {
  %Arg_0.18 = pred[1,1,1,64,64]{4,3,2,1,0} parameter(0)
  %Arg_1.18 = f32[] parameter(1)
  %broadcast_in_dim.24 = f32[1,1,1,64,64]{4,3,2,1,0} broadcast(%Arg_1.18), dimensions={}, metadata={op_name="broadcast_in_dim"}
  %Arg_2.4 = f32[] parameter(2)
  %broadcast_in_dim.25 = f32[1,1,1,64,64]{4,3,2,1,0} broadcast(%Arg_2.4), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.20 = f32[1,1,1,64,64]{4,3,2,1,0} select(%Arg_0.18, %broadcast_in_dim.24, %broadcast_in_dim.25), metadata={op_name="select_n"}
}

%_where.8 (Arg_0.15: pred[], Arg_1.15: s32[], Arg_2.2: s32[]) -> s32[] {
  %Arg_0.15 = pred[] parameter(0)
  %Arg_1.15 = s32[] parameter(1)
  %Arg_2.2 = s32[] parameter(2)
  ROOT %select_n.4 = s32[] select(%Arg_0.15, %Arg_1.15, %Arg_2.2), metadata={op_name="select_n"}
}

%remainder.9 (Arg_0.16: s32[128], Arg_1.16: s32[]) -> s32[128] {
  %Arg_0.16 = s32[128]{0} parameter(0)
  %Arg_1.16 = s32[] parameter(1)
  %constant.57 = s32[] constant(0)
  %eq.1 = pred[] compare(%Arg_1.16, %constant.57), direction=EQ, metadata={op_name="eq"}
  %constant.56 = s32[] constant(1)
  %jit__where_.1 = s32[] call(%eq.1, %constant.56, %Arg_1.16), to_apply=%_where.8, metadata={op_name="jit(_where)"}
  %rem.2 = s32[128]{0} broadcast(%jit__where_.1), dimensions={}, metadata={op_name="rem"}
  %rem.3 = s32[128]{0} remainder(%Arg_0.16, %rem.2), metadata={op_name="rem"}
  %constant.55 = s32[] constant(0)
  %broadcast.17 = s32[128]{0} broadcast(%constant.55), dimensions={}
  %lt.6 = pred[128]{0} compare(%rem.3, %broadcast.17), direction=LT, metadata={op_name="lt"}
  %lt.7 = pred[] compare(%jit__where_.1, %constant.57), direction=LT, metadata={op_name="lt"}
  %ne.4 = pred[128]{0} broadcast(%lt.7), dimensions={}, metadata={op_name="ne"}
  %ne.5 = pred[128]{0} compare(%lt.6, %ne.4), direction=NE, metadata={op_name="ne"}
  %ne.3 = pred[128]{0} compare(%rem.3, %broadcast.17), direction=NE, metadata={op_name="ne"}
  %and.1 = pred[128]{0} and(%ne.5, %ne.3), metadata={op_name="and"}
  %add.6 = s32[128]{0} broadcast(%jit__where_.1), dimensions={}, metadata={op_name="add"}
  %add.7 = s32[128]{0} add(%rem.3, %add.6), metadata={op_name="add"}
  ROOT %select_n.6 = s32[128]{0} select(%and.1, %add.7, %rem.3), metadata={op_name="select_n"}
}

%_where_6.11 (Arg_0.20: pred[1,1,1,64,64], Arg_1.20: bf16[1,8,4,64,64], Arg_2.6: f32[]) -> bf16[1,8,4,64,64] {
  %Arg_0.20 = pred[1,1,1,64,64]{4,3,2,1,0} parameter(0)
  %broadcast_in_dim.30 = pred[1,1,1,64,64]{4,3,2,1,0} broadcast(%Arg_0.20), dimensions={0,1,2,3,4}, metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.31 = pred[1,64,64]{2,1,0} reshape(%broadcast_in_dim.30), metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.32 = pred[1,8,4,64,64]{4,3,2,1,0} broadcast(%broadcast_in_dim.31), dimensions={0,3,4}, metadata={op_name="broadcast_in_dim"}
  %Arg_1.20 = bf16[1,8,4,64,64]{4,3,2,1,0} parameter(1)
  %Arg_2.6 = f32[] parameter(2)
  %convert_element_type.25 = bf16[] convert(%Arg_2.6), metadata={op_name="convert_element_type"}
  %broadcast_in_dim.33 = bf16[1,8,4,64,64]{4,3,2,1,0} broadcast(%convert_element_type.25), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.22 = bf16[1,8,4,64,64]{4,3,2,1,0} select(%broadcast_in_dim.32, %Arg_1.20, %broadcast_in_dim.33), metadata={op_name="select_n"}
}

%region_2.12 (reduce_max.3: bf16[], reduce_max.4: bf16[]) -> bf16[] {
  %reduce_max.3 = bf16[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.4 = bf16[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.5 = bf16[] maximum(%reduce_max.3, %reduce_max.4), metadata={op_name="checkpoint/layers/reduce_max" stack_frame_id=18}
}

%region_3.13 (reduce_sum.10: f32[], reduce_sum.11: f32[]) -> f32[] {
  %reduce_sum.10 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.11 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.12 = f32[] add(%reduce_sum.10, %reduce_sum.11), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=19}
}

%region_4.14 (reduce_sum.17: f32[], reduce_sum.18: f32[]) -> f32[] {
  %reduce_sum.17 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.18 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.19 = f32[] add(%reduce_sum.17, %reduce_sum.18), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=22}
}

%silu.15 (Arg_0.22: bf16[1,64,14336]) -> bf16[1,64,14336] {
  %Arg_0.22 = bf16[1,64,14336]{2,1,0} parameter(0)
  %constant.59 = bf16[] constant(1)
  %broadcast.19 = bf16[1,64,14336]{2,1,0} broadcast(%constant.59), dimensions={}
  %neg.1 = bf16[1,64,14336]{2,1,0} negate(%Arg_0.22), metadata={op_name="neg"}
  %exp.2 = bf16[1,64,14336]{2,1,0} exponential(%neg.1), metadata={op_name="exp"}
  %add.15 = bf16[1,64,14336]{2,1,0} add(%exp.2, %broadcast.19), metadata={op_name="add"}
  %div.38 = bf16[1,64,14336]{2,1,0} divide(%broadcast.19, %add.15), metadata={op_name="div"}
  ROOT %mul.39 = bf16[1,64,14336]{2,1,0} multiply(%Arg_0.22, %div.38), metadata={op_name="mul"}
}

%closed_call.16 (Arg_0.23: s32[2], Arg_1.21: s32[2], Arg_2.7: s32[1,64], Arg_3.1: s32[1,64], Arg_4.1: bf16[1,64,4096], Arg_5.1: f32[4096,14336], Arg_6.1: f32[4096,14336], Arg_7.1: f32[14336,4096], Arg_8.1: f32[4096], Arg_9.1: f32[4096], Arg_10.1: f32[4096,8,128], Arg_11.1: f32[32,128,4096], Arg_12.1: f32[4096,32,128], Arg_13.1: f32[4096,8,128]) -> (bf16[1,64,4096], s32[1], s32[1,1984], s32[1,64], bf16[1984,8,1,128], /*index=5*/s32[1], bf16[1984,8,1,128], bf16[64,8,1,128], bf16[64,8,1,128]) {
  %Arg_8.1 = f32[4096]{0} parameter(8)
  %convert_element_type.62 = bf16[4096]{0} convert(%Arg_8.1), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=23}
  %Arg_4.1 = bf16[1,64,4096]{2,1,0} parameter(4)
  %sharding_constraint.13 = bf16[1,64,4096]{2,1,0} custom-call(%Arg_4.1), custom_call_target="Sharding", sharding={devices=[1,1,8]<=[8]}, frontend_attributes={xla.sdy.sharding="#sdy.sharding_per_value<[<@mesh, [{}, {}, {\"tensor\"}]>]>"}, metadata={op_name="checkpoint/layers/sharding_constraint" stack_frame_id=26}
  %Arg_9.1 = f32[4096]{0} parameter(9)
  %convert_element_type.37 = bf16[4096]{0} convert(%Arg_9.1), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=27}
  %convert_element_type.35 = f32[1,64,4096]{2,1,0} convert(%sharding_constraint.13), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=28}
  %square.2 = f32[1,64,4096]{2,1,0} multiply(%convert_element_type.35, %convert_element_type.35), metadata={op_name="checkpoint/layers/square" stack_frame_id=29}
  %constant.78 = f32[] constant(0)
  %reduce_sum.21 = f32[1,64]{1,0} reduce(%square.2, %constant.78), dimensions={2}, to_apply=%region_1.7, metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=10}
  %broadcast_in_dim.38 = f32[1,64,1]{2,1,0} reshape(%reduce_sum.21), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=10}
  %constant.74 = f32[] constant(4096)
  %broadcast.31 = f32[1,64,1]{2,1,0} broadcast(%constant.74), dimensions={}
  %div.39 = f32[1,64,1]{2,1,0} divide(%broadcast_in_dim.38, %broadcast.31), metadata={op_name="checkpoint/layers/div" stack_frame_id=10}
  %constant.73 = f32[] constant(1e-05)
  %broadcast.30 = f32[1,64,1]{2,1,0} broadcast(%constant.73), dimensions={}
  %add.17 = f32[1,64,1]{2,1,0} add(%div.39, %broadcast.30), metadata={op_name="checkpoint/layers/add" stack_frame_id=30}
  %rsqrt.2 = f32[1,64,1]{2,1,0} rsqrt(%add.17), metadata={op_name="checkpoint/layers/rsqrt" stack_frame_id=31}
  %mul.41 = f32[1,64,1]{2,1,0} broadcast(%rsqrt.2), dimensions={0,1,2}, metadata={op_name="checkpoint/layers/mul" stack_frame_id=32}
  %mul.42 = f32[1,64]{1,0} reshape(%mul.41), metadata={op_name="checkpoint/layers/mul" stack_frame_id=32}
  %mul.43 = f32[1,64,4096]{2,1,0} broadcast(%mul.42), dimensions={0,1}, metadata={op_name="checkpoint/layers/mul" stack_frame_id=32}
  %mul.44 = f32[1,64,4096]{2,1,0} multiply(%convert_element_type.35, %mul.43), metadata={op_name="checkpoint/layers/mul" stack_frame_id=32}
  %convert_element_type.36 = bf16[1,64,4096]{2,1,0} convert(%mul.44), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=33}
  %dot_general.11 = bf16[4096,1,64]{2,1,0} dot(%convert_element_type.37, %convert_element_type.36), lhs_batch_dims={0}, lhs_contracting_dims={}, rhs_batch_dims={2}, rhs_contracting_dims={}, metadata={op_name="checkpoint/layers/...k,k->...k/dot_general" stack_frame_id=34}
  %transpose.16 = bf16[1,64,4096]{1,0,2} transpose(%dot_general.11), dimensions={1,2,0}, metadata={op_name="checkpoint/layers/...k,k->...k/transpose" stack_frame_id=34}
  %sharding_constraint.14 = bf16[1,64,4096]{2,1,0} custom-call(%transpose.16), custom_call_target="Sharding", sharding={devices=[1,1,8]<=[8]}, frontend_attributes={xla.sdy.sharding="#sdy.sharding_per_value<[<@mesh, [{}, {}, {\"tensor\"}]>]>"}, metadata={op_name="checkpoint/layers/sharding_constraint" stack_frame_id=37}
  %sharding_constraint.16 = bf16[1,64,4096]{2,1,0} custom-call(%sharding_constraint.14), custom_call_target="Sharding", sharding={devices=[1,1,8]<=[8]}, frontend_attributes={xla.sdy.sharding="#sdy.sharding_per_value<[<@mesh, [{}, {}, {\"tensor\"}]>]>"}, metadata={op_name="checkpoint/layers/sharding_constraint" stack_frame_id=40}
  %Arg_13.1 = f32[4096,8,128]{2,1,0} parameter(13)
  %convert_element_type.40 = bf16[4096,8,128]{2,1,0} convert(%Arg_13.1), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=44}
  %dot_general.14 = bf16[1,64,8,128]{3,2,1,0} dot(%sharding_constraint.16, %convert_element_type.40), lhs_contracting_dims={2}, rhs_contracting_dims={0}, metadata={op_name="checkpoint/layers/dot_general" stack_frame_id=46}
  %sharding_constraint.19 = bf16[1,64,8,128]{3,2,1,0} custom-call(%dot_general.14), custom_call_target="Sharding", sharding={devices=[1,1,8,1]<=[8]}, frontend_attributes={xla.sdy.sharding="#sdy.sharding_per_value<[<@mesh, [{}, {}, {\"tensor\"}, {}]>]>"}, metadata={op_name="checkpoint/layers/sharding_constraint" stack_frame_id=49}
  %Arg_2.7 = s32[1,64]{1,0} parameter(2)
  %broadcast_in_dim.49 = s32[1,64,1]{2,1,0} reshape(%Arg_2.7), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=51}
  %eq.9 = s32[1,64,1]{2,1,0} broadcast(%broadcast_in_dim.49), dimensions={0,1,2}, metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %eq.10 = s32[1,64]{1,0} reshape(%eq.9), metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %eq.11 = s32[1,64,64]{2,1,0} broadcast(%eq.10), dimensions={0,1}, metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %broadcast_in_dim.50 = s32[1,1,64]{2,1,0} reshape(%Arg_2.7), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=52}
  %eq.12 = s32[1,1,64]{2,1,0} broadcast(%broadcast_in_dim.50), dimensions={0,1,2}, metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %eq.13 = s32[1,64]{1,0} reshape(%eq.12), metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %eq.14 = s32[1,64,64]{2,1,0} broadcast(%eq.13), dimensions={0,2}, metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %eq.15 = pred[1,64,64]{2,1,0} compare(%eq.11, %eq.14), direction=EQ, metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %broadcast_in_dim.51 = pred[1,1,1,64,64]{4,3,2,1,0} reshape(%eq.15), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=53}
  %iota.16 = s32[64]{0} iota(), iota_dimension=0, metadata={op_name="checkpoint/layers/iota" stack_frame_id=54}
  %iota.17 = s32[64,64]{1,0} broadcast(%iota.16), dimensions={1}, metadata={op_name="checkpoint/layers/iota" stack_frame_id=54}
  %iota.14 = s32[64]{0} iota(), iota_dimension=0, metadata={op_name="checkpoint/layers/iota" stack_frame_id=55}
  %iota.15 = s32[64,64]{1,0} broadcast(%iota.14), dimensions={0}, metadata={op_name="checkpoint/layers/iota" stack_frame_id=55}
  %le.1 = pred[64,64]{1,0} compare(%iota.17, %iota.15), direction=LE, metadata={op_name="checkpoint/layers/le" stack_frame_id=56}
  %broadcast_in_dim.52 = pred[1,1,1,64,64]{4,3,2,1,0} reshape(%le.1), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=57}
  %and.3 = pred[1,1,1,64,64]{4,3,2,1,0} and(%broadcast_in_dim.51, %broadcast_in_dim.52), metadata={op_name="checkpoint/layers/and" stack_frame_id=58}
  %constant.76 = f32[] constant(-2.38197633e+38)
  %jit__where_.4 = f32[1,1,1,64,64]{4,3,2,1,0} call(%and.3, %constant.78, %constant.76), to_apply=%_where_5.10, metadata={op_name="checkpoint/layers/jit(_where)" stack_frame_id=59}
  %constant.60 = f32[] constant(-1.19098816e+38)
  %ge.2 = f32[1,1,1,64,64]{4,3,2,1,0} broadcast(%constant.60), dimensions={}, metadata={op_name="checkpoint/layers/ge" stack_frame_id=61}
  %ge.3 = pred[1,1,1,64,64]{4,3,2,1,0} compare(%jit__where_.4, %ge.2), direction=GE, metadata={op_name="checkpoint/layers/ge" stack_frame_id=61}
  %Arg_10.1 = f32[4096,8,128]{2,1,0} parameter(10)
  %convert_element_type.39 = bf16[4096,8,128]{2,1,0} convert(%Arg_10.1), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=65}
  %dot_general.13 = bf16[1,64,8,128]{3,2,1,0} dot(%sharding_constraint.16, %convert_element_type.39), lhs_contracting_dims={2}, rhs_contracting_dims={0}, metadata={op_name="checkpoint/layers/dot_general" stack_frame_id=67}
