HloModule jit__generate_jit, input_output_alias={ {0}: (0, {}, may-alias), {1}: (1, {}, may-alias), {2}: (2, {}, may-alias), {3}: (3, {}, may-alias), {4}: (4, {}, may-alias), {5}: (5, {}, may-alias), {6}: (6, {}, may-alias), {7}: (7, {}, may-alias), {8}: (8, {}, may-alias), {10}: (9, {}, may-alias), {12}: (10, {}, may-alias) }, entry_computation_layout={(s32[32,1]{1,0}, s32[32,1,1984]{2,1,0}, s32[32,1,64]{2,1,0}, bf16[32,1984,8,1,128]{4,3,2,1,0}, s32[32,1]{1,0}, /*index=5*/bf16[32,1984,8,1,128]{4,3,2,1,0}, bf16[32,64,8,1,128]{4,3,2,1,0}, bf16[32,64,8,1,128]{4,3,2,1,0}, s32[1,1]{1,0}, s32[1,1]{1,0}, /*index=10*/s32[1,1]{1,0}, f32[4096]{0}, f32[4096,32,8]{2,1,0}, f32[8,32,4096,14336]{3,2,1,0}, f32[8,32,4096,14336]{3,2,1,0}, /*index=15*/f32[8,32,14336,4096]{3,2,1,0}, f32[4096,32]{1,0}, f32[4096,32]{1,0}, f32[4096,32,8,128]{3,2,1,0}, f32[32,32,128,4096]{3,2,1,0}, /*index=20*/f32[4096,32,32,128]{3,2,1,0}, f32[4096,32,8,128]{3,2,1,0}, f32[4096,32000]{1,0}, f32[32000,4096]{1,0})->(s32[32,1]{1,0}, s32[32,1,1984]{2,1,0}, s32[32,1,64]{2,1,0}, bf16[32,1984,8,1,128]{4,3,2,1,0}, s32[32,1]{1,0}, /*index=5*/bf16[32,1984,8,1,128]{4,3,2,1,0}, bf16[32,64,8,1,128]{4,3,2,1,0}, bf16[32,64,8,1,128]{4,3,2,1,0}, s32[1,1]{1,0}, f32[1,1,32000]{2,1,0}, /*index=10*/s32[1,1]{1,0}, f32[1,1]{1,0}, s32[1,1]{1,0}, s32[1,3]{1,0}, f32[1,1]{1,0})}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={xla.sdy.meshes={mesh = #sdy.mesh<["diloco"=1, "data"=1, "stage"=1, "fsdp"=1, "fsdp_transpose"=1, "context"=1, "context_autoregressive"=1, "tensor"=1, "tensor_transpose"=1, "tensor_sequence"=1, "expert"=1, "autoregressive"=1]>}}

FileNames
1 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/maxengine/maxengine.py"
2 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/models/models.py"
3 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/decoders.py"
4 "/usr/local/lib/python3.12/dist-packages/flax/core/axes_scan.py"
5 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/nnx_wrappers.py"
6 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/models/mixtral.py"
7 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/normalizations.py"
8 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/attentions.py"
9 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/kvcache.py"
10 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/attention_op.py"
11 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/moe.py"
12 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/utils/sharding.py"
13 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/linears.py"
14 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/embeddings.py"
15 "<frozen runpy>"
16 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/decode.py"
17 "/usr/local/lib/python3.12/dist-packages/absl/app.py"
18 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/inference_utils.py"

FunctionNames
1 "MaxEngine._prefill_jit"
2 "TransformerLinenPure.apply"
3 "TransformerLinenPure.__call__"
4 "Decoder.__call__"
5 "scan.<locals>.scan_fn"
6 "MaxEngine._generate_jit"
7 "scan.<locals>.scan_fn.<locals>.body_fn"
8 "ToLinen.__call__"
9 "MixtralDecoderLayer.__call__"
10 "_fix_for_qwix_quantization.<locals>.wrap.<locals>.wrapped"
11 "RMSNorm.__call__"
12 "Attention.__call__"
13 "Attention.update_kv_caches"
14 "KVCache.__call__"
15 "KVCache.kv_cache_autoregressive"
16 "AttentionOp.__call__"
17 "AttentionOp.apply_attention"
18 "AttentionOp.apply_attention_dot"
19 "AttentionOp.compute_local_attention"
20 "RoutedMoE.__call__"
21 "RoutedMoE.dense_matmul"
22 "RoutedMoE.get_topk"
23 "AttentionOp.generate_attention_mask"
24 "apply_mask_to_logits"
25 "KVCache.get_cached_values"
26 "KVCache.get_cached_values.<locals>.<lambda>"
27 "reverse_transpose"
28 "maybe_shard_with_logical"
29 "maybe_shard_with_name"
30 "Attention.query_projection"
31 "DenseGeneral.__call__"
32 "_compute_dot_general_nnx"
33 "Attention.apply_rotary_embedding"
34 "RotaryEmbedding.__call__"
35 "RotaryEmbedding.timescale"
36 "RotaryEmbedding.apply_rotary"
37 "RotaryEmbedding._rotate_half"
38 "AttentionOp.qk_product"
39 "Attention.kv_projection"
40 "KVCache.update_ar_key_value"
41 "AttentionOp.normalize_attention"
42 "AttentionOp.normalize_attention.<locals>.<genexpr>"
43 "AttentionOp.wv_product"
44 "Attention.out_projection"
45 "RoutedMoE._maybe_shard_with_logical"
46 "RoutedMoE.apply_ffn_activation"
47 "RoutedMoE.reshape_and_update_weights"
48 "GateLogit.__call__"
49 "_run_module_as_main"
50 "_run_code"
51 "<module>"
52 "run"
53 "_run_main"
54 "main"
55 "MaxEngine.generate"
56 "Decoder.apply_output_head"
57 "sampling"
58 "Decoder._apply_embedding"
59 "Embed.__call__"
60 "scan.<locals>.transpose_to_front"
61 "scan.<locals>.transpose_to_front.<locals>.trans"

FileLocations
1 {file_name_id=1 function_name_id=1 line=798 end_line=815 column=32 end_column=9}
2 {file_name_id=2 function_name_id=2 line=71 end_line=71 column=11 end_column=51}
3 {file_name_id=2 function_name_id=3 line=202 end_line=215 column=38 end_column=5}
4 {file_name_id=3 function_name_id=4 line=1133 end_line=1142 column=19 end_column=41}
5 {file_name_id=4 function_name_id=5 line=200 end_line=203 column=14 end_column=7}
6 {file_name_id=1 function_name_id=6 line=1353 end_line=1361 column=31 end_column=9}
7 {file_name_id=4 function_name_id=7 line=157 end_line=157 column=29 end_column=53}
8 {file_name_id=5 function_name_id=8 line=549 end_line=549 column=10 end_column=44}
9 {file_name_id=6 function_name_id=9 line=145 end_line=145 column=10 end_column=52}
10 {file_name_id=5 function_name_id=10 line=383 end_line=383 column=15 end_column=39}
11 {file_name_id=7 function_name_id=11 line=72 end_line=72 column=12 end_column=59}
12 {file_name_id=6 function_name_id=9 line=148 end_line=158 column=30 end_column=5}
13 {file_name_id=8 function_name_id=12 line=1224 end_line=1224 column=24 end_column=106}
14 {file_name_id=8 function_name_id=13 line=994 end_line=1001 column=36 end_column=5}
15 {file_name_id=9 function_name_id=14 line=959 end_line=959 column=13 end_column=75}
16 {file_name_id=9 function_name_id=15 line=907 end_line=907 column=35 end_column=80}
17 {file_name_id=8 function_name_id=12 line=1225 end_line=1236 column=12 end_column=7}
18 {file_name_id=10 function_name_id=16 line=2106 end_line=2123 column=86 end_column=5}
19 {file_name_id=10 function_name_id=17 line=972 end_line=986 column=13 end_column=7}
20 {file_name_id=10 function_name_id=18 line=1919 end_line=1919 column=11 end_column=109}
21 {file_name_id=10 function_name_id=19 line=1770 end_line=1770 column=16 end_column=55}
22 {file_name_id=10 function_name_id=19 line=1772 end_line=1772 column=16 end_column=68}
23 {file_name_id=10 function_name_id=16 line=2133 end_line=2146 column=71 end_column=5}
24 {file_name_id=6 function_name_id=9 line=164 end_line=164 column=20 end_column=76}
25 {file_name_id=6 function_name_id=9 line=171 end_line=171 column=36 end_column=66}
26 {file_name_id=11 function_name_id=20 line=2639 end_line=2641 column=38 end_column=7}
27 {file_name_id=11 function_name_id=21 line=2193 end_line=2193 column=35 end_column=110}
28 {file_name_id=11 function_name_id=22 line=711 end_line=711 column=22 end_column=80}
29 {file_name_id=11 function_name_id=20 line=2588 end_line=2588 column=16 end_column=53}
30 {file_name_id=7 function_name_id=11 line=90 end_line=90 column=12 end_column=42}
31 {file_name_id=10 function_name_id=18 line=1866 end_line=1874 column=16 end_column=5}
32 {file_name_id=10 function_name_id=23 line=698 end_line=698 column=13 end_column=94}
33 {file_name_id=10 function_name_id=23 line=787 end_line=787 column=11 end_column=58}
34 {file_name_id=10 function_name_id=18 line=1906 end_line=1906 column=21 end_column=66}
35 {file_name_id=10 function_name_id=24 line=121 end_line=121 column=20 end_column=52}
36 {file_name_id=9 function_name_id=15 line=914 end_line=914 column=8 end_column=97}
37 {file_name_id=9 function_name_id=25 line=848 end_line=848 column=35 end_column=110}
38 {file_name_id=9 function_name_id=26 line=848 end_line=848 column=58 end_column=96}
39 {file_name_id=9 function_name_id=27 line=42 end_line=42 column=9 end_column=81}
40 {file_name_id=7 function_name_id=11 line=71 end_line=71 column=8 end_column=35}
41 {file_name_id=7 function_name_id=11 line=72 end_line=72 column=21 end_column=34}
42 {file_name_id=7 function_name_id=11 line=73 end_line=73 column=34 end_column=54}
43 {file_name_id=7 function_name_id=11 line=73 end_line=73 column=24 end_column=55}
44 {file_name_id=7 function_name_id=11 line=73 end_line=73 column=20 end_column=55}
45 {file_name_id=7 function_name_id=11 line=73 end_line=73 column=8 end_column=68}
46 {file_name_id=7 function_name_id=11 line=92 end_line=92 column=11 end_column=84}
47 {file_name_id=8 function_name_id=12 line=1124 end_line=1124 column=15 end_column=73}
48 {file_name_id=12 function_name_id=28 line=147 end_line=155 column=9 end_column=3}
49 {file_name_id=12 function_name_id=29 line=113 end_line=113 column=11 end_column=67}
50 {file_name_id=8 function_name_id=12 line=1142 end_line=1142 column=14 end_column=72}
51 {file_name_id=8 function_name_id=30 line=614 end_line=614 column=11 end_column=58}
52 {file_name_id=13 function_name_id=31 line=231 end_line=231 column=15 end_column=46}
53 {file_name_id=13 function_name_id=31 line=238 end_line=247 column=13 end_column=5}
54 {file_name_id=13 function_name_id=32 line=102 end_line=104 column=9 end_column=3}
55 {file_name_id=8 function_name_id=12 line=1172 end_line=1172 column=14 end_column=108}
56 {file_name_id=8 function_name_id=33 line=935 end_line=935 column=13 end_column=60}
57 {file_name_id=14 function_name_id=34 line=359 end_line=359 column=15 end_column=55}
58 {file_name_id=14 function_name_id=34 line=360 end_line=360 column=19 end_column=44}
59 {file_name_id=14 function_name_id=34 line=360 end_line=360 column=30 end_column=44}
60 {file_name_id=14 function_name_id=35 line=317 end_line=317 column=19 end_column=52}
61 {file_name_id=14 function_name_id=35 line=317 end_line=317 column=15 end_column=52}
62 {file_name_id=14 function_name_id=35 line=318 end_line=318 column=37 end_column=90}
63 {file_name_id=14 function_name_id=34 line=362 end_line=362 column=15 end_column=36}
64 {file_name_id=14 function_name_id=34 line=365 end_line=365 column=10 end_column=56}
65 {file_name_id=14 function_name_id=34 line=367 end_line=367 column=12 end_column=47}
66 {file_name_id=14 function_name_id=36 line=330 end_line=330 column=12 end_column=24}
67 {file_name_id=14 function_name_id=36 line=330 end_line=330 column=29 end_column=54}
68 {file_name_id=14 function_name_id=37 line=325 end_line=325 column=13 end_column=37}
69 {file_name_id=14 function_name_id=37 line=326 end_line=326 column=28 end_column=31}
70 {file_name_id=14 function_name_id=37 line=326 end_line=326 column=11 end_column=46}
71 {file_name_id=14 function_name_id=34 line=361 end_line=361 column=15 end_column=36}
72 {file_name_id=14 function_name_id=34 line=364 end_line=364 column=10 end_column=56}
73 {file_name_id=14 function_name_id=36 line=330 end_line=330 column=11 end_column=61}
74 {file_name_id=8 function_name_id=12 line=1199 end_line=1199 column=14 end_column=94}
75 {file_name_id=10 function_name_id=18 line=1850 end_line=1850 column=19 end_column=88}
76 {file_name_id=10 function_name_id=38 line=1957 end_line=1957 column=14 end_column=60}
77 {file_name_id=10 function_name_id=38 line=1960 end_line=1960 column=15 end_column=74}
78 {file_name_id=10 function_name_id=24 line=121 end_line=121 column=9 end_column=82}
79 {file_name_id=10 function_name_id=19 line=1761 end_line=1761 column=13 end_column=54}
80 {file_name_id=9 function_name_id=15 line=901 end_line=901 column=68 end_column=111}
81 {file_name_id=9 function_name_id=15 line=900 end_line=902 column=8 end_column=9}
82 {file_name_id=8 function_name_id=12 line=1125 end_line=1125 column=16 end_column=75}
83 {file_name_id=8 function_name_id=12 line=1143 end_line=1143 column=12 end_column=85}
84 {file_name_id=8 function_name_id=39 line=668 end_line=668 column=13 end_column=59}
85 {file_name_id=8 function_name_id=12 line=1174 end_line=1174 column=14 end_column=106}
86 {file_name_id=8 function_name_id=12 line=1200 end_line=1200 column=12 end_column=93}
87 {file_name_id=9 function_name_id=15 line=882 end_line=890 column=4 end_column=5}
88 {file_name_id=9 function_name_id=40 line=751 end_line=751 column=37 end_column=91}
89 {file_name_id=9 function_name_id=40 line=763 end_line=763 column=26 end_column=54}
90 {file_name_id=9 function_name_id=40 line=798 end_line=800 column=10 end_column=11}
91 {file_name_id=9 function_name_id=15 line=920 end_line=920 column=8 end_column=87}
92 {file_name_id=10 function_name_id=16 line=2161 end_line=2161 column=15 end_column=100}
93 {file_name_id=10 function_name_id=41 line=2062 end_line=2062 column=17 end_column=59}
94 {file_name_id=10 function_name_id=41 line=2069 end_line=2069 column=33 end_column=55}
95 {file_name_id=10 function_name_id=41 line=2069 end_line=2069 column=25 end_column=56}
96 {file_name_id=10 function_name_id=41 line=2063 end_line=2065 column=17 end_column=5}
97 {file_name_id=10 function_name_id=42 line=2064 end_line=2064 column=17 end_column=39}
98 {file_name_id=10 function_name_id=42 line=2064 end_line=2064 column=9 end_column=40}
99 {file_name_id=10 function_name_id=19 line=1771 end_line=1771 column=34 end_column=52}
100 {file_name_id=10 function_name_id=19 line=1771 end_line=1771 column=26 end_column=53}
101 {file_name_id=10 function_name_id=19 line=1778 end_line=1778 column=16 end_column=54}
102 {file_name_id=10 function_name_id=41 line=2070 end_line=2070 column=18 end_column=46}
103 {file_name_id=9 function_name_id=15 line=915 end_line=915 column=8 end_column=101}
104 {file_name_id=10 function_name_id=19 line=1776 end_line=1776 column=17 end_column=60}
105 {file_name_id=10 function_name_id=19 line=1780 end_line=1780 column=16 end_column=81}
106 {file_name_id=10 function_name_id=43 line=2010 end_line=2010 column=12 end_column=80}
107 {file_name_id=10 function_name_id=43 line=2012 end_line=2012 column=15 end_column=52}
108 {file_name_id=8 function_name_id=12 line=1147 end_line=1147 column=16 end_column=91}
109 {file_name_id=8 function_name_id=39 line=670 end_line=670 column=13 end_column=61}
110 {file_name_id=8 function_name_id=12 line=1201 end_line=1201 column=14 end_column=97}
111 {file_name_id=9 function_name_id=40 line=752 end_line=752 column=39 end_column=95}
112 {file_name_id=9 function_name_id=40 line=803 end_line=805 column=10 end_column=11}
113 {file_name_id=9 function_name_id=15 line=921 end_line=921 column=8 end_column=91}
114 {file_name_id=10 function_name_id=41 line=2070 end_line=2070 column=6 end_column=46}
115 {file_name_id=8 function_name_id=12 line=1243 end_line=1243 column=12 end_column=75}
116 {file_name_id=8 function_name_id=12 line=1247 end_line=1247 column=10 end_column=61}
117 {file_name_id=8 function_name_id=44 line=733 end_line=733 column=11 end_column=51}
118 {file_name_id=6 function_name_id=9 line=161 end_line=161 column=26 end_column=48}
119 {file_name_id=11 function_name_id=21 line=2419 end_line=2421 column=15 end_column=7}
120 {file_name_id=11 function_name_id=45 line=614 end_line=621 column=11 end_column=5}
121 {file_name_id=11 function_name_id=20 line=2596 end_line=2596 column=18 end_column=57}
122 {file_name_id=11 function_name_id=21 line=2423 end_line=2425 column=19 end_column=9}
123 {file_name_id=11 function_name_id=21 line=2440 end_line=2440 column=23 end_column=68}
124 {file_name_id=11 function_name_id=46 line=809 end_line=809 column=20 end_column=48}
125 {file_name_id=11 function_name_id=20 line=2597 end_line=2597 column=18 end_column=57}
126 {file_name_id=11 function_name_id=21 line=2432 end_line=2434 column=19 end_column=9}
127 {file_name_id=11 function_name_id=46 line=810 end_line=810 column=29 end_column=62}
128 {file_name_id=11 function_name_id=21 line=2443 end_line=2448 column=29 end_column=9}
129 {file_name_id=11 function_name_id=21 line=2458 end_line=2458 column=31 end_column=69}
130 {file_name_id=11 function_name_id=21 line=2199 end_line=2199 column=16 end_column=77}
131 {file_name_id=11 function_name_id=47 line=1931 end_line=1931 column=8 end_column=117}
132 {file_name_id=11 function_name_id=47 line=1940 end_line=1940 column=21 end_column=95}
133 {file_name_id=11 function_name_id=47 line=1932 end_line=1932 column=8 end_column=106}
134 {file_name_id=11 function_name_id=20 line=2586 end_line=2586 column=35 end_column=60}
135 {file_name_id=11 function_name_id=48 line=323 end_line=323 column=13 end_column=44}
136 {file_name_id=11 function_name_id=48 line=331 end_line=340 column=13 end_column=5}
137 {file_name_id=11 function_name_id=21 line=2186 end_line=2186 column=18 end_column=118}
138 {file_name_id=11 function_name_id=22 line=706 end_line=706 column=37 end_column=89}
139 {file_name_id=11 function_name_id=22 line=711 end_line=711 column=37 end_column=70}
140 {file_name_id=11 function_name_id=21 line=2459 end_line=2459 column=20 end_column=47}
141 {file_name_id=11 function_name_id=21 line=2461 end_line=2466 column=17 end_column=9}
142 {file_name_id=11 function_name_id=21 line=2466 end_line=2466 column=10 end_column=28}
143 {file_name_id=6 function_name_id=9 line=174 end_line=174 column=19 end_column=48}
144 {file_name_id=9 function_name_id=15 line=905 end_line=905 column=16 end_column=50}
145 {file_name_id=9 function_name_id=15 line=905 end_line=905 column=8 end_column=101}
146 {file_name_id=15 function_name_id=49 line=198 end_line=199 column=11 end_column=42}
147 {file_name_id=15 function_name_id=50 line=88 end_line=88 column=4 end_column=27}
148 {file_name_id=16 function_name_id=51 line=245 end_line=245 column=2 end_column=15}
149 {file_name_id=17 function_name_id=52 line=410 end_line=410 column=6 end_column=27}
150 {file_name_id=17 function_name_id=53 line=355 end_line=355 column=13 end_column=23}
151 {file_name_id=16 function_name_id=54 line=211 end_line=211 column=37 end_column=92}
152 {file_name_id=1 function_name_id=55 line=1280 end_line=1289 column=24 end_column=5}
153 {file_name_id=3 function_name_id=4 line=1289 end_line=1289 column=15 end_column=96}
154 {file_name_id=3 function_name_id=56 line=795 end_line=802 column=8 end_column=40}
155 {file_name_id=1 function_name_id=6 line=1366 end_line=1373 column=16 end_column=5}
156 {file_name_id=18 function_name_id=57 line=135 end_line=135 column=11 end_column=38}
157 {file_name_id=3 function_name_id=4 line=872 end_line=879 column=8 end_column=5}
158 {file_name_id=3 function_name_id=58 line=706 end_line=706 column=8 end_column=85}
159 {file_name_id=14 function_name_id=59 line=155 end_line=158 column=16 end_column=5}
160 {file_name_id=14 function_name_id=59 line=182 end_line=182 column=15 end_column=66}
161 {file_name_id=4 function_name_id=5 line=150 end_line=150 column=9 end_column=66}
162 {file_name_id=4 function_name_id=60 line=126 end_line=126 column=11 end_column=44}
163 {file_name_id=4 function_name_id=61 line=124 end_line=124 column=13 end_column=35}
164 {file_name_id=1 function_name_id=6 line=1363 end_line=1363 column=16 end_column=92}
165 {file_name_id=1 function_name_id=6 line=1382 end_line=1382 column=23 end_column=59}
166 {file_name_id=3 function_name_id=56 line=831 end_line=844 column=15 end_column=7}
167 {file_name_id=3 function_name_id=56 line=847 end_line=847 column=15 end_column=41}
168 {file_name_id=1 function_name_id=6 line=1362 end_line=1362 column=17 end_column=87}
169 {file_name_id=1 function_name_id=6 line=1381 end_line=1381 column=15 end_column=43}
170 {file_name_id=1 function_name_id=6 line=1385 end_line=1385 column=13 end_column=78}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=1}
7 {file_location_id=2 parent_frame_id=7}
8 {file_location_id=3 parent_frame_id=8}
9 {file_location_id=4 parent_frame_id=9}
10 {file_location_id=5 parent_frame_id=10}
11 {file_location_id=7 parent_frame_id=1}
12 {file_location_id=8 parent_frame_id=12}
13 {file_location_id=9 parent_frame_id=13}
14 {file_location_id=10 parent_frame_id=14}
15 {file_location_id=11 parent_frame_id=15}
16 {file_location_id=12 parent_frame_id=13}
17 {file_location_id=10 parent_frame_id=17}
18 {file_location_id=13 parent_frame_id=18}
19 {file_location_id=14 parent_frame_id=19}
20 {file_location_id=10 parent_frame_id=20}
21 {file_location_id=15 parent_frame_id=21}
22 {file_location_id=16 parent_frame_id=22}
23 {file_location_id=17 parent_frame_id=18}
24 {file_location_id=10 parent_frame_id=24}
25 {file_location_id=18 parent_frame_id=25}
26 {file_location_id=19 parent_frame_id=26}
27 {file_location_id=20 parent_frame_id=27}
28 {file_location_id=21 parent_frame_id=28}
29 {file_location_id=22 parent_frame_id=28}
30 {file_location_id=23 parent_frame_id=25}
31 {file_location_id=19 parent_frame_id=31}
32 {file_location_id=20 parent_frame_id=32}
33 {file_location_id=21 parent_frame_id=33}
34 {file_location_id=22 parent_frame_id=33}
35 {file_location_id=24 parent_frame_id=13}
36 {file_location_id=10 parent_frame_id=36}
37 {file_location_id=11 parent_frame_id=37}
38 {file_location_id=25 parent_frame_id=13}
39 {file_location_id=10 parent_frame_id=39}
40 {file_location_id=26 parent_frame_id=40}
41 {file_location_id=27 parent_frame_id=41}
42 {file_location_id=28 parent_frame_id=42}
43 {file_location_id=29 parent_frame_id=40}
44 {file_location_id=30 parent_frame_id=37}
45 {file_location_id=31 parent_frame_id=27}
46 {file_location_id=32 parent_frame_id=46}
47 {file_location_id=33 parent_frame_id=46}
48 {file_location_id=34 parent_frame_id=27}
49 {file_location_id=35 parent_frame_id=49}
50 {file_location_id=36 parent_frame_id=22}
51 {file_location_id=37 parent_frame_id=51}
52 {file_location_id=38 parent_frame_id=52}
53 {file_location_id=39 parent_frame_id=53}
54 {file_location_id=30 parent_frame_id=15}
55 {file_location_id=40 parent_frame_id=15}
56 {file_location_id=41 parent_frame_id=15}
57 {file_location_id=42 parent_frame_id=15}
58 {file_location_id=43 parent_frame_id=15}
59 {file_location_id=44 parent_frame_id=15}
60 {file_location_id=45 parent_frame_id=15}
61 {file_location_id=46 parent_frame_id=15}
62 {file_location_id=47 parent_frame_id=18}
63 {file_location_id=48 parent_frame_id=63}
64 {file_location_id=49 parent_frame_id=64}
65 {file_location_id=50 parent_frame_id=18}
66 {file_location_id=51 parent_frame_id=66}
67 {file_location_id=10 parent_frame_id=67}
68 {file_location_id=52 parent_frame_id=68}
69 {file_location_id=53 parent_frame_id=68}
70 {file_location_id=54 parent_frame_id=70}
71 {file_location_id=55 parent_frame_id=18}
72 {file_location_id=56 parent_frame_id=72}
73 {file_location_id=10 parent_frame_id=73}
74 {file_location_id=57 parent_frame_id=74}
75 {file_location_id=58 parent_frame_id=74}
76 {file_location_id=59 parent_frame_id=74}
77 {file_location_id=60 parent_frame_id=77}
78 {file_location_id=61 parent_frame_id=77}
79 {file_location_id=62 parent_frame_id=77}
80 {file_location_id=63 parent_frame_id=74}
81 {file_location_id=64 parent_frame_id=74}
82 {file_location_id=65 parent_frame_id=74}
83 {file_location_id=66 parent_frame_id=83}
84 {file_location_id=67 parent_frame_id=83}
85 {file_location_id=68 parent_frame_id=85}
86 {file_location_id=69 parent_frame_id=85}
87 {file_location_id=70 parent_frame_id=85}
88 {file_location_id=71 parent_frame_id=74}
89 {file_location_id=72 parent_frame_id=74}
90 {file_location_id=73 parent_frame_id=83}
91 {file_location_id=74 parent_frame_id=18}
92 {file_location_id=48 parent_frame_id=92}
93 {file_location_id=49 parent_frame_id=93}
94 {file_location_id=75 parent_frame_id=27}
95 {file_location_id=76 parent_frame_id=95}
96 {file_location_id=77 parent_frame_id=95}
97 {file_location_id=78 parent_frame_id=49}
98 {file_location_id=79 parent_frame_id=28}
99 {file_location_id=80 parent_frame_id=22}
100 {file_location_id=81 parent_frame_id=22}
101 {file_location_id=31 parent_frame_id=32}
102 {file_location_id=32 parent_frame_id=102}
103 {file_location_id=33 parent_frame_id=102}
104 {file_location_id=34 parent_frame_id=32}
105 {file_location_id=35 parent_frame_id=105}
106 {file_location_id=82 parent_frame_id=18}
107 {file_location_id=48 parent_frame_id=107}
108 {file_location_id=49 parent_frame_id=108}
109 {file_location_id=83 parent_frame_id=18}
110 {file_location_id=84 parent_frame_id=110}
111 {file_location_id=10 parent_frame_id=111}
112 {file_location_id=52 parent_frame_id=112}
113 {file_location_id=53 parent_frame_id=112}
114 {file_location_id=54 parent_frame_id=114}
115 {file_location_id=85 parent_frame_id=18}
116 {file_location_id=56 parent_frame_id=116}
117 {file_location_id=10 parent_frame_id=117}
118 {file_location_id=57 parent_frame_id=118}
119 {file_location_id=58 parent_frame_id=118}
120 {file_location_id=59 parent_frame_id=118}
121 {file_location_id=60 parent_frame_id=121}
122 {file_location_id=61 parent_frame_id=121}
123 {file_location_id=62 parent_frame_id=121}
124 {file_location_id=63 parent_frame_id=118}
125 {file_location_id=64 parent_frame_id=118}
126 {file_location_id=65 parent_frame_id=118}
127 {file_location_id=66 parent_frame_id=127}
128 {file_location_id=67 parent_frame_id=127}
129 {file_location_id=68 parent_frame_id=129}
130 {file_location_id=69 parent_frame_id=129}
131 {file_location_id=70 parent_frame_id=129}
132 {file_location_id=71 parent_frame_id=118}
133 {file_location_id=72 parent_frame_id=118}
134 {file_location_id=73 parent_frame_id=127}
135 {file_location_id=86 parent_frame_id=18}
136 {file_location_id=48 parent_frame_id=136}
137 {file_location_id=49 parent_frame_id=137}
138 {file_location_id=87 parent_frame_id=22}
139 {file_location_id=88 parent_frame_id=139}
140 {file_location_id=89 parent_frame_id=139}
141 {file_location_id=90 parent_frame_id=139}
142 {file_location_id=91 parent_frame_id=22}
143 {file_location_id=37 parent_frame_id=143}
144 {file_location_id=38 parent_frame_id=144}
145 {file_location_id=39 parent_frame_id=145}
146 {file_location_id=75 parent_frame_id=32}
147 {file_location_id=76 parent_frame_id=147}
148 {file_location_id=77 parent_frame_id=147}
149 {file_location_id=78 parent_frame_id=105}
150 {file_location_id=79 parent_frame_id=33}
151 {file_location_id=92 parent_frame_id=25}
152 {file_location_id=93 parent_frame_id=152}
153 {file_location_id=94 parent_frame_id=152}
154 {file_location_id=95 parent_frame_id=152}
155 {file_location_id=96 parent_frame_id=152}
156 {file_location_id=97 parent_frame_id=156}
157 {file_location_id=98 parent_frame_id=156}
158 {file_location_id=99 parent_frame_id=28}
159 {file_location_id=100 parent_frame_id=28}
160 {file_location_id=101 parent_frame_id=28}
161 {file_location_id=99 parent_frame_id=33}
162 {file_location_id=100 parent_frame_id=33}
163 {file_location_id=101 parent_frame_id=33}
164 {file_location_id=102 parent_frame_id=152}
165 {file_location_id=103 parent_frame_id=22}
166 {file_location_id=37 parent_frame_id=166}
167 {file_location_id=38 parent_frame_id=167}
168 {file_location_id=39 parent_frame_id=168}
169 {file_location_id=104 parent_frame_id=28}
170 {file_location_id=105 parent_frame_id=28}
171 {file_location_id=106 parent_frame_id=171}
172 {file_location_id=107 parent_frame_id=171}
173 {file_location_id=108 parent_frame_id=18}
174 {file_location_id=109 parent_frame_id=174}
175 {file_location_id=10 parent_frame_id=175}
176 {file_location_id=52 parent_frame_id=176}
177 {file_location_id=53 parent_frame_id=176}
178 {file_location_id=54 parent_frame_id=178}
179 {file_location_id=110 parent_frame_id=18}
180 {file_location_id=48 parent_frame_id=180}
181 {file_location_id=49 parent_frame_id=181}
182 {file_location_id=111 parent_frame_id=139}
183 {file_location_id=112 parent_frame_id=139}
184 {file_location_id=113 parent_frame_id=22}
185 {file_location_id=37 parent_frame_id=185}
186 {file_location_id=38 parent_frame_id=186}
187 {file_location_id=39 parent_frame_id=187}
188 {file_location_id=104 parent_frame_id=33}
189 {file_location_id=105 parent_frame_id=33}
190 {file_location_id=106 parent_frame_id=190}
191 {file_location_id=107 parent_frame_id=190}
192 {file_location_id=114 parent_frame_id=152}
193 {file_location_id=115 parent_frame_id=18}
194 {file_location_id=48 parent_frame_id=194}
195 {file_location_id=49 parent_frame_id=195}
196 {file_location_id=116 parent_frame_id=18}
197 {file_location_id=117 parent_frame_id=197}
198 {file_location_id=10 parent_frame_id=198}
199 {file_location_id=52 parent_frame_id=199}
200 {file_location_id=53 parent_frame_id=199}
201 {file_location_id=54 parent_frame_id=201}
202 {file_location_id=118 parent_frame_id=13}
203 {file_location_id=40 parent_frame_id=37}
204 {file_location_id=41 parent_frame_id=37}
205 {file_location_id=42 parent_frame_id=37}
206 {file_location_id=43 parent_frame_id=37}
207 {file_location_id=44 parent_frame_id=37}
208 {file_location_id=45 parent_frame_id=37}
209 {file_location_id=46 parent_frame_id=37}
210 {file_location_id=119 parent_frame_id=41}
211 {file_location_id=120 parent_frame_id=211}
212 {file_location_id=48 parent_frame_id=212}
213 {file_location_id=49 parent_frame_id=213}
214 {file_location_id=121 parent_frame_id=40}
215 {file_location_id=122 parent_frame_id=41}
216 {file_location_id=123 parent_frame_id=41}
217 {file_location_id=124 parent_frame_id=217}
218 {file_location_id=125 parent_frame_id=40}
219 {file_location_id=126 parent_frame_id=41}
220 {file_location_id=127 parent_frame_id=217}
221 {file_location_id=128 parent_frame_id=41}
222 {file_location_id=129 parent_frame_id=41}
223 {file_location_id=130 parent_frame_id=41}
224 {file_location_id=131 parent_frame_id=224}
225 {file_location_id=120 parent_frame_id=225}
226 {file_location_id=48 parent_frame_id=226}
227 {file_location_id=49 parent_frame_id=227}
228 {file_location_id=132 parent_frame_id=224}
229 {file_location_id=133 parent_frame_id=224}
230 {file_location_id=120 parent_frame_id=230}
231 {file_location_id=48 parent_frame_id=231}
232 {file_location_id=49 parent_frame_id=232}
233 {file_location_id=134 parent_frame_id=40}
234 {file_location_id=10 parent_frame_id=234}
235 {file_location_id=135 parent_frame_id=235}
236 {file_location_id=136 parent_frame_id=235}
237 {file_location_id=54 parent_frame_id=237}
238 {file_location_id=137 parent_frame_id=41}
239 {file_location_id=120 parent_frame_id=239}
240 {file_location_id=48 parent_frame_id=240}
241 {file_location_id=49 parent_frame_id=241}
242 {file_location_id=138 parent_frame_id=42}
243 {file_location_id=139 parent_frame_id=42}
244 {file_location_id=140 parent_frame_id=41}
245 {file_location_id=141 parent_frame_id=41}
246 {file_location_id=142 parent_frame_id=41}
247 {file_location_id=143 parent_frame_id=13}
248 {file_location_id=144 parent_frame_id=22}
249 {file_location_id=145 parent_frame_id=22}
250 {file_location_id=146 parent_frame_id=1}
251 {file_location_id=147 parent_frame_id=251}
252 {file_location_id=148 parent_frame_id=252}
253 {file_location_id=149 parent_frame_id=253}
254 {file_location_id=150 parent_frame_id=254}
255 {file_location_id=151 parent_frame_id=255}
256 {file_location_id=152 parent_frame_id=256}
257 {file_location_id=6 parent_frame_id=257}
258 {file_location_id=2 parent_frame_id=258}
259 {file_location_id=3 parent_frame_id=259}
260 {file_location_id=4 parent_frame_id=260}
261 {file_location_id=5 parent_frame_id=261}
262 {file_location_id=6 parent_frame_id=262}
263 {file_location_id=2 parent_frame_id=263}
264 {file_location_id=3 parent_frame_id=264}
265 {file_location_id=4 parent_frame_id=265}
266 {file_location_id=5 parent_frame_id=266}
267 {file_location_id=6 parent_frame_id=267}
268 {file_location_id=2 parent_frame_id=268}
269 {file_location_id=3 parent_frame_id=269}
270 {file_location_id=4 parent_frame_id=270}
271 {file_location_id=5 parent_frame_id=271}
272 {file_location_id=153 parent_frame_id=260}
273 {file_location_id=154 parent_frame_id=273}
274 {file_location_id=8 parent_frame_id=274}
275 {file_location_id=11 parent_frame_id=275}
276 {file_location_id=155 parent_frame_id=1}
277 {file_location_id=156 parent_frame_id=277}
278 {file_location_id=155 parent_frame_id=278}
279 {file_location_id=156 parent_frame_id=279}
280 {file_location_id=157 parent_frame_id=260}
281 {file_location_id=158 parent_frame_id=281}
282 {file_location_id=8 parent_frame_id=282}
283 {file_location_id=159 parent_frame_id=283}
284 {file_location_id=160 parent_frame_id=283}
285 {file_location_id=161 parent_frame_id=261}
286 {file_location_id=162 parent_frame_id=286}
287 {file_location_id=163 parent_frame_id=287}
288 {file_location_id=164 parent_frame_id=257}
289 {file_location_id=165 parent_frame_id=257}
290 {file_location_id=30 parent_frame_id=275}
291 {file_location_id=40 parent_frame_id=275}
292 {file_location_id=41 parent_frame_id=275}
293 {file_location_id=42 parent_frame_id=275}
294 {file_location_id=43 parent_frame_id=275}
295 {file_location_id=44 parent_frame_id=275}
296 {file_location_id=45 parent_frame_id=275}
297 {file_location_id=46 parent_frame_id=275}
298 {file_location_id=166 parent_frame_id=273}
299 {file_location_id=8 parent_frame_id=299}
300 {file_location_id=52 parent_frame_id=300}
301 {file_location_id=53 parent_frame_id=300}
302 {file_location_id=54 parent_frame_id=302}
303 {file_location_id=167 parent_frame_id=273}
304 {file_location_id=168 parent_frame_id=257}
305 {file_location_id=169 parent_frame_id=257}
306 {file_location_id=155 parent_frame_id=257}
307 {file_location_id=156 parent_frame_id=307}
308 {file_location_id=170 parent_frame_id=257}


%dynamic_index_in_dim.1 (Arg_0.1: f32[32,4096,8], Arg_1.1: s32[]) -> f32[4096,8] {
  %Arg_0.1 = f32[32,4096,8]{2,1,0} parameter(0)
  %Arg_1.1 = s32[] parameter(1)
  %constant.16 = s32[] constant(0)
  %dynamic_slice.1 = f32[1,4096,8]{2,1,0} dynamic-slice(%Arg_0.1, %Arg_1.1, %constant.16, %constant.16), dynamic_slice_sizes={1,4096,8}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.1 = f32[4096,8]{1,0} reshape(%dynamic_slice.1), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_0.2 (Arg_0.3: f32[32,8,4096,14336], Arg_1.3: s32[]) -> f32[8,4096,14336] {
  %Arg_0.3 = f32[32,8,4096,14336]{3,2,1,0} parameter(0)
  %Arg_1.3 = s32[] parameter(1)
  %constant.18 = s32[] constant(0)
  %dynamic_slice.3 = f32[1,8,4096,14336]{3,2,1,0} dynamic-slice(%Arg_0.3, %Arg_1.3, %constant.18, %constant.18, %constant.18), dynamic_slice_sizes={1,8,4096,14336}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.3 = f32[8,4096,14336]{2,1,0} reshape(%dynamic_slice.3), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_1.3 (Arg_0.5: f32[32,8,14336,4096], Arg_1.5: s32[]) -> f32[8,14336,4096] {
  %Arg_0.5 = f32[32,8,14336,4096]{3,2,1,0} parameter(0)
  %Arg_1.5 = s32[] parameter(1)
  %constant.20 = s32[] constant(0)
  %dynamic_slice.5 = f32[1,8,14336,4096]{3,2,1,0} dynamic-slice(%Arg_0.5, %Arg_1.5, %constant.20, %constant.20, %constant.20), dynamic_slice_sizes={1,8,14336,4096}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.5 = f32[8,14336,4096]{2,1,0} reshape(%dynamic_slice.5), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_2.4 (Arg_0.7: f32[32,4096], Arg_1.7: s32[]) -> f32[4096] {
  %Arg_0.7 = f32[32,4096]{1,0} parameter(0)
  %Arg_1.7 = s32[] parameter(1)
  %constant.22 = s32[] constant(0)
  %dynamic_slice.7 = f32[1,4096]{1,0} dynamic-slice(%Arg_0.7, %Arg_1.7, %constant.22), dynamic_slice_sizes={1,4096}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.7 = f32[4096]{0} reshape(%dynamic_slice.7), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_3.5 (Arg_0.9: f32[32,4096,8,128], Arg_1.9: s32[]) -> f32[4096,8,128] {
  %Arg_0.9 = f32[32,4096,8,128]{3,2,1,0} parameter(0)
  %Arg_1.9 = s32[] parameter(1)
  %constant.24 = s32[] constant(0)
  %dynamic_slice.9 = f32[1,4096,8,128]{3,2,1,0} dynamic-slice(%Arg_0.9, %Arg_1.9, %constant.24, %constant.24, %constant.24), dynamic_slice_sizes={1,4096,8,128}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.9 = f32[4096,8,128]{2,1,0} reshape(%dynamic_slice.9), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_4.6 (Arg_0.11: f32[32,32,128,4096], Arg_1.11: s32[]) -> f32[32,128,4096] {
  %Arg_0.11 = f32[32,32,128,4096]{3,2,1,0} parameter(0)
  %Arg_1.11 = s32[] parameter(1)
  %constant.26 = s32[] constant(0)
  %dynamic_slice.11 = f32[1,32,128,4096]{3,2,1,0} dynamic-slice(%Arg_0.11, %Arg_1.11, %constant.26, %constant.26, %constant.26), dynamic_slice_sizes={1,32,128,4096}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.11 = f32[32,128,4096]{2,1,0} reshape(%dynamic_slice.11), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_5.7 (Arg_0.13: f32[32,4096,32,128], Arg_1.13: s32[]) -> f32[4096,32,128] {
  %Arg_0.13 = f32[32,4096,32,128]{3,2,1,0} parameter(0)
  %Arg_1.13 = s32[] parameter(1)
  %constant.28 = s32[] constant(0)
  %dynamic_slice.13 = f32[1,4096,32,128]{3,2,1,0} dynamic-slice(%Arg_0.13, %Arg_1.13, %constant.28, %constant.28, %constant.28), dynamic_slice_sizes={1,4096,32,128}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.13 = f32[4096,32,128]{2,1,0} reshape(%dynamic_slice.13), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_6.8 (Arg_0.15: s32[32,1], Arg_1.15: s32[]) -> s32[1] {
  %Arg_0.15 = s32[32,1]{1,0} parameter(0)
  %Arg_1.15 = s32[] parameter(1)
  %constant.30 = s32[] constant(0)
  %dynamic_slice.15 = s32[1,1]{1,0} dynamic-slice(%Arg_0.15, %Arg_1.15, %constant.30), dynamic_slice_sizes={1,1}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.15 = s32[1]{0} reshape(%dynamic_slice.15), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_7.9 (Arg_0.17: s32[32,1,1984], Arg_1.17: s32[]) -> s32[1,1984] {
  %Arg_0.17 = s32[32,1,1984]{2,1,0} parameter(0)
  %Arg_1.17 = s32[] parameter(1)
  %constant.32 = s32[] constant(0)
  %dynamic_slice.17 = s32[1,1,1984]{2,1,0} dynamic-slice(%Arg_0.17, %Arg_1.17, %constant.32, %constant.32), dynamic_slice_sizes={1,1,1984}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.17 = s32[1,1984]{1,0} reshape(%dynamic_slice.17), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_8.10 (Arg_0.19: s32[32,1,64], Arg_1.19: s32[]) -> s32[1,64] {
  %Arg_0.19 = s32[32,1,64]{2,1,0} parameter(0)
  %Arg_1.19 = s32[] parameter(1)
  %constant.34 = s32[] constant(0)
  %dynamic_slice.19 = s32[1,1,64]{2,1,0} dynamic-slice(%Arg_0.19, %Arg_1.19, %constant.34, %constant.34), dynamic_slice_sizes={1,1,64}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.19 = s32[1,64]{1,0} reshape(%dynamic_slice.19), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_9.11 (Arg_0.21: bf16[32,1984,8,1,128], Arg_1.21: s32[]) -> bf16[1984,8,1,128] {
  %Arg_0.21 = bf16[32,1984,8,1,128]{4,3,2,1,0} parameter(0)
  %Arg_1.21 = s32[] parameter(1)
  %constant.36 = s32[] constant(0)
  %dynamic_slice.21 = bf16[1,1984,8,1,128]{4,3,2,1,0} dynamic-slice(%Arg_0.21, %Arg_1.21, %constant.36, %constant.36, %constant.36, /*index=5*/%constant.36), dynamic_slice_sizes={1,1984,8,1,128}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.21 = bf16[1984,8,1,128]{3,2,1,0} reshape(%dynamic_slice.21), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_10.12 (Arg_0.23: bf16[32,64,8,1,128], Arg_1.23: s32[]) -> bf16[64,8,1,128] {
  %Arg_0.23 = bf16[32,64,8,1,128]{4,3,2,1,0} parameter(0)
  %Arg_1.23 = s32[] parameter(1)
  %constant.38 = s32[] constant(0)
  %dynamic_slice.23 = bf16[1,64,8,1,128]{4,3,2,1,0} dynamic-slice(%Arg_0.23, %Arg_1.23, %constant.38, %constant.38, %constant.38, /*index=5*/%constant.38), dynamic_slice_sizes={1,64,8,1,128}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.23 = bf16[64,8,1,128]{3,2,1,0} reshape(%dynamic_slice.23), metadata={op_name="squeeze" stack_frame_id=10}
}

%_where_12.19 (Arg_0.34: pred[1,1,1,1,64], Arg_1.34: f32[], Arg_2.8: f32[]) -> f32[1,1,1,1,64] {
  %Arg_0.34 = pred[1,1,1,1,64]{4,3,2,1,0} parameter(0)
  %Arg_1.34 = f32[] parameter(1)
  %broadcast_in_dim.11 = f32[1,1,1,1,64]{4,3,2,1,0} broadcast(%Arg_1.34), dimensions={}, metadata={op_name="broadcast_in_dim"}
  %Arg_2.8 = f32[] parameter(2)
  %broadcast_in_dim.12 = f32[1,1,1,1,64]{4,3,2,1,0} broadcast(%Arg_2.8), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.10 = f32[1,1,1,1,64]{4,3,2,1,0} select(%Arg_0.34, %broadcast_in_dim.11, %broadcast_in_dim.12), metadata={op_name="select_n"}
}

%region_1.13 (reduce_sum.3: f32[], reduce_sum.4: f32[]) -> f32[] {
  %reduce_sum.3 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.4 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.5 = f32[] add(%reduce_sum.3, %reduce_sum.4), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=15}
}

%_where_13.20 (Arg_0.36: pred[1,1,1,1,64], Arg_1.36: bf16[1,8,4,1,64], Arg_2.10: f32[]) -> bf16[1,8,4,1,64] {
  %Arg_0.36 = pred[1,1,1,1,64]{4,3,2,1,0} parameter(0)
  %broadcast_in_dim.17 = pred[1,1,1,1,64]{4,3,2,1,0} broadcast(%Arg_0.36), dimensions={0,1,2,3,4}, metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.18 = pred[1,1,64]{2,1,0} reshape(%broadcast_in_dim.17), metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.19 = pred[1,8,4,1,64]{4,3,2,1,0} broadcast(%broadcast_in_dim.18), dimensions={0,3,4}, metadata={op_name="broadcast_in_dim"}
  %Arg_1.36 = bf16[1,8,4,1,64]{4,3,2,1,0} parameter(1)
  %Arg_2.10 = f32[] parameter(2)
  %convert_element_type.16 = bf16[] convert(%Arg_2.10), metadata={op_name="convert_element_type"}
  %broadcast_in_dim.20 = bf16[1,8,4,1,64]{4,3,2,1,0} broadcast(%convert_element_type.16), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.12 = bf16[1,8,4,1,64]{4,3,2,1,0} select(%broadcast_in_dim.19, %Arg_1.36, %broadcast_in_dim.20), metadata={op_name="select_n"}
}

%region_3.21 (reduce_max.3: bf16[], reduce_max.4: bf16[]) -> bf16[] {
  %reduce_max.3 = bf16[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.4 = bf16[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.5 = bf16[] maximum(%reduce_max.3, %reduce_max.4), metadata={op_name="checkpoint/layers/reduce_max" stack_frame_id=28}
}

%dynamic_update_index_in_dim_11.15 (Arg_0.28: s32[1,1984], Arg_1.28: s32[1,1], Arg_2.4: s32[]) -> s32[1,1984] {
  %Arg_0.28 = s32[1,1984]{1,0} parameter(0)
  %Arg_1.28 = s32[1,1]{1,0} parameter(1)
  %constant.70 = s32[] constant(0)
  %Arg_2.4 = s32[] parameter(2)
  %lt.4 = pred[] compare(%Arg_2.4, %constant.70), direction=LT, metadata={op_name="lt"}
  %constant.69 = s32[] constant(1984)
  %add.7 = s32[] add(%Arg_2.4, %constant.69), metadata={op_name="add"}
  %select_n.4 = s32[] select(%lt.4, %add.7, %Arg_2.4), metadata={op_name="select_n"}
  ROOT %dynamic_update_slice.3 = s32[1,1984]{1,0} dynamic-update-slice(%Arg_0.28, %Arg_1.28, %constant.70, %select_n.4), metadata={op_name="dynamic_update_slice"}
}

%_where_14.23 (Arg_0.38: pred[1,1,1,1,1984], Arg_1.38: f32[], Arg_2.12: f32[]) -> f32[1,1,1,1,1984] {
  %Arg_0.38 = pred[1,1,1,1,1984]{4,3,2,1,0} parameter(0)
  %Arg_1.38 = f32[] parameter(1)
  %broadcast_in_dim.27 = f32[1,1,1,1,1984]{4,3,2,1,0} broadcast(%Arg_1.38), dimensions={}, metadata={op_name="broadcast_in_dim"}
  %Arg_2.12 = f32[] parameter(2)
  %broadcast_in_dim.28 = f32[1,1,1,1,1984]{4,3,2,1,0} broadcast(%Arg_2.12), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.14 = f32[1,1,1,1,1984]{4,3,2,1,0} select(%Arg_0.38, %broadcast_in_dim.27, %broadcast_in_dim.28), metadata={op_name="select_n"}
}

%dynamic_update_index_in_dim.14 (Arg_0.26: bf16[1984,8,1,128], Arg_1.26: bf16[1,8,1,128], Arg_2.2: s32[]) -> bf16[1984,8,1,128] {
  %Arg_0.26 = bf16[1984,8,1,128]{3,2,1,0} parameter(0)
  %Arg_1.26 = bf16[1,8,1,128]{3,2,1,0} parameter(1)
  %Arg_2.2 = s32[] parameter(2)
  %constant.66 = s32[] constant(0)
  %lt.2 = pred[] compare(%Arg_2.2, %constant.66), direction=LT, metadata={op_name="lt"}
  %constant.65 = s32[] constant(1984)
  %add.5 = s32[] add(%Arg_2.2, %constant.65), metadata={op_name="add"}
  %select_n.2 = s32[] select(%lt.2, %add.5, %Arg_2.2), metadata={op_name="select_n"}
  ROOT %dynamic_update_slice.1 = bf16[1984,8,1,128]{3,2,1,0} dynamic-update-slice(%Arg_0.26, %Arg_1.26, %select_n.2, %constant.66, %constant.66, /*index=5*/%constant.66), metadata={op_name="dynamic_update_slice"}
}

%_where_15.24 (Arg_0.40: pred[1,1,1,1,1984], Arg_1.40: bf16[1,8,4,1,1984], Arg_2.14: f32[]) -> bf16[1,8,4,1,1984] {
  %Arg_0.40 = pred[1,1,1,1,1984]{4,3,2,1,0} parameter(0)
  %broadcast_in_dim.33 = pred[1,1,1,1,1984]{4,3,2,1,0} broadcast(%Arg_0.40), dimensions={0,1,2,3,4}, metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.34 = pred[1,1,1984]{2,1,0} reshape(%broadcast_in_dim.33), metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.35 = pred[1,8,4,1,1984]{4,3,2,1,0} broadcast(%broadcast_in_dim.34), dimensions={0,3,4}, metadata={op_name="broadcast_in_dim"}
  %Arg_1.40 = bf16[1,8,4,1,1984]{4,3,2,1,0} parameter(1)
  %Arg_2.14 = f32[] parameter(2)
  %convert_element_type.20 = bf16[] convert(%Arg_2.14), metadata={op_name="convert_element_type"}
  %broadcast_in_dim.36 = bf16[1,8,4,1,1984]{4,3,2,1,0} broadcast(%convert_element_type.20), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.16 = bf16[1,8,4,1,1984]{4,3,2,1,0} select(%broadcast_in_dim.35, %Arg_1.40, %broadcast_in_dim.36), metadata={op_name="select_n"}
}

%region_5.25 (reduce_max.10: bf16[], reduce_max.11: bf16[]) -> bf16[] {
  %reduce_max.10 = bf16[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.11 = bf16[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.12 = bf16[] maximum(%reduce_max.10, %reduce_max.11), metadata={op_name="checkpoint/layers/reduce_max" stack_frame_id=33}
}

%region_4.22 (reduce_sum.10: f32[], reduce_sum.11: f32[]) -> f32[] {
  %reduce_sum.10 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.11 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.12 = f32[] add(%reduce_sum.10, %reduce_sum.11), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=29}
}

%region_6.26 (reduce_sum.17: f32[], reduce_sum.18: f32[]) -> f32[] {
  %reduce_sum.17 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.18 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.19 = f32[] add(%reduce_sum.17, %reduce_sum.18), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=34}
}

%region_7.27 (reduce_sum.24: f32[], reduce_sum.25: f32[]) -> f32[] {
  %reduce_sum.24 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.25 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.26 = f32[] add(%reduce_sum.24, %reduce_sum.25), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=37}
}

%silu.31 (Arg_0.42: bf16[1,1,8,14336]) -> bf16[1,1,8,14336] {
  %Arg_0.42 = bf16[1,1,8,14336]{3,2,1,0} parameter(0)
  %constant.78 = bf16[] constant(1)
  %broadcast.10 = bf16[1,1,8,14336]{3,2,1,0} broadcast(%constant.78), dimensions={}
  %neg.3 = bf16[1,1,8,14336]{3,2,1,0} negate(%Arg_0.42), metadata={op_name="neg"}
  %exp.8 = bf16[1,1,8,14336]{3,2,1,0} exponential(%neg.3), metadata={op_name="exp"}
  %add.23 = bf16[1,1,8,14336]{3,2,1,0} add(%exp.8, %broadcast.10), metadata={op_name="add"}
  %div.19 = bf16[1,1,8,14336]{3,2,1,0} divide(%broadcast.10, %add.23), metadata={op_name="div"}
  ROOT %mul.37 = bf16[1,1,8,14336]{3,2,1,0} multiply(%Arg_0.42, %div.19), metadata={op_name="mul"}
}

%region_8.28 (reduce_max.17: f32[], reduce_max.18: f32[]) -> f32[] {
  %reduce_max.17 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.18 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.19 = f32[] maximum(%reduce_max.17, %reduce_max.18), metadata={op_name="checkpoint/layers/reduce_max" stack_frame_id=42}
}

%region_9.29 (reduce_sum.31: f32[], reduce_sum.32: f32[]) -> f32[] {
  %reduce_sum.31 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.32 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.33 = f32[] add(%reduce_sum.31, %reduce_sum.32), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=42}
}

%region_10.30 (scatter.2: bf16[], scatter.3: bf16[]) -> bf16[] {
  %scatter.2 = bf16[] parameter(0), metadata={op_name="scatter"}
  ROOT %scatter.3 = bf16[] parameter(1), metadata={op_name="scatter"}
}

%_where.16 (Arg_0.31: pred[], Arg_1.31: s32[], Arg_2.6: s32[]) -> s32[] {
  %Arg_0.31 = pred[] parameter(0)
  %Arg_1.31 = s32[] parameter(1)
  %Arg_2.6 = s32[] parameter(2)
  ROOT %select_n.6 = s32[] select(%Arg_0.31, %Arg_1.31, %Arg_2.6), metadata={op_name="select_n"}
}

%remainder.17 (Arg_0.32: s32[1], Arg_1.32: s32[]) -> s32[1] {
  %Arg_0.32 = s32[1]{0} parameter(0)
  %Arg_1.32 = s32[] parameter(1)
  %constant.76 = s32[] constant(0)
  %eq.3 = pred[] compare(%Arg_1.32, %constant.76), direction=EQ, metadata={op_name="eq"}
  %constant.75 = s32[] constant(1)
  %jit__where_.1 = s32[] call(%eq.3, %constant.75, %Arg_1.32), to_apply=%_where.16, metadata={op_name="jit(_where)"}
  %rem.2 = s32[1]{0} reshape(%jit__where_.1), metadata={op_name="rem"}
  %rem.3 = s32[1]{0} remainder(%Arg_0.32, %rem.2), metadata={op_name="rem"}
  %constant.74 = s32[1]{0} constant({0})
  %lt.7 = pred[1]{0} compare(%rem.3, %constant.74), direction=LT, metadata={op_name="lt"}
  %lt.8 = pred[] compare(%jit__where_.1, %constant.76), direction=LT, metadata={op_name="lt"}
