HloModule jit__prefill_jit, entry_computation_layout={(s32[64]{0}, f32[5120]{0}, f32[5120,40,17408]{2,1,0}, f32[5120,40,17408]{2,1,0}, f32[17408,40,5120]{2,1,0}, /*index=5*/f32[5120,40]{1,0}, f32[5120,40]{1,0}, f32[5120,40,8,128]{3,2,1,0}, f32[128,40]{1,0}, f32[40,40,128,5120]{3,2,1,0}, /*index=10*/f32[5120,40,40,128]{3,2,1,0}, f32[128,40]{1,0}, f32[5120,40,8,128]{3,2,1,0}, f32[5120,151936]{1,0}, f32[151936,5120]{1,0}, /*index=15*/s32[])->(s32[40,1]{1,0}, s32[40,1,1984]{2,1,0}, s32[40,1,64]{2,1,0}, bf16[40,1984,8,1,128]{4,3,2,1,0}, s32[40,1]{1,0}, /*index=5*/bf16[40,1984,8,1,128]{4,3,2,1,0}, bf16[40,64,8,1,128]{4,3,2,1,0}, bf16[40,64,8,1,128]{4,3,2,1,0}, s32[1,1]{1,0}, f32[1,1,151936]{2,1,0}, /*index=10*/s32[1,1]{1,0}, f32[1,1]{1,0}, s32[1,1]{1,0}, s32[1,3]{1,0}, f32[1,1]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, num_partitions=8, frontend_attributes={xla.sdy.meshes={empty_mesh = #sdy.mesh<[]>, mesh = #sdy.mesh<["diloco"=1, "data"=1, "stage"=1, "fsdp"=1, "fsdp_transpose"=1, "context"=1, "context_autoregressive"=1, "tensor"=8, "tensor_transpose"=1, "tensor_sequence"=1, "expert"=1, "autoregressive"=1]>}}

FileNames
1 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/maxengine/maxengine.py"
2 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/models/models.py"
3 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/decoders.py"
4 "/usr/local/lib/python3.12/dist-packages/flax/core/axes_scan.py"
5 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/nnx_wrappers.py"
6 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/models/qwen3.py"
7 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/normalizations.py"
8 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/attentions.py"
9 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/attention_op.py"
10 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/utils/sharding.py"
11 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/linears.py"
12 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/embeddings.py"
13 "/usr/local/lib/python3.12/dist-packages/flax/nnx/pytreelib.py"
14 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/kvcache.py"
15 "<frozen runpy>"
16 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/decode.py"
17 "/usr/local/lib/python3.12/dist-packages/absl/app.py"
18 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/inference_utils.py"

FunctionNames
1 "MaxEngine._prefill_jit"
2 "TransformerLinenPure.apply"
3 "TransformerLinenPure.__call__"
4 "Decoder.__call__"
5 "scan.<locals>.scan_fn"
6 "scan.<locals>.scan_fn.<locals>.body_fn"
7 "ToLinen.__call__"
8 "Qwen3DecoderLayer.__call__"
9 "AttentionWithNorm.apply_attention_with_norm"
10 "_fix_for_qwix_quantization.<locals>.wrap.<locals>.wrapped"
11 "RMSNorm.__call__"
12 "Attention.__call__"
13 "AttentionOp.__call__"
14 "AttentionOp.apply_attention"
15 "AttentionOp.apply_attention_dot"
16 "AttentionOp.compute_local_attention"
17 "maybe_shard_with_logical"
18 "maybe_shard_with_name"
19 "Attention.kv_projection"
20 "DenseGeneral.__call__"
21 "_compute_dot_general_nnx"
22 "AttentionOp.generate_attention_mask"
23 "apply_mask_to_logits"
24 "Attention.apply_rotary_embedding"
25 "RotaryEmbedding.__call__"
26 "RotaryEmbedding.timescale"
27 "RotaryEmbedding.apply_rotary"
28 "RotaryEmbedding._rotate_half"
29 "Attention.query_projection"
30 "AttentionOp.qk_product"
31 "AttentionOp.wv_product"
32 "Attention.out_projection"
33 "MlpBlock.__call__"
34 "PytreeMeta.__call__"
35 "_graph_node_meta_call"
36 "PytreeMeta._pytree_meta_construct"
37 "Qwen3DecoderLayer.__init__"
38 "AttentionWithNorm.__init__"
39 "Attention.__init__"
40 "Attention.init_kv_caches"
41 "KVCache.__init__"
42 "KVCache._initialize_ar_cache_vars"
43 "Attention.update_kv_caches"
44 "KVCache.__call__"
45 "KVCache.kv_cache_prefill"
46 "_run_module_as_main"
47 "_run_code"
48 "<module>"
49 "run"
50 "_run_main"
51 "main"
52 "MaxEngine.prefill"
53 "Decoder.apply_output_head"
54 "sampling"
55 "Decoder._apply_embedding"
56 "Embed.__call__"
57 "scan.<locals>.transpose_to_front"
58 "scan.<locals>.transpose_to_front.<locals>.trans"

FileLocations
1 {file_name_id=1 function_name_id=1 line=798 end_line=815 column=32 end_column=9}
2 {file_name_id=2 function_name_id=2 line=71 end_line=71 column=11 end_column=51}
3 {file_name_id=2 function_name_id=3 line=202 end_line=215 column=38 end_column=5}
4 {file_name_id=3 function_name_id=4 line=1133 end_line=1142 column=19 end_column=41}
5 {file_name_id=4 function_name_id=5 line=200 end_line=203 column=14 end_column=7}
6 {file_name_id=4 function_name_id=6 line=157 end_line=157 column=29 end_column=53}
7 {file_name_id=5 function_name_id=7 line=549 end_line=549 column=10 end_column=44}
8 {file_name_id=6 function_name_id=8 line=1520 end_line=1528 column=51 end_column=5}
9 {file_name_id=6 function_name_id=9 line=1454 end_line=1454 column=10 end_column=52}
10 {file_name_id=5 function_name_id=10 line=383 end_line=383 column=15 end_column=39}
11 {file_name_id=7 function_name_id=11 line=72 end_line=72 column=12 end_column=59}
12 {file_name_id=6 function_name_id=9 line=1457 end_line=1466 column=30 end_column=5}
13 {file_name_id=8 function_name_id=12 line=1160 end_line=1160 column=14 end_column=36}
14 {file_name_id=8 function_name_id=12 line=1162 end_line=1162 column=14 end_column=32}
15 {file_name_id=8 function_name_id=12 line=1225 end_line=1236 column=12 end_column=7}
16 {file_name_id=9 function_name_id=13 line=2106 end_line=2123 column=86 end_column=5}
17 {file_name_id=9 function_name_id=14 line=972 end_line=986 column=13 end_column=7}
18 {file_name_id=9 function_name_id=15 line=1919 end_line=1919 column=11 end_column=109}
19 {file_name_id=9 function_name_id=16 line=1770 end_line=1770 column=16 end_column=55}
20 {file_name_id=9 function_name_id=16 line=1772 end_line=1772 column=16 end_column=68}
21 {file_name_id=6 function_name_id=9 line=1471 end_line=1471 column=20 end_column=76}
22 {file_name_id=7 function_name_id=11 line=90 end_line=90 column=12 end_column=42}
23 {file_name_id=7 function_name_id=11 line=71 end_line=71 column=8 end_column=35}
24 {file_name_id=7 function_name_id=11 line=72 end_line=72 column=21 end_column=34}
25 {file_name_id=7 function_name_id=11 line=73 end_line=73 column=34 end_column=54}
26 {file_name_id=7 function_name_id=11 line=73 end_line=73 column=24 end_column=55}
27 {file_name_id=7 function_name_id=11 line=73 end_line=73 column=20 end_column=55}
28 {file_name_id=7 function_name_id=11 line=73 end_line=73 column=8 end_column=68}
29 {file_name_id=7 function_name_id=11 line=92 end_line=92 column=11 end_column=84}
30 {file_name_id=8 function_name_id=12 line=1125 end_line=1125 column=16 end_column=75}
31 {file_name_id=10 function_name_id=17 line=147 end_line=155 column=9 end_column=3}
32 {file_name_id=10 function_name_id=18 line=113 end_line=113 column=11 end_column=67}
33 {file_name_id=8 function_name_id=12 line=1147 end_line=1147 column=16 end_column=91}
34 {file_name_id=8 function_name_id=19 line=670 end_line=670 column=13 end_column=61}
35 {file_name_id=11 function_name_id=20 line=231 end_line=231 column=15 end_column=46}
36 {file_name_id=11 function_name_id=20 line=238 end_line=247 column=13 end_column=5}
37 {file_name_id=11 function_name_id=21 line=102 end_line=104 column=9 end_column=3}
38 {file_name_id=8 function_name_id=12 line=1197 end_line=1197 column=14 end_column=82}
39 {file_name_id=9 function_name_id=15 line=1866 end_line=1874 column=16 end_column=5}
40 {file_name_id=9 function_name_id=22 line=700 end_line=700 column=13 end_column=44}
41 {file_name_id=9 function_name_id=22 line=700 end_line=700 column=48 end_column=79}
42 {file_name_id=9 function_name_id=22 line=701 end_line=701 column=13 end_column=38}
43 {file_name_id=9 function_name_id=22 line=723 end_line=723 column=16 end_column=66}
44 {file_name_id=9 function_name_id=22 line=722 end_line=722 column=16 end_column=66}
45 {file_name_id=9 function_name_id=22 line=726 end_line=726 column=21 end_column=50}
46 {file_name_id=9 function_name_id=22 line=726 end_line=726 column=20 end_column=75}
47 {file_name_id=9 function_name_id=22 line=730 end_line=730 column=20 end_column=54}
48 {file_name_id=9 function_name_id=22 line=787 end_line=787 column=11 end_column=58}
49 {file_name_id=9 function_name_id=15 line=1906 end_line=1906 column=21 end_column=66}
50 {file_name_id=9 function_name_id=23 line=121 end_line=121 column=20 end_column=52}
51 {file_name_id=8 function_name_id=12 line=1143 end_line=1143 column=12 end_column=85}
52 {file_name_id=8 function_name_id=19 line=668 end_line=668 column=13 end_column=59}
53 {file_name_id=8 function_name_id=12 line=1174 end_line=1174 column=14 end_column=106}
54 {file_name_id=8 function_name_id=24 line=935 end_line=935 column=13 end_column=60}
55 {file_name_id=12 function_name_id=25 line=359 end_line=359 column=15 end_column=55}
56 {file_name_id=12 function_name_id=25 line=360 end_line=360 column=19 end_column=44}
57 {file_name_id=12 function_name_id=25 line=360 end_line=360 column=30 end_column=44}
58 {file_name_id=12 function_name_id=26 line=317 end_line=317 column=19 end_column=52}
59 {file_name_id=12 function_name_id=26 line=317 end_line=317 column=15 end_column=52}
60 {file_name_id=12 function_name_id=26 line=318 end_line=318 column=37 end_column=90}
61 {file_name_id=12 function_name_id=25 line=362 end_line=362 column=15 end_column=36}
62 {file_name_id=12 function_name_id=25 line=365 end_line=365 column=10 end_column=56}
63 {file_name_id=12 function_name_id=25 line=367 end_line=367 column=12 end_column=47}
64 {file_name_id=12 function_name_id=27 line=330 end_line=330 column=12 end_column=24}
65 {file_name_id=12 function_name_id=27 line=330 end_line=330 column=29 end_column=54}
66 {file_name_id=12 function_name_id=28 line=325 end_line=325 column=13 end_column=37}
67 {file_name_id=12 function_name_id=28 line=326 end_line=326 column=28 end_column=31}
68 {file_name_id=12 function_name_id=28 line=326 end_line=326 column=11 end_column=46}
69 {file_name_id=12 function_name_id=25 line=361 end_line=361 column=15 end_column=36}
70 {file_name_id=12 function_name_id=25 line=364 end_line=364 column=10 end_column=56}
71 {file_name_id=12 function_name_id=27 line=330 end_line=330 column=11 end_column=61}
72 {file_name_id=8 function_name_id=12 line=1196 end_line=1196 column=12 end_column=76}
73 {file_name_id=8 function_name_id=12 line=1124 end_line=1124 column=15 end_column=73}
74 {file_name_id=8 function_name_id=12 line=1142 end_line=1142 column=14 end_column=72}
75 {file_name_id=8 function_name_id=29 line=614 end_line=614 column=11 end_column=58}
76 {file_name_id=8 function_name_id=12 line=1172 end_line=1172 column=14 end_column=108}
77 {file_name_id=8 function_name_id=12 line=1184 end_line=1184 column=14 end_column=48}
78 {file_name_id=8 function_name_id=12 line=1195 end_line=1195 column=14 end_column=82}
79 {file_name_id=9 function_name_id=15 line=1850 end_line=1850 column=19 end_column=88}
80 {file_name_id=9 function_name_id=30 line=1957 end_line=1957 column=14 end_column=60}
81 {file_name_id=9 function_name_id=30 line=1960 end_line=1960 column=15 end_column=74}
82 {file_name_id=9 function_name_id=23 line=121 end_line=121 column=9 end_column=82}
83 {file_name_id=9 function_name_id=16 line=1761 end_line=1761 column=13 end_column=54}
84 {file_name_id=9 function_name_id=16 line=1771 end_line=1771 column=34 end_column=52}
85 {file_name_id=9 function_name_id=16 line=1771 end_line=1771 column=26 end_column=53}
86 {file_name_id=9 function_name_id=16 line=1776 end_line=1776 column=17 end_column=60}
87 {file_name_id=9 function_name_id=16 line=1780 end_line=1780 column=16 end_column=81}
88 {file_name_id=9 function_name_id=31 line=2010 end_line=2010 column=12 end_column=80}
89 {file_name_id=9 function_name_id=31 line=2012 end_line=2012 column=15 end_column=52}
90 {file_name_id=9 function_name_id=16 line=1778 end_line=1778 column=16 end_column=54}
91 {file_name_id=9 function_name_id=13 line=2128 end_line=2128 column=15 end_column=69}
92 {file_name_id=8 function_name_id=12 line=1239 end_line=1239 column=12 end_column=76}
93 {file_name_id=8 function_name_id=12 line=1247 end_line=1247 column=10 end_column=61}
94 {file_name_id=8 function_name_id=32 line=733 end_line=733 column=11 end_column=51}
95 {file_name_id=6 function_name_id=9 line=1469 end_line=1469 column=26 end_column=48}
96 {file_name_id=6 function_name_id=8 line=1530 end_line=1530 column=14 end_column=66}
97 {file_name_id=11 function_name_id=33 line=517 end_line=517 column=12 end_column=62}
98 {file_name_id=11 function_name_id=33 line=521 end_line=521 column=12 end_column=54}
99 {file_name_id=11 function_name_id=33 line=525 end_line=525 column=8 end_column=51}
100 {file_name_id=11 function_name_id=33 line=528 end_line=528 column=8 end_column=68}
101 {file_name_id=11 function_name_id=33 line=529 end_line=529 column=13 end_column=50}
102 {file_name_id=6 function_name_id=8 line=1533 end_line=1533 column=19 end_column=48}
103 {file_name_id=5 function_name_id=7 line=488 end_line=488 column=13 end_column=59}
104 {file_name_id=13 function_name_id=34 line=420 end_line=420 column=13 end_column=56}
105 {file_name_id=13 function_name_id=35 line=431 end_line=431 column=2 end_column=51}
106 {file_name_id=13 function_name_id=36 line=423 end_line=423 column=4 end_column=34}
107 {file_name_id=6 function_name_id=37 line=1490 end_line=1490 column=4 end_column=59}
108 {file_name_id=6 function_name_id=38 line=1402 end_line=1428 column=26 end_column=5}
109 {file_name_id=8 function_name_id=39 line=438 end_line=438 column=8 end_column=60}
110 {file_name_id=8 function_name_id=40 line=956 end_line=973 column=11 end_column=5}
111 {file_name_id=14 function_name_id=41 line=332 end_line=332 column=6 end_column=48}
112 {file_name_id=14 function_name_id=42 line=513 end_line=513 column=8 end_column=74}
113 {file_name_id=8 function_name_id=12 line=1224 end_line=1224 column=24 end_column=106}
114 {file_name_id=8 function_name_id=43 line=994 end_line=1001 column=36 end_column=5}
115 {file_name_id=14 function_name_id=44 line=957 end_line=957 column=15 end_column=69}
116 {file_name_id=14 function_name_id=45 line=699 end_line=699 column=27 end_column=76}
117 {file_name_id=14 function_name_id=45 line=700 end_line=700 column=29 end_column=80}
118 {file_name_id=15 function_name_id=46 line=198 end_line=199 column=11 end_column=42}
119 {file_name_id=15 function_name_id=47 line=88 end_line=88 column=4 end_column=27}
120 {file_name_id=16 function_name_id=48 line=245 end_line=245 column=2 end_column=15}
121 {file_name_id=17 function_name_id=49 line=410 end_line=410 column=6 end_column=27}
122 {file_name_id=17 function_name_id=50 line=355 end_line=355 column=13 end_column=23}
123 {file_name_id=16 function_name_id=51 line=181 end_line=194 column=36 end_column=7}
124 {file_name_id=1 function_name_id=52 line=913 end_line=934 column=11 end_column=5}
125 {file_name_id=3 function_name_id=4 line=1289 end_line=1289 column=15 end_column=96}
126 {file_name_id=3 function_name_id=53 line=795 end_line=802 column=8 end_column=40}
127 {file_name_id=1 function_name_id=1 line=831 end_line=838 column=28 end_column=5}
128 {file_name_id=18 function_name_id=54 line=135 end_line=135 column=11 end_column=38}
129 {file_name_id=3 function_name_id=4 line=872 end_line=879 column=8 end_column=5}
130 {file_name_id=3 function_name_id=55 line=706 end_line=706 column=8 end_column=85}
131 {file_name_id=12 function_name_id=56 line=155 end_line=158 column=16 end_column=5}
132 {file_name_id=1 function_name_id=1 line=747 end_line=747 column=19 end_column=52}
133 {file_name_id=12 function_name_id=56 line=182 end_line=182 column=15 end_column=66}
134 {file_name_id=4 function_name_id=5 line=150 end_line=150 column=9 end_column=66}
135 {file_name_id=4 function_name_id=57 line=126 end_line=126 column=11 end_column=44}
136 {file_name_id=4 function_name_id=58 line=124 end_line=124 column=13 end_column=35}
137 {file_name_id=1 function_name_id=1 line=766 end_line=766 column=17 end_column=83}
138 {file_name_id=1 function_name_id=1 line=767 end_line=767 column=19 end_column=48}
139 {file_name_id=1 function_name_id=1 line=768 end_line=768 column=19 end_column=68}
140 {file_name_id=1 function_name_id=1 line=769 end_line=769 column=25 end_column=57}
141 {file_name_id=1 function_name_id=1 line=753 end_line=753 column=34 end_column=100}
142 {file_name_id=1 function_name_id=1 line=753 end_line=753 column=18 end_column=104}
143 {file_name_id=3 function_name_id=53 line=831 end_line=844 column=15 end_column=7}
144 {file_name_id=3 function_name_id=53 line=847 end_line=847 column=15 end_column=41}
145 {file_name_id=1 function_name_id=1 line=824 end_line=824 column=12 end_column=27}
146 {file_name_id=1 function_name_id=1 line=822 end_line=826 column=22 end_column=5}
147 {file_name_id=1 function_name_id=1 line=827 end_line=827 column=22 end_column=97}
148 {file_name_id=1 function_name_id=1 line=865 end_line=865 column=17 end_column=68}
149 {file_name_id=1 function_name_id=1 line=846 end_line=846 column=13 end_column=90}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=1}
7 {file_location_id=7 parent_frame_id=7}
8 {file_location_id=8 parent_frame_id=8}
9 {file_location_id=9 parent_frame_id=9}
10 {file_location_id=10 parent_frame_id=10}
11 {file_location_id=11 parent_frame_id=11}
12 {file_location_id=12 parent_frame_id=9}
13 {file_location_id=10 parent_frame_id=13}
14 {file_location_id=13 parent_frame_id=14}
15 {file_location_id=10 parent_frame_id=15}
16 {file_location_id=11 parent_frame_id=16}
17 {file_location_id=14 parent_frame_id=14}
18 {file_location_id=10 parent_frame_id=18}
19 {file_location_id=11 parent_frame_id=19}
20 {file_location_id=15 parent_frame_id=14}
21 {file_location_id=10 parent_frame_id=21}
22 {file_location_id=16 parent_frame_id=22}
23 {file_location_id=17 parent_frame_id=23}
24 {file_location_id=18 parent_frame_id=24}
25 {file_location_id=19 parent_frame_id=25}
26 {file_location_id=20 parent_frame_id=25}
27 {file_location_id=21 parent_frame_id=9}
28 {file_location_id=10 parent_frame_id=28}
29 {file_location_id=11 parent_frame_id=29}
30 {file_location_id=22 parent_frame_id=11}
31 {file_location_id=23 parent_frame_id=11}
32 {file_location_id=24 parent_frame_id=11}
33 {file_location_id=25 parent_frame_id=11}
34 {file_location_id=26 parent_frame_id=11}
35 {file_location_id=27 parent_frame_id=11}
36 {file_location_id=28 parent_frame_id=11}
37 {file_location_id=29 parent_frame_id=11}
38 {file_location_id=30 parent_frame_id=14}
39 {file_location_id=31 parent_frame_id=39}
40 {file_location_id=32 parent_frame_id=40}
41 {file_location_id=33 parent_frame_id=14}
42 {file_location_id=34 parent_frame_id=42}
43 {file_location_id=10 parent_frame_id=43}
44 {file_location_id=35 parent_frame_id=44}
45 {file_location_id=36 parent_frame_id=44}
46 {file_location_id=37 parent_frame_id=46}
47 {file_location_id=38 parent_frame_id=14}
48 {file_location_id=31 parent_frame_id=48}
49 {file_location_id=32 parent_frame_id=49}
50 {file_location_id=39 parent_frame_id=24}
51 {file_location_id=40 parent_frame_id=51}
52 {file_location_id=41 parent_frame_id=51}
53 {file_location_id=42 parent_frame_id=51}
54 {file_location_id=43 parent_frame_id=51}
55 {file_location_id=44 parent_frame_id=51}
56 {file_location_id=45 parent_frame_id=51}
57 {file_location_id=46 parent_frame_id=51}
58 {file_location_id=47 parent_frame_id=51}
59 {file_location_id=48 parent_frame_id=51}
60 {file_location_id=49 parent_frame_id=24}
61 {file_location_id=50 parent_frame_id=61}
62 {file_location_id=22 parent_frame_id=19}
63 {file_location_id=51 parent_frame_id=14}
64 {file_location_id=52 parent_frame_id=64}
65 {file_location_id=10 parent_frame_id=65}
66 {file_location_id=35 parent_frame_id=66}
67 {file_location_id=36 parent_frame_id=66}
68 {file_location_id=37 parent_frame_id=68}
69 {file_location_id=23 parent_frame_id=19}
70 {file_location_id=24 parent_frame_id=19}
71 {file_location_id=25 parent_frame_id=19}
72 {file_location_id=26 parent_frame_id=19}
73 {file_location_id=27 parent_frame_id=19}
74 {file_location_id=28 parent_frame_id=19}
75 {file_location_id=29 parent_frame_id=19}
76 {file_location_id=53 parent_frame_id=14}
77 {file_location_id=54 parent_frame_id=77}
78 {file_location_id=10 parent_frame_id=78}
79 {file_location_id=55 parent_frame_id=79}
80 {file_location_id=56 parent_frame_id=79}
81 {file_location_id=57 parent_frame_id=79}
82 {file_location_id=58 parent_frame_id=82}
83 {file_location_id=59 parent_frame_id=82}
84 {file_location_id=60 parent_frame_id=82}
85 {file_location_id=61 parent_frame_id=79}
86 {file_location_id=62 parent_frame_id=79}
87 {file_location_id=63 parent_frame_id=79}
88 {file_location_id=64 parent_frame_id=88}
89 {file_location_id=65 parent_frame_id=88}
90 {file_location_id=66 parent_frame_id=90}
91 {file_location_id=67 parent_frame_id=90}
92 {file_location_id=68 parent_frame_id=90}
93 {file_location_id=69 parent_frame_id=79}
94 {file_location_id=70 parent_frame_id=79}
95 {file_location_id=71 parent_frame_id=88}
96 {file_location_id=72 parent_frame_id=14}
97 {file_location_id=31 parent_frame_id=97}
98 {file_location_id=32 parent_frame_id=98}
99 {file_location_id=22 parent_frame_id=16}
100 {file_location_id=73 parent_frame_id=14}
101 {file_location_id=31 parent_frame_id=101}
102 {file_location_id=32 parent_frame_id=102}
103 {file_location_id=74 parent_frame_id=14}
104 {file_location_id=75 parent_frame_id=104}
105 {file_location_id=10 parent_frame_id=105}
106 {file_location_id=35 parent_frame_id=106}
107 {file_location_id=36 parent_frame_id=106}
108 {file_location_id=37 parent_frame_id=108}
109 {file_location_id=23 parent_frame_id=16}
110 {file_location_id=24 parent_frame_id=16}
111 {file_location_id=25 parent_frame_id=16}
112 {file_location_id=26 parent_frame_id=16}
113 {file_location_id=27 parent_frame_id=16}
114 {file_location_id=28 parent_frame_id=16}
115 {file_location_id=29 parent_frame_id=16}
116 {file_location_id=76 parent_frame_id=14}
117 {file_location_id=54 parent_frame_id=117}
118 {file_location_id=10 parent_frame_id=118}
119 {file_location_id=55 parent_frame_id=119}
120 {file_location_id=56 parent_frame_id=119}
121 {file_location_id=57 parent_frame_id=119}
122 {file_location_id=58 parent_frame_id=122}
123 {file_location_id=59 parent_frame_id=122}
124 {file_location_id=60 parent_frame_id=122}
125 {file_location_id=61 parent_frame_id=119}
126 {file_location_id=62 parent_frame_id=119}
127 {file_location_id=63 parent_frame_id=119}
128 {file_location_id=64 parent_frame_id=128}
129 {file_location_id=65 parent_frame_id=128}
130 {file_location_id=66 parent_frame_id=130}
131 {file_location_id=67 parent_frame_id=130}
132 {file_location_id=68 parent_frame_id=130}
133 {file_location_id=69 parent_frame_id=119}
134 {file_location_id=70 parent_frame_id=119}
135 {file_location_id=71 parent_frame_id=128}
136 {file_location_id=77 parent_frame_id=14}
137 {file_location_id=78 parent_frame_id=14}
138 {file_location_id=31 parent_frame_id=138}
139 {file_location_id=32 parent_frame_id=139}
140 {file_location_id=79 parent_frame_id=24}
141 {file_location_id=80 parent_frame_id=141}
142 {file_location_id=81 parent_frame_id=141}
143 {file_location_id=82 parent_frame_id=61}
144 {file_location_id=83 parent_frame_id=25}
145 {file_location_id=84 parent_frame_id=25}
146 {file_location_id=85 parent_frame_id=25}
147 {file_location_id=86 parent_frame_id=25}
148 {file_location_id=87 parent_frame_id=25}
149 {file_location_id=88 parent_frame_id=149}
150 {file_location_id=89 parent_frame_id=149}
151 {file_location_id=90 parent_frame_id=25}
152 {file_location_id=91 parent_frame_id=22}
153 {file_location_id=92 parent_frame_id=14}
154 {file_location_id=31 parent_frame_id=154}
155 {file_location_id=32 parent_frame_id=155}
156 {file_location_id=93 parent_frame_id=14}
157 {file_location_id=94 parent_frame_id=157}
158 {file_location_id=10 parent_frame_id=158}
159 {file_location_id=35 parent_frame_id=159}
160 {file_location_id=36 parent_frame_id=159}
161 {file_location_id=37 parent_frame_id=161}
162 {file_location_id=95 parent_frame_id=9}
163 {file_location_id=22 parent_frame_id=29}
164 {file_location_id=23 parent_frame_id=29}
165 {file_location_id=24 parent_frame_id=29}
166 {file_location_id=25 parent_frame_id=29}
167 {file_location_id=26 parent_frame_id=29}
168 {file_location_id=27 parent_frame_id=29}
169 {file_location_id=28 parent_frame_id=29}
170 {file_location_id=29 parent_frame_id=29}
171 {file_location_id=96 parent_frame_id=8}
172 {file_location_id=10 parent_frame_id=172}
173 {file_location_id=97 parent_frame_id=173}
174 {file_location_id=10 parent_frame_id=174}
175 {file_location_id=35 parent_frame_id=175}
176 {file_location_id=36 parent_frame_id=175}
177 {file_location_id=37 parent_frame_id=177}
178 {file_location_id=98 parent_frame_id=173}
179 {file_location_id=99 parent_frame_id=173}
180 {file_location_id=100 parent_frame_id=173}
181 {file_location_id=31 parent_frame_id=181}
182 {file_location_id=32 parent_frame_id=182}
183 {file_location_id=101 parent_frame_id=173}
184 {file_location_id=10 parent_frame_id=184}
185 {file_location_id=35 parent_frame_id=185}
186 {file_location_id=36 parent_frame_id=185}
187 {file_location_id=37 parent_frame_id=187}
188 {file_location_id=102 parent_frame_id=8}
189 {file_location_id=103 parent_frame_id=7}
190 {file_location_id=104 parent_frame_id=190}
191 {file_location_id=105 parent_frame_id=191}
192 {file_location_id=106 parent_frame_id=192}
193 {file_location_id=107 parent_frame_id=193}
194 {file_location_id=108 parent_frame_id=194}
195 {file_location_id=104 parent_frame_id=195}
196 {file_location_id=105 parent_frame_id=196}
197 {file_location_id=106 parent_frame_id=197}
198 {file_location_id=109 parent_frame_id=198}
199 {file_location_id=110 parent_frame_id=199}
200 {file_location_id=104 parent_frame_id=200}
201 {file_location_id=105 parent_frame_id=201}
202 {file_location_id=106 parent_frame_id=202}
203 {file_location_id=111 parent_frame_id=203}
204 {file_location_id=112 parent_frame_id=204}
205 {file_location_id=113 parent_frame_id=14}
206 {file_location_id=114 parent_frame_id=206}
207 {file_location_id=10 parent_frame_id=207}
208 {file_location_id=115 parent_frame_id=208}
209 {file_location_id=116 parent_frame_id=209}
210 {file_location_id=117 parent_frame_id=209}
211 {file_location_id=118 parent_frame_id=1}
212 {file_location_id=119 parent_frame_id=212}
213 {file_location_id=120 parent_frame_id=213}
214 {file_location_id=121 parent_frame_id=214}
215 {file_location_id=122 parent_frame_id=215}
216 {file_location_id=123 parent_frame_id=216}
217 {file_location_id=124 parent_frame_id=217}
218 {file_location_id=1 parent_frame_id=218}
219 {file_location_id=2 parent_frame_id=219}
220 {file_location_id=3 parent_frame_id=220}
221 {file_location_id=4 parent_frame_id=221}
222 {file_location_id=5 parent_frame_id=222}
223 {file_location_id=1 parent_frame_id=223}
224 {file_location_id=2 parent_frame_id=224}
225 {file_location_id=3 parent_frame_id=225}
226 {file_location_id=4 parent_frame_id=226}
227 {file_location_id=5 parent_frame_id=227}
228 {file_location_id=1 parent_frame_id=228}
229 {file_location_id=2 parent_frame_id=229}
230 {file_location_id=3 parent_frame_id=230}
231 {file_location_id=4 parent_frame_id=231}
232 {file_location_id=5 parent_frame_id=232}
233 {file_location_id=125 parent_frame_id=221}
234 {file_location_id=126 parent_frame_id=234}
235 {file_location_id=7 parent_frame_id=235}
236 {file_location_id=11 parent_frame_id=236}
237 {file_location_id=127 parent_frame_id=1}
238 {file_location_id=128 parent_frame_id=238}
239 {file_location_id=127 parent_frame_id=239}
240 {file_location_id=128 parent_frame_id=240}
241 {file_location_id=129 parent_frame_id=221}
242 {file_location_id=130 parent_frame_id=242}
243 {file_location_id=7 parent_frame_id=243}
244 {file_location_id=131 parent_frame_id=244}
245 {file_location_id=132 parent_frame_id=218}
246 {file_location_id=133 parent_frame_id=244}
247 {file_location_id=134 parent_frame_id=222}
248 {file_location_id=135 parent_frame_id=248}
249 {file_location_id=136 parent_frame_id=249}
250 {file_location_id=137 parent_frame_id=218}
251 {file_location_id=138 parent_frame_id=218}
252 {file_location_id=139 parent_frame_id=218}
253 {file_location_id=140 parent_frame_id=218}
254 {file_location_id=141 parent_frame_id=218}
255 {file_location_id=142 parent_frame_id=218}
256 {file_location_id=22 parent_frame_id=236}
257 {file_location_id=23 parent_frame_id=236}
258 {file_location_id=24 parent_frame_id=236}
259 {file_location_id=25 parent_frame_id=236}
260 {file_location_id=26 parent_frame_id=236}
261 {file_location_id=27 parent_frame_id=236}
262 {file_location_id=28 parent_frame_id=236}
263 {file_location_id=29 parent_frame_id=236}
264 {file_location_id=143 parent_frame_id=234}
265 {file_location_id=7 parent_frame_id=265}
266 {file_location_id=35 parent_frame_id=266}
267 {file_location_id=36 parent_frame_id=266}
268 {file_location_id=37 parent_frame_id=268}
269 {file_location_id=144 parent_frame_id=234}
270 {file_location_id=145 parent_frame_id=218}
271 {file_location_id=146 parent_frame_id=218}
272 {file_location_id=147 parent_frame_id=218}
273 {file_location_id=148 parent_frame_id=218}
274 {file_location_id=127 parent_frame_id=218}
275 {file_location_id=128 parent_frame_id=275}
276 {file_location_id=149 parent_frame_id=218}


%dynamic_index_in_dim.1 (Arg_0.1: f32[40,5120,17408], Arg_1.1: s32[]) -> f32[5120,17408] {
  %Arg_0.1 = f32[40,5120,17408]{2,1,0} parameter(0)
  %Arg_1.1 = s32[] parameter(1)
  %constant.18 = s32[] constant(0)
  %dynamic_slice.1 = f32[1,5120,17408]{2,1,0} dynamic-slice(%Arg_0.1, %Arg_1.1, %constant.18, %constant.18), dynamic_slice_sizes={1,5120,17408}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.1 = f32[5120,17408]{1,0} reshape(%dynamic_slice.1), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_0.2 (Arg_0.3: f32[40,17408,5120], Arg_1.3: s32[]) -> f32[17408,5120] {
  %Arg_0.3 = f32[40,17408,5120]{2,1,0} parameter(0)
  %Arg_1.3 = s32[] parameter(1)
  %constant.20 = s32[] constant(0)
  %dynamic_slice.3 = f32[1,17408,5120]{2,1,0} dynamic-slice(%Arg_0.3, %Arg_1.3, %constant.20, %constant.20), dynamic_slice_sizes={1,17408,5120}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.3 = f32[17408,5120]{1,0} reshape(%dynamic_slice.3), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_1.3 (Arg_0.5: f32[40,5120], Arg_1.5: s32[]) -> f32[5120] {
  %Arg_0.5 = f32[40,5120]{1,0} parameter(0)
  %Arg_1.5 = s32[] parameter(1)
  %constant.22 = s32[] constant(0)
  %dynamic_slice.5 = f32[1,5120]{1,0} dynamic-slice(%Arg_0.5, %Arg_1.5, %constant.22), dynamic_slice_sizes={1,5120}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.5 = f32[5120]{0} reshape(%dynamic_slice.5), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_2.4 (Arg_0.7: f32[40,5120,8,128], Arg_1.7: s32[]) -> f32[5120,8,128] {
  %Arg_0.7 = f32[40,5120,8,128]{3,2,1,0} parameter(0)
  %Arg_1.7 = s32[] parameter(1)
  %constant.24 = s32[] constant(0)
  %dynamic_slice.7 = f32[1,5120,8,128]{3,2,1,0} dynamic-slice(%Arg_0.7, %Arg_1.7, %constant.24, %constant.24, %constant.24), dynamic_slice_sizes={1,5120,8,128}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.7 = f32[5120,8,128]{2,1,0} reshape(%dynamic_slice.7), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_3.5 (Arg_0.9: f32[40,128], Arg_1.9: s32[]) -> f32[128] {
  %Arg_0.9 = f32[40,128]{1,0} parameter(0)
  %Arg_1.9 = s32[] parameter(1)
  %constant.26 = s32[] constant(0)
  %dynamic_slice.9 = f32[1,128]{1,0} dynamic-slice(%Arg_0.9, %Arg_1.9, %constant.26), dynamic_slice_sizes={1,128}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.9 = f32[128]{0} reshape(%dynamic_slice.9), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_4.6 (Arg_0.11: f32[40,40,128,5120], Arg_1.11: s32[]) -> f32[40,128,5120] {
  %Arg_0.11 = f32[40,40,128,5120]{3,2,1,0} parameter(0)
  %Arg_1.11 = s32[] parameter(1)
  %constant.28 = s32[] constant(0)
  %dynamic_slice.11 = f32[1,40,128,5120]{3,2,1,0} dynamic-slice(%Arg_0.11, %Arg_1.11, %constant.28, %constant.28, %constant.28), dynamic_slice_sizes={1,40,128,5120}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.11 = f32[40,128,5120]{2,1,0} reshape(%dynamic_slice.11), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_5.7 (Arg_0.13: f32[40,5120,40,128], Arg_1.13: s32[]) -> f32[5120,40,128] {
  %Arg_0.13 = f32[40,5120,40,128]{3,2,1,0} parameter(0)
  %Arg_1.13 = s32[] parameter(1)
  %constant.30 = s32[] constant(0)
  %dynamic_slice.13 = f32[1,5120,40,128]{3,2,1,0} dynamic-slice(%Arg_0.13, %Arg_1.13, %constant.30, %constant.30, %constant.30), dynamic_slice_sizes={1,5120,40,128}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.13 = f32[5120,40,128]{2,1,0} reshape(%dynamic_slice.13), metadata={op_name="squeeze" stack_frame_id=5}
}

%region_1.8 (reduce_sum.3: f32[], reduce_sum.4: f32[]) -> f32[] {
  %reduce_sum.3 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.4 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.5 = f32[] add(%reduce_sum.3, %reduce_sum.4), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=11}
}

%_where.11 (Arg_0.16: pred[1,1,1,64,64], Arg_1.16: f32[], Arg_2.2: f32[]) -> f32[1,1,1,64,64] {
  %Arg_0.16 = pred[1,1,1,64,64]{4,3,2,1,0} parameter(0)
  %Arg_1.16 = f32[] parameter(1)
  %broadcast_in_dim.20 = f32[1,1,1,64,64]{4,3,2,1,0} broadcast(%Arg_1.16), dimensions={}, metadata={op_name="broadcast_in_dim"}
  %Arg_2.2 = f32[] parameter(2)
  %broadcast_in_dim.21 = f32[1,1,1,64,64]{4,3,2,1,0} broadcast(%Arg_2.2), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.2 = f32[1,1,1,64,64]{4,3,2,1,0} select(%Arg_0.16, %broadcast_in_dim.20, %broadcast_in_dim.21), metadata={op_name="select_n"}
}

%region_3.10 (reduce_sum.17: f32[], reduce_sum.18: f32[]) -> f32[] {
  %reduce_sum.17 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.18 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.19 = f32[] add(%reduce_sum.17, %reduce_sum.18), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=19}
}

%region_2.9 (reduce_sum.10: f32[], reduce_sum.11: f32[]) -> f32[] {
  %reduce_sum.10 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.11 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.12 = f32[] add(%reduce_sum.10, %reduce_sum.11), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=16}
}

%_where_6.12 (Arg_0.18: pred[1,1,1,64,64], Arg_1.18: bf16[1,8,5,64,64], Arg_2.4: f32[]) -> bf16[1,8,5,64,64] {
  %Arg_0.18 = pred[1,1,1,64,64]{4,3,2,1,0} parameter(0)
  %broadcast_in_dim.26 = pred[1,1,1,64,64]{4,3,2,1,0} broadcast(%Arg_0.18), dimensions={0,1,2,3,4}, metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.27 = pred[1,64,64]{2,1,0} reshape(%broadcast_in_dim.26), metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.28 = pred[1,8,5,64,64]{4,3,2,1,0} broadcast(%broadcast_in_dim.27), dimensions={0,3,4}, metadata={op_name="broadcast_in_dim"}
  %Arg_1.18 = bf16[1,8,5,64,64]{4,3,2,1,0} parameter(1)
  %Arg_2.4 = f32[] parameter(2)
  %convert_element_type.23 = bf16[] convert(%Arg_2.4), metadata={op_name="convert_element_type"}
  %broadcast_in_dim.29 = bf16[1,8,5,64,64]{4,3,2,1,0} broadcast(%convert_element_type.23), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.4 = bf16[1,8,5,64,64]{4,3,2,1,0} select(%broadcast_in_dim.28, %Arg_1.18, %broadcast_in_dim.29), metadata={op_name="select_n"}
}

%region_4.13 (reduce_max.3: bf16[], reduce_max.4: bf16[]) -> bf16[] {
  %reduce_max.3 = bf16[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.4 = bf16[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.5 = bf16[] maximum(%reduce_max.3, %reduce_max.4), metadata={op_name="checkpoint/layers/reduce_max" stack_frame_id=25}
}

%region_5.14 (reduce_sum.24: f32[], reduce_sum.25: f32[]) -> f32[] {
  %reduce_sum.24 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.25 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.26 = f32[] add(%reduce_sum.24, %reduce_sum.25), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=26}
}

%region_6.15 (reduce_sum.31: f32[], reduce_sum.32: f32[]) -> f32[] {
  %reduce_sum.31 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.32 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.33 = f32[] add(%reduce_sum.31, %reduce_sum.32), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=29}
}

%silu.16 (Arg_0.20: bf16[1,64,17408]) -> bf16[1,64,17408] {
  %Arg_0.20 = bf16[1,64,17408]{2,1,0} parameter(0)
  %constant.49 = bf16[] constant(1)
  %broadcast.10 = bf16[1,64,17408]{2,1,0} broadcast(%constant.49), dimensions={}
  %neg.3 = bf16[1,64,17408]{2,1,0} negate(%Arg_0.20), metadata={op_name="neg"}
  %exp.2 = bf16[1,64,17408]{2,1,0} exponential(%neg.3), metadata={op_name="exp"}
  %add.13 = bf16[1,64,17408]{2,1,0} add(%exp.2, %broadcast.10), metadata={op_name="add"}
  %div.28 = bf16[1,64,17408]{2,1,0} divide(%broadcast.10, %add.13), metadata={op_name="div"}
  ROOT %mul.37 = bf16[1,64,17408]{2,1,0} multiply(%Arg_0.20, %div.28), metadata={op_name="mul"}
}

%closed_call.17 (Arg_0.21: s32[1,64], Arg_1.19: s32[1,64], Arg_2.5: bf16[1,64,5120], Arg_3.1: f32[5120,17408], Arg_4.1: f32[5120,17408], Arg_5.1: f32[17408,5120], Arg_6.1: f32[5120], Arg_7.1: f32[5120], Arg_8.1: f32[5120,8,128], Arg_9.1: f32[128], Arg_10.1: f32[40,128,5120], Arg_11.1: f32[5120,40,128], Arg_12.1: f32[128], Arg_13.1: f32[5120,8,128]) -> (bf16[1,64,5120], s32[1], s32[1,1984], s32[1,64], bf16[1984,8,1,128], /*index=5*/s32[1], bf16[1984,8,1,128], bf16[64,8,1,128], bf16[64,8,1,128]) {
  %Arg_2.5 = bf16[1,64,5120]{2,1,0} parameter(2)
  %Arg_7.1 = f32[5120]{0} parameter(7)
  %convert_element_type.35 = bf16[5120]{0} convert(%Arg_7.1), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=30}
  %convert_element_type.33 = f32[1,64,5120]{2,1,0} convert(%Arg_2.5), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=31}
  %square.4 = f32[1,64,5120]{2,1,0} multiply(%convert_element_type.33, %convert_element_type.33), metadata={op_name="checkpoint/layers/square" stack_frame_id=32}
  %constant.63 = f32[] constant(0)
  %reduce_sum.35 = f32[1,64]{1,0} reduce(%square.4, %constant.63), dimensions={2}, to_apply=%region_1.8, metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=11}
  %broadcast_in_dim.34 = f32[1,64,1]{2,1,0} reshape(%reduce_sum.35), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=11}
  %constant.60 = f32[] constant(5120)
  %broadcast.15 = f32[1,64,1]{2,1,0} broadcast(%constant.60), dimensions={}
  %div.31 = f32[1,64,1]{2,1,0} divide(%broadcast_in_dim.34, %broadcast.15), metadata={op_name="checkpoint/layers/div" stack_frame_id=11}
  %constant.59 = f32[] constant(1e-06)
  %broadcast.14 = f32[1,64,1]{2,1,0} broadcast(%constant.59), dimensions={}
  %add.17 = f32[1,64,1]{2,1,0} add(%div.31, %broadcast.14), metadata={op_name="checkpoint/layers/add" stack_frame_id=33}
  %rsqrt.4 = f32[1,64,1]{2,1,0} rsqrt(%add.17), metadata={op_name="checkpoint/layers/rsqrt" stack_frame_id=34}
  %mul.40 = f32[1,64,1]{2,1,0} broadcast(%rsqrt.4), dimensions={0,1,2}, metadata={op_name="checkpoint/layers/mul" stack_frame_id=35}
  %mul.41 = f32[1,64]{1,0} reshape(%mul.40), metadata={op_name="checkpoint/layers/mul" stack_frame_id=35}
  %mul.42 = f32[1,64,5120]{2,1,0} broadcast(%mul.41), dimensions={0,1}, metadata={op_name="checkpoint/layers/mul" stack_frame_id=35}
  %mul.43 = f32[1,64,5120]{2,1,0} multiply(%convert_element_type.33, %mul.42), metadata={op_name="checkpoint/layers/mul" stack_frame_id=35}
  %convert_element_type.34 = bf16[1,64,5120]{2,1,0} convert(%mul.43), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=36}
  %dot_general.13 = bf16[5120,1,64]{2,1,0} dot(%convert_element_type.35, %convert_element_type.34), lhs_batch_dims={0}, lhs_contracting_dims={}, rhs_batch_dims={2}, rhs_contracting_dims={}, metadata={op_name="checkpoint/layers/...k,k->...k/dot_general" stack_frame_id=37}
  %transpose.20 = bf16[1,64,5120]{1,0,2} transpose(%dot_general.13), dimensions={1,2,0}, metadata={op_name="checkpoint/layers/...k,k->...k/transpose" stack_frame_id=37}
  %sharding_constraint.8 = bf16[1,64,5120]{2,1,0} custom-call(%transpose.20), custom_call_target="Sharding", sharding={devices=[1,1,8]<=[8]}, frontend_attributes={xla.sdy.sharding="#sdy.sharding_per_value<[<@mesh, [{}, {}, {\"tensor\"}]>]>"}, metadata={op_name="checkpoint/layers/sharding_constraint" stack_frame_id=40}
  %Arg_13.1 = f32[5120,8,128]{2,1,0} parameter(13)
  %convert_element_type.38 = bf16[5120,8,128]{2,1,0} convert(%Arg_13.1), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=44}
  %dot_general.16 = bf16[1,64,8,128]{3,2,1,0} dot(%sharding_constraint.8, %convert_element_type.38), lhs_contracting_dims={2}, rhs_contracting_dims={0}, metadata={op_name="checkpoint/layers/dot_general" stack_frame_id=46}
  %sharding_constraint.11 = bf16[1,64,8,128]{3,2,1,0} custom-call(%dot_general.16), custom_call_target="Sharding", sharding={devices=[1,1,8,1]<=[8]}, frontend_attributes={xla.sdy.sharding="#sdy.sharding_per_value<[<@mesh, [{}, {}, {\"tensor\"}, {}]>]>"}, metadata={op_name="checkpoint/layers/sharding_constraint" stack_frame_id=49}
  %Arg_0.21 = s32[1,64]{1,0} parameter(0)
  %broadcast_in_dim.41 = s32[1,64,1]{2,1,0} reshape(%Arg_0.21), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=51}
  %eq.7 = s32[1,64,1]{2,1,0} broadcast(%broadcast_in_dim.41), dimensions={0,1,2}, metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %eq.8 = s32[1,64]{1,0} reshape(%eq.7), metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %eq.9 = s32[1,64,64]{2,1,0} broadcast(%eq.8), dimensions={0,1}, metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %broadcast_in_dim.42 = s32[1,1,64]{2,1,0} reshape(%Arg_0.21), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=52}
  %eq.10 = s32[1,1,64]{2,1,0} broadcast(%broadcast_in_dim.42), dimensions={0,1,2}, metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %eq.11 = s32[1,64]{1,0} reshape(%eq.10), metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %eq.12 = s32[1,64,64]{2,1,0} broadcast(%eq.11), dimensions={0,2}, metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %eq.13 = pred[1,64,64]{2,1,0} compare(%eq.9, %eq.12), direction=EQ, metadata={op_name="checkpoint/layers/eq" stack_frame_id=51}
  %broadcast_in_dim.43 = pred[1,1,1,64,64]{4,3,2,1,0} reshape(%eq.13), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=53}
  %iota.12 = s32[64]{0} iota(), iota_dimension=0, metadata={op_name="checkpoint/layers/iota" stack_frame_id=54}
  %iota.13 = s32[64,64]{1,0} broadcast(%iota.12), dimensions={1}, metadata={op_name="checkpoint/layers/iota" stack_frame_id=54}
  %iota.10 = s32[64]{0} iota(), iota_dimension=0, metadata={op_name="checkpoint/layers/iota" stack_frame_id=55}
  %iota.11 = s32[64,64]{1,0} broadcast(%iota.10), dimensions={0}, metadata={op_name="checkpoint/layers/iota" stack_frame_id=55}
  %le.1 = pred[64,64]{1,0} compare(%iota.13, %iota.11), direction=LE, metadata={op_name="checkpoint/layers/le" stack_frame_id=56}
  %broadcast_in_dim.44 = pred[1,1,1,64,64]{4,3,2,1,0} reshape(%le.1), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=57}
  %and.1 = pred[1,1,1,64,64]{4,3,2,1,0} and(%broadcast_in_dim.43, %broadcast_in_dim.44), metadata={op_name="checkpoint/layers/and" stack_frame_id=58}
  %constant.62 = f32[] constant(-2.38197633e+38)
  %jit__where_.2 = f32[1,1,1,64,64]{4,3,2,1,0} call(%and.1, %constant.63, %constant.62), to_apply=%_where.11, metadata={op_name="checkpoint/layers/jit(_where)" stack_frame_id=59}
  %constant.50 = f32[] constant(-1.19098816e+38)
  %ge.2 = f32[1,1,1,64,64]{4,3,2,1,0} broadcast(%constant.50), dimensions={}, metadata={op_name="checkpoint/layers/ge" stack_frame_id=61}
  %ge.3 = pred[1,1,1,64,64]{4,3,2,1,0} compare(%jit__where_.2, %ge.2), direction=GE, metadata={op_name="checkpoint/layers/ge" stack_frame_id=61}
  %Arg_9.1 = f32[128]{0} parameter(9)
  %convert_element_type.44 = bf16[128]{0} convert(%Arg_9.1), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=62}
  %Arg_8.1 = f32[5120,8,128]{2,1,0} parameter(8)
  %convert_element_type.37 = bf16[5120,8,128]{2,1,0} convert(%Arg_8.1), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=66}
  %dot_general.15 = bf16[1,64,8,128]{3,2,1,0} dot(%sharding_constraint.8, %convert_element_type.37), lhs_contracting_dims={2}, rhs_contracting_dims={0}, metadata={op_name="checkpoint/layers/dot_general" stack_frame_id=68}
  %convert_element_type.42 = f32[1,64,8,128]{3,2,1,0} convert(%dot_general.15), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=69}
  %square.6 = f32[1,64,8,128]{3,2,1,0} multiply(%convert_element_type.42, %convert_element_type.42), metadata={op_name="checkpoint/layers/square" stack_frame_id=70}
  %reduce_sum.37 = f32[1,64,8]{2,1,0} reduce(%square.6, %constant.63), dimensions={3}, to_apply=%region_3.10, metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=19}
  %broadcast_in_dim.36 = f32[1,64,8,1]{3,2,1,0} reshape(%reduce_sum.37), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=19}
  %constant.56 = f32[] constant(128)
  %div.29 = f32[1,64,8,1]{3,2,1,0} broadcast(%constant.56), dimensions={}, metadata={op_name="checkpoint/layers/div" stack_frame_id=19}
  %div.33 = f32[1,64,8,1]{3,2,1,0} divide(%broadcast_in_dim.36, %div.29), metadata={op_name="checkpoint/layers/div" stack_frame_id=19}
  %constant.55 = f32[] constant(1e-06)
  %add.15 = f32[1,64,8,1]{3,2,1,0} broadcast(%constant.55), dimensions={}, metadata={op_name="checkpoint/layers/add" stack_frame_id=71}
  %add.19 = f32[1,64,8,1]{3,2,1,0} add(%div.33, %add.15), metadata={op_name="checkpoint/layers/add" stack_frame_id=71}
  %rsqrt.6 = f32[1,64,8,1]{3,2,1,0} rsqrt(%add.19), metadata={op_name="checkpoint/layers/rsqrt" stack_frame_id=72}
  %mul.48 = f32[1,64,8,1]{3,2,1,0} broadcast(%rsqrt.6), dimensions={0,1,2,3}, metadata={op_name="checkpoint/layers/mul" stack_frame_id=73}
  %mul.49 = f32[1,64,8]{2,1,0} reshape(%mul.48), metadata={op_name="checkpoint/layers/mul" stack_frame_id=73}
  %mul.50 = f32[1,64,8,128]{3,2,1,0} broadcast(%mul.49), dimensions={0,1,2}, metadata={op_name="checkpoint/layers/mul" stack_frame_id=73}
  %mul.51 = f32[1,64,8,128]{3,2,1,0} multiply(%convert_element_type.42, %mul.50), metadata={op_name="checkpoint/layers/mul" stack_frame_id=73}
  %convert_element_type.43 = bf16[1,64,8,128]{3,2,1,0} convert(%mul.51), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=74}
  %dot_general.18 = bf16[128,1,64,8]{3,2,1,0} dot(%convert_element_type.44, %convert_element_type.43), lhs_batch_dims={0}, lhs_contracting_dims={}, rhs_batch_dims={3}, rhs_contracting_dims={}, metadata={op_name="checkpoint/layers/...k,k->...k/dot_general" stack_frame_id=75}
  %transpose.22 = bf16[1,64,8,128]{2,1,0,3} transpose(%dot_general.18), dimensions={1,2,3,0}, metadata={op_name="checkpoint/layers/...k,k->...k/transpose" stack_frame_id=75}
  %Arg_1.19 = s32[1,64]{1,0} parameter(1)
  %broadcast_in_dim.39 = s32[1,64,1,1]{3,2,1,0} reshape(%Arg_1.19), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=79}
  %convert_element_type.50 = f32[1,64,1,1]{3,2,1,0} convert(%broadcast_in_dim.39), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=80}
  %div.43 = f32[1,64,1,1]{3,2,1,0} broadcast(%convert_element_type.50), dimensions={0,1,2,3}, metadata={op_name="checkpoint/layers/div" stack_frame_id=80}
  %div.44 = f32[1,64,1]{2,1,0} reshape(%div.43), metadata={op_name="checkpoint/layers/div" stack_frame_id=80}
  %div.45 = f32[1,64,1,64]{3,2,1,0} broadcast(%div.44), dimensions={0,1,2}, metadata={op_name="checkpoint/layers/div" stack_frame_id=80}
  %constant.52 = f32[] constant(1e+06)
  %broadcast.11 = f32[64]{0} broadcast(%constant.52), dimensions={}
  %iota.9 = s32[64]{0} iota(), iota_dimension=0, metadata={op_name="checkpoint/layers/iota" stack_frame_id=82}
  %constant.54 = s32[] constant(2)
  %broadcast.13 = s32[64]{0} broadcast(%constant.54), dimensions={}
  %mul.61 = s32[64]{0} multiply(%iota.9, %broadcast.13), metadata={op_name="checkpoint/layers/mul" stack_frame_id=83}
  %convert_element_type.49 = f32[64]{0} convert(%mul.61), metadata={op_name="checkpoint/layers/convert_element_type" stack_frame_id=83}
  %constant.53 = f32[] constant(128)
  %broadcast.12 = f32[64]{0} broadcast(%constant.53), dimensions={}
  %div.42 = f32[64]{0} divide(%convert_element_type.49, %broadcast.12), metadata={op_name="checkpoint/layers/div" stack_frame_id=83}
  %pow.3 = f32[64]{0} power(%broadcast.11, %div.42), metadata={op_name="checkpoint/layers/pow" stack_frame_id=84}
  %broadcast_in_dim.40 = f32[1,1,1,64]{3,2,1,0} reshape(%pow.3), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=80}
  %div.46 = f32[1,1,1,64]{3,2,1,0} broadcast(%broadcast_in_dim.40), dimensions={0,1,2,3}, metadata={op_name="checkpoint/layers/div" stack_frame_id=80}
