HloModule jit__generate_jit, buffer_donor={ (0, {}), (1, {}), (2, {}), (3, {}), (4, {}), (5, {}), (6, {}), (7, {}), (8, {}), (9, {}), (10, {}) }, entry_computation_layout={(s32[40,1]{1,0}, s32[40,8,1984]{2,1,0}, s32[40,8,64]{2,1,0}, bf16[40,1984,8,8,128]{4,3,2,1,0}, s32[40,8]{1,0}, /*index=5*/bf16[40,1984,8,8,128]{4,3,2,1,0}, bf16[40,64,8,8,128]{4,3,2,1,0}, bf16[40,64,8,8,128]{4,3,2,1,0}, s32[8,1]{1,0}, s32[8,1]{1,0}, /*index=10*/s32[8,1]{1,0}, f32[5120]{0}, f32[5120,40,17408]{2,1,0}, f32[5120,40,17408]{2,1,0}, f32[17408,40,5120]{2,1,0}, /*index=15*/f32[5120,40]{1,0}, f32[5120,40]{1,0}, f32[5120,40,8,128]{3,2,1,0}, f32[128,40]{1,0}, f32[40,40,128,5120]{3,2,1,0}, /*index=20*/f32[5120,40,40,128]{3,2,1,0}, f32[128,40]{1,0}, f32[5120,40,8,128]{3,2,1,0}, f32[5120,151936]{1,0}, f32[151936,5120]{1,0})->(s32[40,1]{1,0}, s32[40,8,1984]{2,1,0}, s32[40,8,64]{2,1,0}, bf16[40,1984,8,8,128]{4,3,2,1,0}, s32[40,8]{1,0}, /*index=5*/bf16[40,1984,8,8,128]{4,3,2,1,0}, bf16[40,64,8,8,128]{4,3,2,1,0}, bf16[40,64,8,8,128]{4,3,2,1,0}, s32[8,1]{1,0}, f32[8,1,151936]{2,1,0}, /*index=10*/s32[8,1]{1,0}, f32[8,1]{1,0}, s32[8,1]{1,0}, s32[8,3]{1,0}, f32[8,1]{1,0})}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, num_partitions=8, frontend_attributes={xla.sdy.meshes={mesh = #sdy.mesh<["diloco"=1, "data"=1, "stage"=1, "fsdp"=1, "fsdp_transpose"=1, "context"=1, "context_autoregressive"=1, "tensor"=8, "tensor_transpose"=1, "tensor_sequence"=1, "expert"=1, "autoregressive"=1]>}}

FileNames
1 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/maxengine/maxengine.py"
2 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/models/models.py"
3 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/decoders.py"
4 "/usr/local/lib/python3.12/dist-packages/flax/core/axes_scan.py"
5 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/nnx_wrappers.py"
6 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/models/qwen3.py"
7 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/normalizations.py"
8 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/attentions.py"
9 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/kvcache.py"
10 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/attention_op.py"
11 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/utils/sharding.py"
12 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/linears.py"
13 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/layers/embeddings.py"
14 "<frozen runpy>"
15 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/decode.py"
16 "/usr/local/lib/python3.12/dist-packages/absl/app.py"
17 "/tf/jax-lab/targets/maxtext_release/maxtext/src/maxtext/inference/inference_utils.py"

FunctionNames
1 "MaxEngine._prefill_jit"
2 "TransformerLinenPure.apply"
3 "TransformerLinenPure.__call__"
4 "Decoder.__call__"
5 "scan.<locals>.scan_fn"
6 "MaxEngine._generate_jit"
7 "scan.<locals>.scan_fn.<locals>.body_fn"
8 "ToLinen.__call__"
9 "Qwen3DecoderLayer.__call__"
10 "AttentionWithNorm.apply_attention_with_norm"
11 "_fix_for_qwix_quantization.<locals>.wrap.<locals>.wrapped"
12 "RMSNorm.__call__"
13 "Attention.__call__"
14 "Attention.update_kv_caches"
15 "KVCache.__call__"
16 "KVCache.kv_cache_autoregressive"
17 "AttentionOp.__call__"
18 "AttentionOp.apply_attention"
19 "AttentionOp.apply_attention_dot"
20 "AttentionOp.compute_local_attention"
21 "AttentionOp.generate_attention_mask"
22 "apply_mask_to_logits"
23 "KVCache.get_cached_values"
24 "KVCache.get_cached_values.<locals>.<lambda>"
25 "reverse_transpose"
26 "maybe_shard_with_logical"
27 "maybe_shard_with_name"
28 "Attention.query_projection"
29 "DenseGeneral.__call__"
30 "_compute_dot_general_nnx"
31 "Attention.apply_rotary_embedding"
32 "RotaryEmbedding.__call__"
33 "RotaryEmbedding.timescale"
34 "RotaryEmbedding.apply_rotary"
35 "RotaryEmbedding._rotate_half"
36 "AttentionOp.qk_product"
37 "Attention.kv_projection"
38 "KVCache.update_ar_key_value"
39 "AttentionOp.normalize_attention"
40 "AttentionOp.normalize_attention.<locals>.<genexpr>"
41 "AttentionOp.wv_product"
42 "Attention.out_projection"
43 "MlpBlock.__call__"
44 "_run_module_as_main"
45 "_run_code"
46 "<module>"
47 "run"
48 "_run_main"
49 "main"
50 "MaxEngine.generate"
51 "Decoder.apply_output_head"
52 "sampling"
53 "Decoder._apply_embedding"
54 "Embed.__call__"
55 "scan.<locals>.transpose_to_front"
56 "scan.<locals>.transpose_to_front.<locals>.trans"

FileLocations
1 {file_name_id=1 function_name_id=1 line=798 end_line=815 column=32 end_column=9}
2 {file_name_id=2 function_name_id=2 line=71 end_line=71 column=11 end_column=51}
3 {file_name_id=2 function_name_id=3 line=202 end_line=215 column=38 end_column=5}
4 {file_name_id=3 function_name_id=4 line=1133 end_line=1142 column=19 end_column=41}
5 {file_name_id=4 function_name_id=5 line=200 end_line=203 column=14 end_column=7}
6 {file_name_id=1 function_name_id=6 line=1353 end_line=1361 column=31 end_column=9}
7 {file_name_id=4 function_name_id=7 line=157 end_line=157 column=29 end_column=53}
8 {file_name_id=5 function_name_id=8 line=549 end_line=549 column=10 end_column=44}
9 {file_name_id=6 function_name_id=9 line=1520 end_line=1528 column=51 end_column=5}
10 {file_name_id=6 function_name_id=10 line=1454 end_line=1454 column=10 end_column=52}
11 {file_name_id=5 function_name_id=11 line=383 end_line=383 column=15 end_column=39}
12 {file_name_id=7 function_name_id=12 line=72 end_line=72 column=12 end_column=59}
13 {file_name_id=6 function_name_id=10 line=1457 end_line=1466 column=30 end_column=5}
14 {file_name_id=8 function_name_id=13 line=1160 end_line=1160 column=14 end_column=36}
15 {file_name_id=8 function_name_id=13 line=1162 end_line=1162 column=14 end_column=32}
16 {file_name_id=8 function_name_id=13 line=1224 end_line=1224 column=24 end_column=106}
17 {file_name_id=8 function_name_id=14 line=994 end_line=1001 column=36 end_column=5}
18 {file_name_id=9 function_name_id=15 line=959 end_line=959 column=13 end_column=75}
19 {file_name_id=9 function_name_id=16 line=907 end_line=907 column=35 end_column=80}
20 {file_name_id=8 function_name_id=13 line=1225 end_line=1236 column=12 end_column=7}
21 {file_name_id=10 function_name_id=17 line=2106 end_line=2123 column=86 end_column=5}
22 {file_name_id=10 function_name_id=18 line=972 end_line=986 column=13 end_column=7}
23 {file_name_id=10 function_name_id=19 line=1919 end_line=1919 column=11 end_column=109}
24 {file_name_id=10 function_name_id=20 line=1770 end_line=1770 column=16 end_column=55}
25 {file_name_id=10 function_name_id=20 line=1772 end_line=1772 column=16 end_column=68}
26 {file_name_id=10 function_name_id=17 line=2133 end_line=2146 column=71 end_column=5}
27 {file_name_id=6 function_name_id=10 line=1471 end_line=1471 column=20 end_column=76}
28 {file_name_id=10 function_name_id=19 line=1866 end_line=1874 column=16 end_column=5}
29 {file_name_id=10 function_name_id=21 line=698 end_line=698 column=13 end_column=94}
30 {file_name_id=10 function_name_id=21 line=787 end_line=787 column=11 end_column=58}
31 {file_name_id=10 function_name_id=19 line=1906 end_line=1906 column=21 end_column=66}
32 {file_name_id=10 function_name_id=22 line=121 end_line=121 column=20 end_column=52}
33 {file_name_id=9 function_name_id=16 line=914 end_line=914 column=8 end_column=97}
34 {file_name_id=9 function_name_id=23 line=848 end_line=848 column=35 end_column=110}
35 {file_name_id=9 function_name_id=24 line=848 end_line=848 column=58 end_column=96}
36 {file_name_id=9 function_name_id=25 line=42 end_line=42 column=9 end_column=81}
37 {file_name_id=7 function_name_id=12 line=90 end_line=90 column=12 end_column=42}
38 {file_name_id=7 function_name_id=12 line=71 end_line=71 column=8 end_column=35}
39 {file_name_id=7 function_name_id=12 line=72 end_line=72 column=21 end_column=34}
40 {file_name_id=7 function_name_id=12 line=73 end_line=73 column=34 end_column=54}
41 {file_name_id=7 function_name_id=12 line=73 end_line=73 column=24 end_column=55}
42 {file_name_id=7 function_name_id=12 line=73 end_line=73 column=20 end_column=55}
43 {file_name_id=7 function_name_id=12 line=73 end_line=73 column=8 end_column=68}
44 {file_name_id=7 function_name_id=12 line=92 end_line=92 column=11 end_column=84}
45 {file_name_id=8 function_name_id=13 line=1124 end_line=1124 column=15 end_column=73}
46 {file_name_id=11 function_name_id=26 line=147 end_line=155 column=9 end_column=3}
47 {file_name_id=11 function_name_id=27 line=113 end_line=113 column=11 end_column=67}
48 {file_name_id=8 function_name_id=13 line=1142 end_line=1142 column=14 end_column=72}
49 {file_name_id=8 function_name_id=28 line=614 end_line=614 column=11 end_column=58}
50 {file_name_id=12 function_name_id=29 line=231 end_line=231 column=15 end_column=46}
51 {file_name_id=12 function_name_id=29 line=238 end_line=247 column=13 end_column=5}
52 {file_name_id=12 function_name_id=30 line=102 end_line=104 column=9 end_column=3}
53 {file_name_id=8 function_name_id=13 line=1172 end_line=1172 column=14 end_column=108}
54 {file_name_id=8 function_name_id=31 line=935 end_line=935 column=13 end_column=60}
55 {file_name_id=13 function_name_id=32 line=359 end_line=359 column=15 end_column=55}
56 {file_name_id=13 function_name_id=32 line=360 end_line=360 column=19 end_column=44}
57 {file_name_id=13 function_name_id=32 line=360 end_line=360 column=30 end_column=44}
58 {file_name_id=13 function_name_id=33 line=317 end_line=317 column=19 end_column=52}
59 {file_name_id=13 function_name_id=33 line=317 end_line=317 column=15 end_column=52}
60 {file_name_id=13 function_name_id=33 line=318 end_line=318 column=37 end_column=90}
61 {file_name_id=13 function_name_id=32 line=362 end_line=362 column=15 end_column=36}
62 {file_name_id=13 function_name_id=32 line=365 end_line=365 column=10 end_column=56}
63 {file_name_id=13 function_name_id=32 line=367 end_line=367 column=12 end_column=47}
64 {file_name_id=13 function_name_id=34 line=330 end_line=330 column=12 end_column=24}
65 {file_name_id=13 function_name_id=34 line=330 end_line=330 column=29 end_column=54}
66 {file_name_id=13 function_name_id=35 line=325 end_line=325 column=13 end_column=37}
67 {file_name_id=13 function_name_id=35 line=326 end_line=326 column=28 end_column=31}
68 {file_name_id=13 function_name_id=35 line=326 end_line=326 column=11 end_column=46}
69 {file_name_id=13 function_name_id=32 line=361 end_line=361 column=15 end_column=36}
70 {file_name_id=13 function_name_id=32 line=364 end_line=364 column=10 end_column=56}
71 {file_name_id=13 function_name_id=34 line=330 end_line=330 column=11 end_column=61}
72 {file_name_id=8 function_name_id=13 line=1184 end_line=1184 column=14 end_column=48}
73 {file_name_id=8 function_name_id=13 line=1199 end_line=1199 column=14 end_column=94}
74 {file_name_id=10 function_name_id=19 line=1850 end_line=1850 column=19 end_column=88}
75 {file_name_id=10 function_name_id=36 line=1957 end_line=1957 column=14 end_column=60}
76 {file_name_id=10 function_name_id=36 line=1960 end_line=1960 column=15 end_column=74}
77 {file_name_id=10 function_name_id=22 line=121 end_line=121 column=9 end_column=82}
78 {file_name_id=10 function_name_id=20 line=1761 end_line=1761 column=13 end_column=54}
79 {file_name_id=9 function_name_id=16 line=901 end_line=901 column=68 end_column=111}
80 {file_name_id=9 function_name_id=16 line=900 end_line=902 column=8 end_column=9}
81 {file_name_id=8 function_name_id=13 line=1125 end_line=1125 column=16 end_column=75}
82 {file_name_id=8 function_name_id=13 line=1143 end_line=1143 column=12 end_column=85}
83 {file_name_id=8 function_name_id=37 line=668 end_line=668 column=13 end_column=59}
84 {file_name_id=8 function_name_id=13 line=1174 end_line=1174 column=14 end_column=106}
85 {file_name_id=8 function_name_id=13 line=1200 end_line=1200 column=12 end_column=93}
86 {file_name_id=9 function_name_id=16 line=882 end_line=890 column=4 end_column=5}
87 {file_name_id=9 function_name_id=38 line=751 end_line=751 column=37 end_column=91}
88 {file_name_id=9 function_name_id=38 line=763 end_line=763 column=26 end_column=54}
89 {file_name_id=9 function_name_id=38 line=798 end_line=800 column=10 end_column=11}
90 {file_name_id=9 function_name_id=16 line=920 end_line=920 column=8 end_column=87}
91 {file_name_id=10 function_name_id=17 line=2161 end_line=2161 column=15 end_column=100}
92 {file_name_id=10 function_name_id=39 line=2062 end_line=2062 column=17 end_column=59}
93 {file_name_id=10 function_name_id=39 line=2069 end_line=2069 column=33 end_column=55}
94 {file_name_id=10 function_name_id=39 line=2069 end_line=2069 column=25 end_column=56}
95 {file_name_id=10 function_name_id=39 line=2063 end_line=2065 column=17 end_column=5}
96 {file_name_id=10 function_name_id=40 line=2064 end_line=2064 column=17 end_column=39}
97 {file_name_id=10 function_name_id=40 line=2064 end_line=2064 column=9 end_column=40}
98 {file_name_id=10 function_name_id=20 line=1771 end_line=1771 column=34 end_column=52}
99 {file_name_id=10 function_name_id=20 line=1771 end_line=1771 column=26 end_column=53}
100 {file_name_id=10 function_name_id=20 line=1778 end_line=1778 column=16 end_column=54}
101 {file_name_id=10 function_name_id=39 line=2070 end_line=2070 column=18 end_column=46}
102 {file_name_id=9 function_name_id=16 line=915 end_line=915 column=8 end_column=101}
103 {file_name_id=10 function_name_id=20 line=1776 end_line=1776 column=17 end_column=60}
104 {file_name_id=10 function_name_id=20 line=1780 end_line=1780 column=16 end_column=81}
105 {file_name_id=10 function_name_id=41 line=2010 end_line=2010 column=12 end_column=80}
106 {file_name_id=10 function_name_id=41 line=2012 end_line=2012 column=15 end_column=52}
107 {file_name_id=8 function_name_id=13 line=1147 end_line=1147 column=16 end_column=91}
108 {file_name_id=8 function_name_id=37 line=670 end_line=670 column=13 end_column=61}
109 {file_name_id=8 function_name_id=13 line=1201 end_line=1201 column=14 end_column=97}
110 {file_name_id=9 function_name_id=38 line=752 end_line=752 column=39 end_column=95}
111 {file_name_id=9 function_name_id=38 line=803 end_line=805 column=10 end_column=11}
112 {file_name_id=9 function_name_id=16 line=921 end_line=921 column=8 end_column=91}
113 {file_name_id=10 function_name_id=39 line=2070 end_line=2070 column=6 end_column=46}
114 {file_name_id=8 function_name_id=13 line=1243 end_line=1243 column=12 end_column=75}
115 {file_name_id=8 function_name_id=13 line=1247 end_line=1247 column=10 end_column=61}
116 {file_name_id=8 function_name_id=42 line=733 end_line=733 column=11 end_column=51}
117 {file_name_id=6 function_name_id=10 line=1469 end_line=1469 column=26 end_column=48}
118 {file_name_id=6 function_name_id=9 line=1530 end_line=1530 column=14 end_column=66}
119 {file_name_id=12 function_name_id=43 line=517 end_line=517 column=12 end_column=62}
120 {file_name_id=12 function_name_id=43 line=521 end_line=521 column=12 end_column=54}
121 {file_name_id=12 function_name_id=43 line=525 end_line=525 column=8 end_column=51}
122 {file_name_id=12 function_name_id=43 line=528 end_line=528 column=8 end_column=68}
123 {file_name_id=12 function_name_id=43 line=529 end_line=529 column=13 end_column=50}
124 {file_name_id=6 function_name_id=9 line=1533 end_line=1533 column=19 end_column=48}
125 {file_name_id=9 function_name_id=16 line=905 end_line=905 column=16 end_column=50}
126 {file_name_id=9 function_name_id=16 line=905 end_line=905 column=8 end_column=101}
127 {file_name_id=14 function_name_id=44 line=198 end_line=199 column=11 end_column=42}
128 {file_name_id=14 function_name_id=45 line=88 end_line=88 column=4 end_column=27}
129 {file_name_id=15 function_name_id=46 line=245 end_line=245 column=2 end_column=15}
130 {file_name_id=16 function_name_id=47 line=410 end_line=410 column=6 end_column=27}
131 {file_name_id=16 function_name_id=48 line=355 end_line=355 column=13 end_column=23}
132 {file_name_id=15 function_name_id=49 line=211 end_line=211 column=37 end_column=92}
133 {file_name_id=1 function_name_id=50 line=1280 end_line=1289 column=24 end_column=5}
134 {file_name_id=3 function_name_id=4 line=1289 end_line=1289 column=15 end_column=96}
135 {file_name_id=3 function_name_id=51 line=795 end_line=802 column=8 end_column=40}
136 {file_name_id=1 function_name_id=6 line=1366 end_line=1373 column=16 end_column=5}
137 {file_name_id=17 function_name_id=52 line=135 end_line=135 column=11 end_column=38}
138 {file_name_id=3 function_name_id=4 line=872 end_line=879 column=8 end_column=5}
139 {file_name_id=3 function_name_id=53 line=706 end_line=706 column=8 end_column=85}
140 {file_name_id=13 function_name_id=54 line=155 end_line=158 column=16 end_column=5}
141 {file_name_id=13 function_name_id=54 line=182 end_line=182 column=15 end_column=66}
142 {file_name_id=4 function_name_id=5 line=150 end_line=150 column=9 end_column=66}
143 {file_name_id=4 function_name_id=55 line=126 end_line=126 column=11 end_column=44}
144 {file_name_id=4 function_name_id=56 line=124 end_line=124 column=13 end_column=35}
145 {file_name_id=1 function_name_id=6 line=1363 end_line=1363 column=16 end_column=92}
146 {file_name_id=1 function_name_id=6 line=1382 end_line=1382 column=23 end_column=59}
147 {file_name_id=3 function_name_id=51 line=831 end_line=844 column=15 end_column=7}
148 {file_name_id=3 function_name_id=51 line=847 end_line=847 column=15 end_column=41}
149 {file_name_id=1 function_name_id=6 line=1362 end_line=1362 column=17 end_column=87}
150 {file_name_id=1 function_name_id=6 line=1381 end_line=1381 column=15 end_column=43}
151 {file_name_id=1 function_name_id=6 line=1385 end_line=1385 column=13 end_column=78}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=1}
7 {file_location_id=2 parent_frame_id=7}
8 {file_location_id=3 parent_frame_id=8}
9 {file_location_id=4 parent_frame_id=9}
10 {file_location_id=5 parent_frame_id=10}
11 {file_location_id=7 parent_frame_id=1}
12 {file_location_id=8 parent_frame_id=12}
13 {file_location_id=9 parent_frame_id=13}
14 {file_location_id=10 parent_frame_id=14}
15 {file_location_id=11 parent_frame_id=15}
16 {file_location_id=12 parent_frame_id=16}
17 {file_location_id=13 parent_frame_id=14}
18 {file_location_id=11 parent_frame_id=18}
19 {file_location_id=14 parent_frame_id=19}
20 {file_location_id=11 parent_frame_id=20}
21 {file_location_id=12 parent_frame_id=21}
22 {file_location_id=15 parent_frame_id=19}
23 {file_location_id=11 parent_frame_id=23}
24 {file_location_id=12 parent_frame_id=24}
25 {file_location_id=16 parent_frame_id=19}
26 {file_location_id=17 parent_frame_id=26}
27 {file_location_id=11 parent_frame_id=27}
28 {file_location_id=18 parent_frame_id=28}
29 {file_location_id=19 parent_frame_id=29}
30 {file_location_id=20 parent_frame_id=19}
31 {file_location_id=11 parent_frame_id=31}
32 {file_location_id=21 parent_frame_id=32}
33 {file_location_id=22 parent_frame_id=33}
34 {file_location_id=23 parent_frame_id=34}
35 {file_location_id=24 parent_frame_id=35}
36 {file_location_id=25 parent_frame_id=35}
37 {file_location_id=26 parent_frame_id=32}
38 {file_location_id=22 parent_frame_id=38}
39 {file_location_id=23 parent_frame_id=39}
40 {file_location_id=24 parent_frame_id=40}
41 {file_location_id=25 parent_frame_id=40}
42 {file_location_id=27 parent_frame_id=14}
43 {file_location_id=11 parent_frame_id=43}
44 {file_location_id=12 parent_frame_id=44}
45 {file_location_id=28 parent_frame_id=34}
46 {file_location_id=29 parent_frame_id=46}
47 {file_location_id=30 parent_frame_id=46}
48 {file_location_id=31 parent_frame_id=34}
49 {file_location_id=32 parent_frame_id=49}
50 {file_location_id=33 parent_frame_id=29}
51 {file_location_id=34 parent_frame_id=51}
52 {file_location_id=35 parent_frame_id=52}
53 {file_location_id=36 parent_frame_id=53}
54 {file_location_id=37 parent_frame_id=21}
55 {file_location_id=37 parent_frame_id=16}
56 {file_location_id=38 parent_frame_id=16}
57 {file_location_id=39 parent_frame_id=16}
58 {file_location_id=40 parent_frame_id=16}
59 {file_location_id=41 parent_frame_id=16}
60 {file_location_id=42 parent_frame_id=16}
61 {file_location_id=43 parent_frame_id=16}
62 {file_location_id=44 parent_frame_id=16}
63 {file_location_id=45 parent_frame_id=19}
64 {file_location_id=46 parent_frame_id=64}
65 {file_location_id=47 parent_frame_id=65}
66 {file_location_id=48 parent_frame_id=19}
67 {file_location_id=49 parent_frame_id=67}
68 {file_location_id=11 parent_frame_id=68}
69 {file_location_id=50 parent_frame_id=69}
70 {file_location_id=51 parent_frame_id=69}
71 {file_location_id=52 parent_frame_id=71}
72 {file_location_id=38 parent_frame_id=21}
73 {file_location_id=39 parent_frame_id=21}
74 {file_location_id=40 parent_frame_id=21}
75 {file_location_id=41 parent_frame_id=21}
76 {file_location_id=42 parent_frame_id=21}
77 {file_location_id=43 parent_frame_id=21}
78 {file_location_id=44 parent_frame_id=21}
79 {file_location_id=53 parent_frame_id=19}
80 {file_location_id=54 parent_frame_id=80}
81 {file_location_id=11 parent_frame_id=81}
82 {file_location_id=55 parent_frame_id=82}
83 {file_location_id=56 parent_frame_id=82}
84 {file_location_id=57 parent_frame_id=82}
85 {file_location_id=58 parent_frame_id=85}
86 {file_location_id=59 parent_frame_id=85}
87 {file_location_id=60 parent_frame_id=85}
88 {file_location_id=61 parent_frame_id=82}
89 {file_location_id=62 parent_frame_id=82}
90 {file_location_id=63 parent_frame_id=82}
91 {file_location_id=64 parent_frame_id=91}
92 {file_location_id=65 parent_frame_id=91}
93 {file_location_id=66 parent_frame_id=93}
94 {file_location_id=67 parent_frame_id=93}
95 {file_location_id=68 parent_frame_id=93}
96 {file_location_id=69 parent_frame_id=82}
97 {file_location_id=70 parent_frame_id=82}
98 {file_location_id=71 parent_frame_id=91}
99 {file_location_id=72 parent_frame_id=19}
100 {file_location_id=73 parent_frame_id=19}
101 {file_location_id=46 parent_frame_id=101}
102 {file_location_id=47 parent_frame_id=102}
103 {file_location_id=74 parent_frame_id=34}
104 {file_location_id=75 parent_frame_id=104}
105 {file_location_id=76 parent_frame_id=104}
106 {file_location_id=77 parent_frame_id=49}
107 {file_location_id=78 parent_frame_id=35}
108 {file_location_id=79 parent_frame_id=29}
109 {file_location_id=80 parent_frame_id=29}
110 {file_location_id=28 parent_frame_id=39}
111 {file_location_id=29 parent_frame_id=111}
112 {file_location_id=30 parent_frame_id=111}
113 {file_location_id=31 parent_frame_id=39}
114 {file_location_id=32 parent_frame_id=114}
115 {file_location_id=37 parent_frame_id=24}
116 {file_location_id=81 parent_frame_id=19}
117 {file_location_id=46 parent_frame_id=117}
118 {file_location_id=47 parent_frame_id=118}
119 {file_location_id=82 parent_frame_id=19}
120 {file_location_id=83 parent_frame_id=120}
121 {file_location_id=11 parent_frame_id=121}
122 {file_location_id=50 parent_frame_id=122}
123 {file_location_id=51 parent_frame_id=122}
124 {file_location_id=52 parent_frame_id=124}
125 {file_location_id=38 parent_frame_id=24}
126 {file_location_id=39 parent_frame_id=24}
127 {file_location_id=40 parent_frame_id=24}
128 {file_location_id=41 parent_frame_id=24}
129 {file_location_id=42 parent_frame_id=24}
130 {file_location_id=43 parent_frame_id=24}
131 {file_location_id=44 parent_frame_id=24}
132 {file_location_id=84 parent_frame_id=19}
133 {file_location_id=54 parent_frame_id=133}
134 {file_location_id=11 parent_frame_id=134}
135 {file_location_id=55 parent_frame_id=135}
136 {file_location_id=56 parent_frame_id=135}
137 {file_location_id=57 parent_frame_id=135}
138 {file_location_id=58 parent_frame_id=138}
139 {file_location_id=59 parent_frame_id=138}
140 {file_location_id=60 parent_frame_id=138}
141 {file_location_id=61 parent_frame_id=135}
142 {file_location_id=62 parent_frame_id=135}
143 {file_location_id=63 parent_frame_id=135}
144 {file_location_id=64 parent_frame_id=144}
145 {file_location_id=65 parent_frame_id=144}
146 {file_location_id=66 parent_frame_id=146}
147 {file_location_id=67 parent_frame_id=146}
148 {file_location_id=68 parent_frame_id=146}
149 {file_location_id=69 parent_frame_id=135}
150 {file_location_id=70 parent_frame_id=135}
151 {file_location_id=71 parent_frame_id=144}
152 {file_location_id=85 parent_frame_id=19}
153 {file_location_id=46 parent_frame_id=153}
154 {file_location_id=47 parent_frame_id=154}
155 {file_location_id=86 parent_frame_id=29}
156 {file_location_id=87 parent_frame_id=156}
157 {file_location_id=88 parent_frame_id=156}
158 {file_location_id=89 parent_frame_id=156}
159 {file_location_id=90 parent_frame_id=29}
160 {file_location_id=34 parent_frame_id=160}
161 {file_location_id=35 parent_frame_id=161}
162 {file_location_id=36 parent_frame_id=162}
163 {file_location_id=74 parent_frame_id=39}
164 {file_location_id=75 parent_frame_id=164}
165 {file_location_id=76 parent_frame_id=164}
166 {file_location_id=77 parent_frame_id=114}
167 {file_location_id=78 parent_frame_id=40}
168 {file_location_id=91 parent_frame_id=32}
169 {file_location_id=92 parent_frame_id=169}
170 {file_location_id=93 parent_frame_id=169}
171 {file_location_id=94 parent_frame_id=169}
172 {file_location_id=95 parent_frame_id=169}
173 {file_location_id=96 parent_frame_id=173}
174 {file_location_id=97 parent_frame_id=173}
175 {file_location_id=98 parent_frame_id=35}
176 {file_location_id=99 parent_frame_id=35}
177 {file_location_id=100 parent_frame_id=35}
178 {file_location_id=98 parent_frame_id=40}
179 {file_location_id=99 parent_frame_id=40}
180 {file_location_id=100 parent_frame_id=40}
181 {file_location_id=101 parent_frame_id=169}
182 {file_location_id=102 parent_frame_id=29}
183 {file_location_id=34 parent_frame_id=183}
184 {file_location_id=35 parent_frame_id=184}
185 {file_location_id=36 parent_frame_id=185}
186 {file_location_id=103 parent_frame_id=35}
187 {file_location_id=104 parent_frame_id=35}
188 {file_location_id=105 parent_frame_id=188}
189 {file_location_id=106 parent_frame_id=188}
190 {file_location_id=107 parent_frame_id=19}
191 {file_location_id=108 parent_frame_id=191}
192 {file_location_id=11 parent_frame_id=192}
193 {file_location_id=50 parent_frame_id=193}
194 {file_location_id=51 parent_frame_id=193}
195 {file_location_id=52 parent_frame_id=195}
196 {file_location_id=109 parent_frame_id=19}
197 {file_location_id=46 parent_frame_id=197}
198 {file_location_id=47 parent_frame_id=198}
199 {file_location_id=110 parent_frame_id=156}
200 {file_location_id=111 parent_frame_id=156}
201 {file_location_id=112 parent_frame_id=29}
202 {file_location_id=34 parent_frame_id=202}
203 {file_location_id=35 parent_frame_id=203}
204 {file_location_id=36 parent_frame_id=204}
205 {file_location_id=103 parent_frame_id=40}
206 {file_location_id=104 parent_frame_id=40}
207 {file_location_id=105 parent_frame_id=207}
208 {file_location_id=106 parent_frame_id=207}
209 {file_location_id=113 parent_frame_id=169}
210 {file_location_id=114 parent_frame_id=19}
211 {file_location_id=46 parent_frame_id=211}
212 {file_location_id=47 parent_frame_id=212}
213 {file_location_id=115 parent_frame_id=19}
214 {file_location_id=116 parent_frame_id=214}
215 {file_location_id=11 parent_frame_id=215}
216 {file_location_id=50 parent_frame_id=216}
217 {file_location_id=51 parent_frame_id=216}
218 {file_location_id=52 parent_frame_id=218}
219 {file_location_id=117 parent_frame_id=14}
220 {file_location_id=37 parent_frame_id=44}
221 {file_location_id=38 parent_frame_id=44}
222 {file_location_id=39 parent_frame_id=44}
223 {file_location_id=40 parent_frame_id=44}
224 {file_location_id=41 parent_frame_id=44}
225 {file_location_id=42 parent_frame_id=44}
226 {file_location_id=43 parent_frame_id=44}
227 {file_location_id=44 parent_frame_id=44}
228 {file_location_id=118 parent_frame_id=13}
229 {file_location_id=11 parent_frame_id=229}
230 {file_location_id=119 parent_frame_id=230}
231 {file_location_id=11 parent_frame_id=231}
232 {file_location_id=50 parent_frame_id=232}
233 {file_location_id=51 parent_frame_id=232}
234 {file_location_id=52 parent_frame_id=234}
235 {file_location_id=120 parent_frame_id=230}
236 {file_location_id=121 parent_frame_id=230}
237 {file_location_id=122 parent_frame_id=230}
238 {file_location_id=46 parent_frame_id=238}
239 {file_location_id=47 parent_frame_id=239}
240 {file_location_id=123 parent_frame_id=230}
241 {file_location_id=11 parent_frame_id=241}
242 {file_location_id=50 parent_frame_id=242}
243 {file_location_id=51 parent_frame_id=242}
244 {file_location_id=52 parent_frame_id=244}
245 {file_location_id=124 parent_frame_id=13}
246 {file_location_id=125 parent_frame_id=29}
247 {file_location_id=126 parent_frame_id=29}
248 {file_location_id=127 parent_frame_id=1}
249 {file_location_id=128 parent_frame_id=249}
250 {file_location_id=129 parent_frame_id=250}
251 {file_location_id=130 parent_frame_id=251}
252 {file_location_id=131 parent_frame_id=252}
253 {file_location_id=132 parent_frame_id=253}
254 {file_location_id=133 parent_frame_id=254}
255 {file_location_id=6 parent_frame_id=255}
256 {file_location_id=2 parent_frame_id=256}
257 {file_location_id=3 parent_frame_id=257}
258 {file_location_id=4 parent_frame_id=258}
259 {file_location_id=5 parent_frame_id=259}
260 {file_location_id=6 parent_frame_id=260}
261 {file_location_id=2 parent_frame_id=261}
262 {file_location_id=3 parent_frame_id=262}
263 {file_location_id=4 parent_frame_id=263}
264 {file_location_id=5 parent_frame_id=264}
265 {file_location_id=6 parent_frame_id=265}
266 {file_location_id=2 parent_frame_id=266}
267 {file_location_id=3 parent_frame_id=267}
268 {file_location_id=4 parent_frame_id=268}
269 {file_location_id=5 parent_frame_id=269}
270 {file_location_id=134 parent_frame_id=258}
271 {file_location_id=135 parent_frame_id=271}
272 {file_location_id=8 parent_frame_id=272}
273 {file_location_id=12 parent_frame_id=273}
274 {file_location_id=136 parent_frame_id=1}
275 {file_location_id=137 parent_frame_id=275}
276 {file_location_id=136 parent_frame_id=276}
277 {file_location_id=137 parent_frame_id=277}
278 {file_location_id=138 parent_frame_id=258}
279 {file_location_id=139 parent_frame_id=279}
280 {file_location_id=8 parent_frame_id=280}
281 {file_location_id=140 parent_frame_id=281}
282 {file_location_id=141 parent_frame_id=281}
283 {file_location_id=142 parent_frame_id=259}
284 {file_location_id=143 parent_frame_id=284}
285 {file_location_id=144 parent_frame_id=285}
286 {file_location_id=145 parent_frame_id=255}
287 {file_location_id=146 parent_frame_id=255}
288 {file_location_id=37 parent_frame_id=273}
289 {file_location_id=38 parent_frame_id=273}
290 {file_location_id=39 parent_frame_id=273}
291 {file_location_id=40 parent_frame_id=273}
292 {file_location_id=41 parent_frame_id=273}
293 {file_location_id=42 parent_frame_id=273}
294 {file_location_id=43 parent_frame_id=273}
295 {file_location_id=44 parent_frame_id=273}
296 {file_location_id=147 parent_frame_id=271}
297 {file_location_id=8 parent_frame_id=297}
298 {file_location_id=50 parent_frame_id=298}
299 {file_location_id=51 parent_frame_id=298}
300 {file_location_id=52 parent_frame_id=300}
301 {file_location_id=148 parent_frame_id=271}
302 {file_location_id=149 parent_frame_id=255}
303 {file_location_id=150 parent_frame_id=255}
304 {file_location_id=136 parent_frame_id=255}
305 {file_location_id=137 parent_frame_id=305}
306 {file_location_id=151 parent_frame_id=255}


%dynamic_index_in_dim.1 (Arg_0.1: f32[40,5120,17408], Arg_1.1: s32[]) -> f32[5120,17408] {
  %Arg_0.1 = f32[40,5120,17408]{2,1,0} parameter(0)
  %Arg_1.1 = s32[] parameter(1)
  %constant.17 = s32[] constant(0)
  %dynamic_slice.1 = f32[1,5120,17408]{2,1,0} dynamic-slice(%Arg_0.1, %Arg_1.1, %constant.17, %constant.17), dynamic_slice_sizes={1,5120,17408}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.1 = f32[5120,17408]{1,0} reshape(%dynamic_slice.1), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_0.2 (Arg_0.3: f32[40,17408,5120], Arg_1.3: s32[]) -> f32[17408,5120] {
  %Arg_0.3 = f32[40,17408,5120]{2,1,0} parameter(0)
  %Arg_1.3 = s32[] parameter(1)
  %constant.19 = s32[] constant(0)
  %dynamic_slice.3 = f32[1,17408,5120]{2,1,0} dynamic-slice(%Arg_0.3, %Arg_1.3, %constant.19, %constant.19), dynamic_slice_sizes={1,17408,5120}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.3 = f32[17408,5120]{1,0} reshape(%dynamic_slice.3), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_1.3 (Arg_0.5: f32[40,5120], Arg_1.5: s32[]) -> f32[5120] {
  %Arg_0.5 = f32[40,5120]{1,0} parameter(0)
  %Arg_1.5 = s32[] parameter(1)
  %constant.21 = s32[] constant(0)
  %dynamic_slice.5 = f32[1,5120]{1,0} dynamic-slice(%Arg_0.5, %Arg_1.5, %constant.21), dynamic_slice_sizes={1,5120}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.5 = f32[5120]{0} reshape(%dynamic_slice.5), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_2.4 (Arg_0.7: f32[40,5120,8,128], Arg_1.7: s32[]) -> f32[5120,8,128] {
  %Arg_0.7 = f32[40,5120,8,128]{3,2,1,0} parameter(0)
  %Arg_1.7 = s32[] parameter(1)
  %constant.23 = s32[] constant(0)
  %dynamic_slice.7 = f32[1,5120,8,128]{3,2,1,0} dynamic-slice(%Arg_0.7, %Arg_1.7, %constant.23, %constant.23, %constant.23), dynamic_slice_sizes={1,5120,8,128}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.7 = f32[5120,8,128]{2,1,0} reshape(%dynamic_slice.7), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_3.5 (Arg_0.9: f32[40,128], Arg_1.9: s32[]) -> f32[128] {
  %Arg_0.9 = f32[40,128]{1,0} parameter(0)
  %Arg_1.9 = s32[] parameter(1)
  %constant.25 = s32[] constant(0)
  %dynamic_slice.9 = f32[1,128]{1,0} dynamic-slice(%Arg_0.9, %Arg_1.9, %constant.25), dynamic_slice_sizes={1,128}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.9 = f32[128]{0} reshape(%dynamic_slice.9), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_4.6 (Arg_0.11: f32[40,40,128,5120], Arg_1.11: s32[]) -> f32[40,128,5120] {
  %Arg_0.11 = f32[40,40,128,5120]{3,2,1,0} parameter(0)
  %Arg_1.11 = s32[] parameter(1)
  %constant.27 = s32[] constant(0)
  %dynamic_slice.11 = f32[1,40,128,5120]{3,2,1,0} dynamic-slice(%Arg_0.11, %Arg_1.11, %constant.27, %constant.27, %constant.27), dynamic_slice_sizes={1,40,128,5120}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.11 = f32[40,128,5120]{2,1,0} reshape(%dynamic_slice.11), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_5.7 (Arg_0.13: f32[40,5120,40,128], Arg_1.13: s32[]) -> f32[5120,40,128] {
  %Arg_0.13 = f32[40,5120,40,128]{3,2,1,0} parameter(0)
  %Arg_1.13 = s32[] parameter(1)
  %constant.29 = s32[] constant(0)
  %dynamic_slice.13 = f32[1,5120,40,128]{3,2,1,0} dynamic-slice(%Arg_0.13, %Arg_1.13, %constant.29, %constant.29, %constant.29), dynamic_slice_sizes={1,5120,40,128}, metadata={op_name="dynamic_slice" stack_frame_id=5}
  ROOT %squeeze.13 = f32[5120,40,128]{2,1,0} reshape(%dynamic_slice.13), metadata={op_name="squeeze" stack_frame_id=5}
}

%dynamic_index_in_dim_6.8 (Arg_0.15: s32[40,1], Arg_1.15: s32[]) -> s32[1] {
  %Arg_0.15 = s32[40,1]{1,0} parameter(0)
  %Arg_1.15 = s32[] parameter(1)
  %constant.31 = s32[] constant(0)
  %dynamic_slice.15 = s32[1,1]{1,0} dynamic-slice(%Arg_0.15, %Arg_1.15, %constant.31), dynamic_slice_sizes={1,1}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.15 = s32[1]{0} reshape(%dynamic_slice.15), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_7.9 (Arg_0.17: s32[40,8,1984], Arg_1.17: s32[]) -> s32[8,1984] {
  %Arg_0.17 = s32[40,8,1984]{2,1,0} parameter(0)
  %Arg_1.17 = s32[] parameter(1)
  %constant.33 = s32[] constant(0)
  %dynamic_slice.17 = s32[1,8,1984]{2,1,0} dynamic-slice(%Arg_0.17, %Arg_1.17, %constant.33, %constant.33), dynamic_slice_sizes={1,8,1984}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.17 = s32[8,1984]{1,0} reshape(%dynamic_slice.17), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_8.10 (Arg_0.19: s32[40,8,64], Arg_1.19: s32[]) -> s32[8,64] {
  %Arg_0.19 = s32[40,8,64]{2,1,0} parameter(0)
  %Arg_1.19 = s32[] parameter(1)
  %constant.35 = s32[] constant(0)
  %dynamic_slice.19 = s32[1,8,64]{2,1,0} dynamic-slice(%Arg_0.19, %Arg_1.19, %constant.35, %constant.35), dynamic_slice_sizes={1,8,64}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.19 = s32[8,64]{1,0} reshape(%dynamic_slice.19), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_9.11 (Arg_0.21: bf16[40,1984,8,8,128], Arg_1.21: s32[]) -> bf16[1984,8,8,128] {
  %Arg_0.21 = bf16[40,1984,8,8,128]{4,3,2,1,0} parameter(0)
  %Arg_1.21 = s32[] parameter(1)
  %constant.37 = s32[] constant(0)
  %dynamic_slice.21 = bf16[1,1984,8,8,128]{4,3,2,1,0} dynamic-slice(%Arg_0.21, %Arg_1.21, %constant.37, %constant.37, %constant.37, /*index=5*/%constant.37), dynamic_slice_sizes={1,1984,8,8,128}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.21 = bf16[1984,8,8,128]{3,2,1,0} reshape(%dynamic_slice.21), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_10.12 (Arg_0.23: s32[40,8], Arg_1.23: s32[]) -> s32[8] {
  %Arg_0.23 = s32[40,8]{1,0} parameter(0)
  %Arg_1.23 = s32[] parameter(1)
  %constant.39 = s32[] constant(0)
  %dynamic_slice.23 = s32[1,8]{1,0} dynamic-slice(%Arg_0.23, %Arg_1.23, %constant.39), dynamic_slice_sizes={1,8}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.23 = s32[8]{0} reshape(%dynamic_slice.23), metadata={op_name="squeeze" stack_frame_id=10}
}

%dynamic_index_in_dim_11.13 (Arg_0.25: bf16[40,64,8,8,128], Arg_1.25: s32[]) -> bf16[64,8,8,128] {
  %Arg_0.25 = bf16[40,64,8,8,128]{4,3,2,1,0} parameter(0)
  %Arg_1.25 = s32[] parameter(1)
  %constant.41 = s32[] constant(0)
  %dynamic_slice.25 = bf16[1,64,8,8,128]{4,3,2,1,0} dynamic-slice(%Arg_0.25, %Arg_1.25, %constant.41, %constant.41, %constant.41, /*index=5*/%constant.41), dynamic_slice_sizes={1,64,8,8,128}, metadata={op_name="dynamic_slice" stack_frame_id=10}
  ROOT %squeeze.25 = bf16[64,8,8,128]{3,2,1,0} reshape(%dynamic_slice.25), metadata={op_name="squeeze" stack_frame_id=10}
}

%_where_13.22 (Arg_0.36: pred[8,1,1,1,64], Arg_1.36: f32[], Arg_2.8: f32[]) -> f32[8,1,1,1,64] {
  %Arg_0.36 = pred[8,1,1,1,64]{4,3,2,1,0} parameter(0)
  %Arg_1.36 = f32[] parameter(1)
  %broadcast_in_dim.15 = f32[8,1,1,1,64]{4,3,2,1,0} broadcast(%Arg_1.36), dimensions={}, metadata={op_name="broadcast_in_dim"}
  %Arg_2.8 = f32[] parameter(2)
  %broadcast_in_dim.16 = f32[8,1,1,1,64]{4,3,2,1,0} broadcast(%Arg_2.8), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.10 = f32[8,1,1,1,64]{4,3,2,1,0} select(%Arg_0.36, %broadcast_in_dim.15, %broadcast_in_dim.16), metadata={op_name="select_n"}
}

%region_1.14 (reduce_sum.3: f32[], reduce_sum.4: f32[]) -> f32[] {
  %reduce_sum.3 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.4 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.5 = f32[] add(%reduce_sum.3, %reduce_sum.4), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=16}
}

%region_2.15 (reduce_sum.10: f32[], reduce_sum.11: f32[]) -> f32[] {
  %reduce_sum.10 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.11 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.12 = f32[] add(%reduce_sum.10, %reduce_sum.11), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=21}
}

%_where_14.23 (Arg_0.38: pred[8,1,1,1,64], Arg_1.38: bf16[8,8,5,1,64], Arg_2.10: f32[]) -> bf16[8,8,5,1,64] {
  %Arg_0.38 = pred[8,1,1,1,64]{4,3,2,1,0} parameter(0)
  %broadcast_in_dim.21 = pred[8,1,1,1,64]{4,3,2,1,0} broadcast(%Arg_0.38), dimensions={0,1,2,3,4}, metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.22 = pred[8,1,64]{2,1,0} reshape(%broadcast_in_dim.21), metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.23 = pred[8,8,5,1,64]{4,3,2,1,0} broadcast(%broadcast_in_dim.22), dimensions={0,3,4}, metadata={op_name="broadcast_in_dim"}
  %Arg_1.38 = bf16[8,8,5,1,64]{4,3,2,1,0} parameter(1)
  %Arg_2.10 = f32[] parameter(2)
  %convert_element_type.22 = bf16[] convert(%Arg_2.10), metadata={op_name="convert_element_type"}
  %broadcast_in_dim.24 = bf16[8,8,5,1,64]{4,3,2,1,0} broadcast(%convert_element_type.22), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.12 = bf16[8,8,5,1,64]{4,3,2,1,0} select(%broadcast_in_dim.23, %Arg_1.38, %broadcast_in_dim.24), metadata={op_name="select_n"}
}

%region_5.24 (reduce_max.3: bf16[], reduce_max.4: bf16[]) -> bf16[] {
  %reduce_max.3 = bf16[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.4 = bf16[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.5 = bf16[] maximum(%reduce_max.3, %reduce_max.4), metadata={op_name="checkpoint/layers/reduce_max" stack_frame_id=35}
}

%dynamic_update_index_in_dim_12.18 (Arg_0.30: s32[8,1984], Arg_1.30: s32[8,1], Arg_2.4: s32[]) -> s32[8,1984] {
  %Arg_0.30 = s32[8,1984]{1,0} parameter(0)
  %Arg_1.30 = s32[8,1]{1,0} parameter(1)
  %constant.71 = s32[] constant(0)
  %Arg_2.4 = s32[] parameter(2)
  %lt.4 = pred[] compare(%Arg_2.4, %constant.71), direction=LT, metadata={op_name="lt"}
  %constant.70 = s32[] constant(1984)
  %add.11 = s32[] add(%Arg_2.4, %constant.70), metadata={op_name="add"}
  %select_n.4 = s32[] select(%lt.4, %add.11, %Arg_2.4), metadata={op_name="select_n"}
  ROOT %dynamic_update_slice.3 = s32[8,1984]{1,0} dynamic-update-slice(%Arg_0.30, %Arg_1.30, %constant.71, %select_n.4), metadata={op_name="dynamic_update_slice"}
}

%_where_15.26 (Arg_0.40: pred[8,1,1,1,1984], Arg_1.40: f32[], Arg_2.12: f32[]) -> f32[8,1,1,1,1984] {
  %Arg_0.40 = pred[8,1,1,1,1984]{4,3,2,1,0} parameter(0)
  %Arg_1.40 = f32[] parameter(1)
  %broadcast_in_dim.31 = f32[8,1,1,1,1984]{4,3,2,1,0} broadcast(%Arg_1.40), dimensions={}, metadata={op_name="broadcast_in_dim"}
  %Arg_2.12 = f32[] parameter(2)
  %broadcast_in_dim.32 = f32[8,1,1,1,1984]{4,3,2,1,0} broadcast(%Arg_2.12), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.14 = f32[8,1,1,1,1984]{4,3,2,1,0} select(%Arg_0.40, %broadcast_in_dim.31, %broadcast_in_dim.32), metadata={op_name="select_n"}
}

%region_3.16 (reduce_sum.17: f32[], reduce_sum.18: f32[]) -> f32[] {
  %reduce_sum.17 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.18 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.19 = f32[] add(%reduce_sum.17, %reduce_sum.18), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=24}
}

%dynamic_update_index_in_dim.17 (Arg_0.28: bf16[1984,8,8,128], Arg_1.28: bf16[1,8,8,128], Arg_2.2: s32[]) -> bf16[1984,8,8,128] {
  %Arg_0.28 = bf16[1984,8,8,128]{3,2,1,0} parameter(0)
  %Arg_1.28 = bf16[1,8,8,128]{3,2,1,0} parameter(1)
  %Arg_2.2 = s32[] parameter(2)
  %constant.67 = s32[] constant(0)
  %lt.2 = pred[] compare(%Arg_2.2, %constant.67), direction=LT, metadata={op_name="lt"}
  %constant.66 = s32[] constant(1984)
  %add.9 = s32[] add(%Arg_2.2, %constant.66), metadata={op_name="add"}
  %select_n.2 = s32[] select(%lt.2, %add.9, %Arg_2.2), metadata={op_name="select_n"}
  ROOT %dynamic_update_slice.1 = bf16[1984,8,8,128]{3,2,1,0} dynamic-update-slice(%Arg_0.28, %Arg_1.28, %select_n.2, %constant.67, %constant.67, /*index=5*/%constant.67), metadata={op_name="dynamic_update_slice"}
}

%_where_16.27 (Arg_0.42: pred[8,1,1,1,1984], Arg_1.42: bf16[8,8,5,1,1984], Arg_2.14: f32[]) -> bf16[8,8,5,1,1984] {
  %Arg_0.42 = pred[8,1,1,1,1984]{4,3,2,1,0} parameter(0)
  %broadcast_in_dim.37 = pred[8,1,1,1,1984]{4,3,2,1,0} broadcast(%Arg_0.42), dimensions={0,1,2,3,4}, metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.38 = pred[8,1,1984]{2,1,0} reshape(%broadcast_in_dim.37), metadata={op_name="broadcast_in_dim"}
  %broadcast_in_dim.39 = pred[8,8,5,1,1984]{4,3,2,1,0} broadcast(%broadcast_in_dim.38), dimensions={0,3,4}, metadata={op_name="broadcast_in_dim"}
  %Arg_1.42 = bf16[8,8,5,1,1984]{4,3,2,1,0} parameter(1)
  %Arg_2.14 = f32[] parameter(2)
  %convert_element_type.26 = bf16[] convert(%Arg_2.14), metadata={op_name="convert_element_type"}
  %broadcast_in_dim.40 = bf16[8,8,5,1,1984]{4,3,2,1,0} broadcast(%convert_element_type.26), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.16 = bf16[8,8,5,1,1984]{4,3,2,1,0} select(%broadcast_in_dim.39, %Arg_1.42, %broadcast_in_dim.40), metadata={op_name="select_n"}
}

%region_7.28 (reduce_max.10: bf16[], reduce_max.11: bf16[]) -> bf16[] {
  %reduce_max.10 = bf16[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.11 = bf16[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.12 = bf16[] maximum(%reduce_max.10, %reduce_max.11), metadata={op_name="checkpoint/layers/reduce_max" stack_frame_id=40}
}

%region_6.25 (reduce_sum.24: f32[], reduce_sum.25: f32[]) -> f32[] {
  %reduce_sum.24 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.25 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.26 = f32[] add(%reduce_sum.24, %reduce_sum.25), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=36}
}

%region_8.29 (reduce_sum.31: f32[], reduce_sum.32: f32[]) -> f32[] {
  %reduce_sum.31 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.32 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.33 = f32[] add(%reduce_sum.31, %reduce_sum.32), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=41}
}

%region_9.30 (reduce_sum.38: f32[], reduce_sum.39: f32[]) -> f32[] {
  %reduce_sum.38 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.39 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.40 = f32[] add(%reduce_sum.38, %reduce_sum.39), metadata={op_name="checkpoint/layers/reduce_sum" stack_frame_id=44}
}

%silu.31 (Arg_0.44: bf16[8,1,17408]) -> bf16[8,1,17408] {
  %Arg_0.44 = bf16[8,1,17408]{2,1,0} parameter(0)
  %constant.79 = bf16[] constant(1)
  %broadcast.16 = bf16[8,1,17408]{2,1,0} broadcast(%constant.79), dimensions={}
  %neg.3 = bf16[8,1,17408]{2,1,0} negate(%Arg_0.44), metadata={op_name="neg"}
  %exp.7 = bf16[8,1,17408]{2,1,0} exponential(%neg.3), metadata={op_name="exp"}
  %add.24 = bf16[8,1,17408]{2,1,0} add(%exp.7, %broadcast.16), metadata={op_name="add"}
  %div.25 = bf16[8,1,17408]{2,1,0} divide(%broadcast.16, %add.24), metadata={op_name="div"}
  ROOT %mul.47 = bf16[8,1,17408]{2,1,0} multiply(%Arg_0.44, %div.25), metadata={op_name="mul"}
}

%_where.19 (Arg_0.33: pred[], Arg_1.33: s32[], Arg_2.6: s32[]) -> s32[] {
  %Arg_0.33 = pred[] parameter(0)
  %Arg_1.33 = s32[] parameter(1)
  %Arg_2.6 = s32[] parameter(2)
  ROOT %select_n.6 = s32[] select(%Arg_0.33, %Arg_1.33, %Arg_2.6), metadata={op_name="select_n"}
}

%remainder.20 (Arg_0.34: s32[1], Arg_1.34: s32[]) -> s32[1] {
  %Arg_0.34 = s32[1]{0} parameter(0)
  %Arg_1.34 = s32[] parameter(1)
  %constant.77 = s32[] constant(0)
  %eq.3 = pred[] compare(%Arg_1.34, %constant.77), direction=EQ, metadata={op_name="eq"}
  %constant.76 = s32[] constant(1)
  %jit__where_.1 = s32[] call(%eq.3, %constant.76, %Arg_1.34), to_apply=%_where.19, metadata={op_name="jit(_where)"}
  %rem.2 = s32[1]{0} reshape(%jit__where_.1), metadata={op_name="rem"}
  %rem.3 = s32[1]{0} remainder(%Arg_0.34, %rem.2), metadata={op_name="rem"}
  %constant.75 = s32[1]{0} constant({0})
  %lt.7 = pred[1]{0} compare(%rem.3, %constant.75), direction=LT, metadata={op_name="lt"}
  %lt.8 = pred[] compare(%jit__where_.1, %constant.77), direction=LT, metadata={op_name="lt"}
  %ne.4 = pred[1]{0} reshape(%lt.8), metadata={op_name="ne"}
  %ne.5 = pred[1]{0} compare(%lt.7, %ne.4), direction=NE, metadata={op_name="ne"}
  %ne.3 = pred[1]{0} compare(%rem.3, %constant.75), direction=NE, metadata={op_name="ne"}
  %and.1 = pred[1]{0} and(%ne.5, %ne.3), metadata={op_name="and"}
  %add.15 = s32[1]{0} reshape(%jit__where_.1), metadata={op_name="add"}
  %add.16 = s32[1]{0} add(%rem.3, %add.15), metadata={op_name="add"}
  ROOT %select_n.8 = s32[1]{0} select(%and.1, %add.16, %rem.3), metadata={op_name="select_n"}
}

%region_4.21 (scatter-add.2: s32[], scatter-add.3: s32[]) -> s32[] {
  %scatter-add.2 = s32[] parameter(0), metadata={op_name="scatter-add"}
  %scatter-add.3 = s32[] parameter(1), metadata={op_name="scatter-add"}
  ROOT %add.18 = s32[] add(%scatter-add.2, %scatter-add.3), metadata={op_name="checkpoint/layers/add" stack_frame_id=29}
}

%closed_call.32 (Arg_0.45: s32[0], Arg_1.43: s32[8,1], Arg_2.15: bf16[8,1,5120], Arg_3.1: f32[5120,17408], Arg_4.1: f32[5120,17408], Arg_5.1: f32[17408,5120], Arg_6.1: f32[5120], Arg_7.1: f32[5120], Arg_8.1: f32[5120,8,128], Arg_9.1: f32[128], Arg_10.1: f32[40,128,5120], Arg_11.1: f32[5120,40,128], Arg_12.1: f32[128], Arg_13.1: f32[5120,8,128], Arg_14.1: s32[1], Arg_15.1: s32[8,1984], Arg_16.1: s32[8,64], Arg_17.1: bf16[1984,8,8,128], Arg_18.1: s32[8], Arg_19.1: bf16[1984,8,8,128], Arg_20.1: bf16[64,8,8,128], Arg_21.1: bf16[64,8,8,128]) -> (bf16[8,1,5120], s32[1], s32[8,1984], s32[8,64], bf16[1984,8,8,128], /*index=5*/s32[8], bf16[1984,8,8,128], bf16[64,8,8,128], bf16[64,8,8,128]) {
  %Arg_0.45 = s32[0]{0} parameter(0)
  %Arg_2.15 = bf16[8,1,5120]{2,1,0} parameter(2)
  %Arg_16.1 = s32[8,64]{1,0} parameter(16)
  %broadcast_in_dim.52 = s32[8,1,1,1,64]{4,3,2,1,0} reshape(%Arg_16.1), metadata={op_name="checkpoint/layers/broadcast_in_dim" stack_frame_id=46}
  %constant.83 = s32[] constant(1)
  %eq.7 = s32[8,1,1,1,64]{4,3,2,1,0} broadcast(%constant.83), dimensions={}, metadata={op_name="checkpoint/layers/eq" stack_frame_id=46}
