HloModule jit_predict_step, entry_computation_layout={(f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[32,16]{1,0}, f32[1024,1024]{1,0}, /*index=5*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=10*/f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, /*index=15*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=20*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=25*/f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=30*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=35*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, /*index=40*/f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=45*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=50*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, /*index=55*/f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=60*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=65*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, /*index=70*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=75*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=80*/f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, /*index=85*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=90*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=95*/f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=100*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=105*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, /*index=110*/f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=115*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=120*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, /*index=125*/f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=130*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=135*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, /*index=140*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=145*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=150*/f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, /*index=155*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=160*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=165*/f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=170*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=175*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, /*index=180*/f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=185*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=190*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, /*index=195*/f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=200*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=205*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, /*index=210*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=215*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=220*/f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, /*index=225*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=230*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=235*/f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=240*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=245*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, /*index=250*/f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=255*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=260*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, /*index=265*/f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=270*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=275*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, /*index=280*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=285*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=290*/f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, /*index=295*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=300*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=305*/f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=310*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=315*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, /*index=320*/f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=325*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=330*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, /*index=335*/f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=340*/f32[1024,1024]{1,0}, f32[32,16]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, /*index=345*/f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=350*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, /*index=355*/f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=360*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, /*index=365*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=370*/f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, /*index=375*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=380*/f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=385*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, /*index=390*/f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=395*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, /*index=400*/f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=405*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, /*index=410*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=415*/f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, /*index=420*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=425*/f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=430*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, /*index=435*/f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=440*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, /*index=445*/f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=450*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, /*index=455*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=460*/f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, /*index=465*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=470*/f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=475*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, /*index=480*/f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=485*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, /*index=490*/f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=495*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, /*index=500*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=505*/f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, /*index=510*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, /*index=515*/f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, /*index=520*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, /*index=525*/f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=530*/f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, /*index=535*/f32[2816,1024]{1,0}, f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=540*/f32[1024,1024]{1,0}, f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, /*index=545*/f32[1024]{0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, f32[1024,1024]{1,0}, /*index=550*/f32[1024]{0}, f32[1024,2816]{1,0}, f32[1024,2816]{1,0}, f32[2816,1024]{1,0}, f32[1024]{0}, /*index=555*/f32[1024]{0}, f32[1024,32128]{1,0}, f32[32128,1024]{1,0}, s32[4,128]{1,0}, s32[4,128]{1,0})->f32[4,128,32128]{2,1,0}}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false}, num_partitions=2, frontend_attributes={xla.sdy.meshes={mesh = #sdy.mesh<["fsdp"=2]>}}

FileNames
1 "/root/hlo_dump/mgpu_infer.py"
2 "/usr/local/lib/python3.12/dist-packages/transformers/models/t5/modeling_flax_t5.py"
3 "/usr/local/lib/python3.12/dist-packages/flax/linen/attention.py"
4 "/usr/local/lib/python3.12/dist-packages/flax/linen/linear.py"

FunctionNames
1 "<module>"
2 "main"
3 "main.<locals>.predict_step"
4 "build_flan_t5_large.<locals>.fn"
5 "FlaxT5PreTrainedModel.__call__"
6 "FlaxT5ForConditionalGenerationModule.__call__"
7 "FlaxT5Stack.__call__"
8 "FlaxT5BlockCollection.__call__"
9 "FlaxT5LayerCollection.__call__"
10 "FlaxT5Block.__call__"
11 "FlaxT5LayerSelfAttention.__call__"
12 "FlaxT5LayerNorm.__call__"
13 "FlaxT5Attention.__call__"
14 "dot_product_attention_weights"
15 "FlaxT5LayerFF.__call__"
16 "FlaxT5LayerCrossAttention.__call__"
17 "Embed.__call__"
18 "Dense.__call__"
19 "FlaxT5Attention._split_heads"
20 "FlaxT5Attention._create_position_bias"
21 "FlaxT5Attention.compute_bias"
22 "FlaxT5Attention._relative_position_bucket"
23 "_compat_clip"
24 "make_causal_mask"
25 "make_attention_mask"
26 "combine_masks"
27 "FlaxT5Attention._merge_heads"
28 "FlaxT5DenseGatedActDense.__call__"

FileLocations
1 {file_name_id=1 function_name_id=1 line=195 end_line=195 column=4 end_column=10}
2 {file_name_id=1 function_name_id=2 line=189 end_line=189 column=14 end_column=36}
3 {file_name_id=1 function_name_id=3 line=185 end_line=185 column=15 end_column=36}
4 {file_name_id=1 function_name_id=4 line=157 end_line=157 column=26 end_column=96}
5 {file_name_id=2 function_name_id=5 line=1022 end_line=1033 column=15 end_column=9}
6 {file_name_id=2 function_name_id=6 line=1553 end_line=1560 column=26 end_column=9}
7 {file_name_id=2 function_name_id=7 line=760 end_line=769 column=18 end_column=9}
8 {file_name_id=2 function_name_id=8 line=693 end_line=703 column=28 end_column=13}
9 {file_name_id=2 function_name_id=9 line=629 end_line=639 column=15 end_column=9}
10 {file_name_id=2 function_name_id=10 line=569 end_line=576 column=33 end_column=9}
11 {file_name_id=2 function_name_id=11 line=487 end_line=487 column=31 end_column=61}
12 {file_name_id=2 function_name_id=12 line=84 end_line=84 column=19 end_column=59}
13 {file_name_id=2 function_name_id=11 line=488 end_line=495 column=27 end_column=9}
14 {file_name_id=2 function_name_id=13 line=435 end_line=444 column=23 end_column=9}
15 {file_name_id=3 function_name_id=14 line=146 end_line=146 column=19 end_column=47}
16 {file_name_id=2 function_name_id=10 line=596 end_line=596 column=24 end_column=82}
17 {file_name_id=2 function_name_id=15 line=173 end_line=173 column=27 end_column=57}
18 {file_name_id=2 function_name_id=7 line=773 end_line=773 column=24 end_column=60}
19 {file_name_id=2 function_name_id=6 line=1565 end_line=1574 column=26 end_column=9}
20 {file_name_id=2 function_name_id=10 line=582 end_line=589 column=38 end_column=13}
21 {file_name_id=2 function_name_id=16 line=521 end_line=521 column=31 end_column=61}
22 {file_name_id=2 function_name_id=16 line=522 end_line=528 column=27 end_column=9}
23 {file_name_id=2 function_name_id=12 line=87 end_line=87 column=15 end_column=42}
24 {file_name_id=2 function_name_id=7 line=757 end_line=757 column=24 end_column=52}
25 {file_name_id=4 function_name_id=17 line=1194 end_line=1194 column=11 end_column=46}
26 {file_name_id=2 function_name_id=12 line=85 end_line=85 column=49 end_column=68}
27 {file_name_id=2 function_name_id=12 line=85 end_line=85 column=40 end_column=69}
28 {file_name_id=2 function_name_id=12 line=85 end_line=85 column=24 end_column=69}
29 {file_name_id=2 function_name_id=13 line=366 end_line=366 column=23 end_column=44}
30 {file_name_id=4 function_name_id=18 line=287 end_line=292 column=8 end_column=5}
31 {file_name_id=2 function_name_id=13 line=371 end_line=371 column=23 end_column=54}
32 {file_name_id=2 function_name_id=19 line=285 end_line=285 column=15 end_column=103}
33 {file_name_id=2 function_name_id=13 line=364 end_line=364 column=23 end_column=44}
34 {file_name_id=2 function_name_id=13 line=369 end_line=369 column=23 end_column=54}
35 {file_name_id=2 function_name_id=13 line=374 end_line=374 column=8 end_column=56}
36 {file_name_id=3 function_name_id=14 line=130 end_line=130 column=10 end_column=47}
37 {file_name_id=2 function_name_id=13 line=365 end_line=365 column=21 end_column=42}
38 {file_name_id=2 function_name_id=13 line=370 end_line=370 column=21 end_column=50}
39 {file_name_id=3 function_name_id=14 line=132 end_line=132 column=17 end_column=60}
40 {file_name_id=2 function_name_id=13 line=422 end_line=424 column=28 end_column=13}
41 {file_name_id=2 function_name_id=20 line=331 end_line=331 column=28 end_column=71}
42 {file_name_id=2 function_name_id=21 line=270 end_line=270 column=26 end_column=60}
43 {file_name_id=2 function_name_id=21 line=272 end_line=272 column=28 end_column=62}
44 {file_name_id=2 function_name_id=21 line=269 end_line=269 column=27 end_column=63}
45 {file_name_id=2 function_name_id=21 line=273 end_line=278 column=35 end_column=9}
46 {file_name_id=2 function_name_id=22 line=250 end_line=250 column=33 end_column=69}
47 {file_name_id=1 function_name_id=23 line=20 end_line=21 column=11 end_column=58}
48 {file_name_id=2 function_name_id=22 line=250 end_line=250 column=32 end_column=69}
49 {file_name_id=2 function_name_id=22 line=255 end_line=255 column=19 end_column=48}
50 {file_name_id=2 function_name_id=22 line=259 end_line=259 column=20 end_column=49}
51 {file_name_id=2 function_name_id=22 line=259 end_line=259 column=12 end_column=86}
52 {file_name_id=2 function_name_id=22 line=258 end_line=260 column=37 end_column=9}
53 {file_name_id=2 function_name_id=22 line=261 end_line=261 column=37 end_column=96}
54 {file_name_id=2 function_name_id=22 line=263 end_line=263 column=28 end_column=94}
55 {file_name_id=2 function_name_id=22 line=265 end_line=265 column=15 end_column=44}
56 {file_name_id=2 function_name_id=21 line=280 end_line=280 column=17 end_column=71}
57 {file_name_id=2 function_name_id=21 line=281 end_line=281 column=17 end_column=44}
58 {file_name_id=2 function_name_id=13 line=427 end_line=427 column=32 end_column=62}
59 {file_name_id=2 function_name_id=13 line=382 end_line=382 column=36 end_column=82}
60 {file_name_id=3 function_name_id=24 line=880 end_line=880 column=26 end_column=66}
61 {file_name_id=3 function_name_id=24 line=881 end_line=887 column=9 end_column=3}
62 {file_name_id=3 function_name_id=25 line=854 end_line=856 column=9 end_column=3}
63 {file_name_id=3 function_name_id=25 line=857 end_line=857 column=9 end_column=39}
64 {file_name_id=2 function_name_id=13 line=400 end_line=400 column=29 end_column=81}
65 {file_name_id=3 function_name_id=26 line=910 end_line=910 column=11 end_column=44}
66 {file_name_id=3 function_name_id=26 line=911 end_line=911 column=9 end_column=27}
67 {file_name_id=2 function_name_id=13 line=415 end_line=415 column=16 end_column=34}
68 {file_name_id=2 function_name_id=13 line=417 end_line=417 column=16 end_column=58}
69 {file_name_id=2 function_name_id=13 line=414 end_line=418 column=29 end_column=13}
70 {file_name_id=3 function_name_id=14 line=136 end_line=136 column=19 end_column=38}
71 {file_name_id=2 function_name_id=13 line=447 end_line=447 column=22 end_column=85}
72 {file_name_id=2 function_name_id=13 line=450 end_line=450 column=22 end_column=52}
73 {file_name_id=2 function_name_id=27 line=288 end_line=288 column=15 end_column=81}
74 {file_name_id=2 function_name_id=13 line=453 end_line=453 column=22 end_column=41}
75 {file_name_id=2 function_name_id=11 line=496 end_line=496 column=24 end_column=102}
76 {file_name_id=2 function_name_id=22 line=247 end_line=247 column=33 end_column=54}
77 {file_name_id=2 function_name_id=22 line=247 end_line=247 column=32 end_column=69}
78 {file_name_id=2 function_name_id=22 line=263 end_line=263 column=8 end_column=94}
79 {file_name_id=2 function_name_id=22 line=248 end_line=248 column=32 end_column=58}
80 {file_name_id=2 function_name_id=15 line=174 end_line=174 column=27 end_column=93}
81 {file_name_id=2 function_name_id=28 line=151 end_line=151 column=31 end_column=55}
82 {file_name_id=2 function_name_id=28 line=151 end_line=151 column=22 end_column=56}
83 {file_name_id=2 function_name_id=28 line=152 end_line=152 column=24 end_column=48}
84 {file_name_id=2 function_name_id=28 line=153 end_line=153 column=24 end_column=51}
85 {file_name_id=2 function_name_id=28 line=155 end_line=155 column=24 end_column=46}
86 {file_name_id=2 function_name_id=15 line=175 end_line=175 column=24 end_column=99}
87 {file_name_id=2 function_name_id=13 line=366 end_line=366 column=78 end_column=102}
88 {file_name_id=2 function_name_id=13 line=365 end_line=365 column=76 end_column=100}
89 {file_name_id=2 function_name_id=16 line=529 end_line=529 column=24 end_column=102}
90 {file_name_id=2 function_name_id=6 line=1587 end_line=1587 column=24 end_column=53}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=6}
7 {file_location_id=7 parent_frame_id=7}
8 {file_location_id=8 parent_frame_id=8}
9 {file_location_id=9 parent_frame_id=9}
10 {file_location_id=10 parent_frame_id=10}
11 {file_location_id=11 parent_frame_id=11}
12 {file_location_id=12 parent_frame_id=12}
13 {file_location_id=13 parent_frame_id=11}
14 {file_location_id=14 parent_frame_id=14}
15 {file_location_id=15 parent_frame_id=15}
16 {file_location_id=16 parent_frame_id=10}
17 {file_location_id=17 parent_frame_id=17}
18 {file_location_id=12 parent_frame_id=18}
19 {file_location_id=18 parent_frame_id=7}
20 {file_location_id=12 parent_frame_id=20}
21 {file_location_id=19 parent_frame_id=6}
22 {file_location_id=7 parent_frame_id=22}
23 {file_location_id=8 parent_frame_id=23}
24 {file_location_id=9 parent_frame_id=24}
25 {file_location_id=10 parent_frame_id=25}
26 {file_location_id=11 parent_frame_id=26}
27 {file_location_id=12 parent_frame_id=27}
28 {file_location_id=13 parent_frame_id=26}
29 {file_location_id=14 parent_frame_id=29}
30 {file_location_id=15 parent_frame_id=30}
31 {file_location_id=20 parent_frame_id=25}
32 {file_location_id=21 parent_frame_id=32}
33 {file_location_id=12 parent_frame_id=33}
34 {file_location_id=22 parent_frame_id=32}
35 {file_location_id=14 parent_frame_id=35}
36 {file_location_id=15 parent_frame_id=36}
37 {file_location_id=16 parent_frame_id=25}
38 {file_location_id=17 parent_frame_id=38}
39 {file_location_id=12 parent_frame_id=39}
40 {file_location_id=18 parent_frame_id=22}
41 {file_location_id=12 parent_frame_id=41}
42 {file_location_id=23 parent_frame_id=41}
43 {file_location_id=24 parent_frame_id=22}
44 {file_location_id=25 parent_frame_id=44}
45 {file_location_id=23 parent_frame_id=27}
46 {file_location_id=26 parent_frame_id=27}
47 {file_location_id=27 parent_frame_id=27}
48 {file_location_id=28 parent_frame_id=27}
49 {file_location_id=29 parent_frame_id=29}
50 {file_location_id=30 parent_frame_id=50}
51 {file_location_id=31 parent_frame_id=29}
52 {file_location_id=32 parent_frame_id=52}
53 {file_location_id=33 parent_frame_id=29}
54 {file_location_id=30 parent_frame_id=54}
55 {file_location_id=34 parent_frame_id=29}
56 {file_location_id=32 parent_frame_id=56}
57 {file_location_id=35 parent_frame_id=29}
58 {file_location_id=36 parent_frame_id=30}
59 {file_location_id=37 parent_frame_id=29}
60 {file_location_id=30 parent_frame_id=60}
61 {file_location_id=38 parent_frame_id=29}
62 {file_location_id=32 parent_frame_id=62}
63 {file_location_id=39 parent_frame_id=30}
64 {file_location_id=40 parent_frame_id=29}
65 {file_location_id=41 parent_frame_id=65}
66 {file_location_id=42 parent_frame_id=66}
67 {file_location_id=43 parent_frame_id=66}
68 {file_location_id=44 parent_frame_id=66}
69 {file_location_id=45 parent_frame_id=66}
70 {file_location_id=46 parent_frame_id=70}
71 {file_location_id=47 parent_frame_id=71}
72 {file_location_id=48 parent_frame_id=70}
73 {file_location_id=49 parent_frame_id=70}
74 {file_location_id=50 parent_frame_id=70}
75 {file_location_id=51 parent_frame_id=70}
76 {file_location_id=52 parent_frame_id=70}
77 {file_location_id=53 parent_frame_id=70}
78 {file_location_id=47 parent_frame_id=78}
79 {file_location_id=54 parent_frame_id=70}
80 {file_location_id=55 parent_frame_id=70}
81 {file_location_id=56 parent_frame_id=66}
82 {file_location_id=25 parent_frame_id=82}
83 {file_location_id=57 parent_frame_id=66}
84 {file_location_id=58 parent_frame_id=29}
85 {file_location_id=59 parent_frame_id=29}
86 {file_location_id=60 parent_frame_id=86}
87 {file_location_id=61 parent_frame_id=86}
88 {file_location_id=62 parent_frame_id=88}
89 {file_location_id=63 parent_frame_id=88}
90 {file_location_id=64 parent_frame_id=29}
91 {file_location_id=65 parent_frame_id=91}
92 {file_location_id=66 parent_frame_id=91}
93 {file_location_id=67 parent_frame_id=29}
94 {file_location_id=68 parent_frame_id=29}
95 {file_location_id=69 parent_frame_id=29}
96 {file_location_id=70 parent_frame_id=30}
97 {file_location_id=71 parent_frame_id=29}
98 {file_location_id=72 parent_frame_id=29}
99 {file_location_id=73 parent_frame_id=99}
100 {file_location_id=74 parent_frame_id=29}
101 {file_location_id=30 parent_frame_id=101}
102 {file_location_id=75 parent_frame_id=26}
103 {file_location_id=23 parent_frame_id=20}
104 {file_location_id=24 parent_frame_id=7}
105 {file_location_id=25 parent_frame_id=105}
106 {file_location_id=23 parent_frame_id=12}
107 {file_location_id=26 parent_frame_id=12}
108 {file_location_id=27 parent_frame_id=12}
109 {file_location_id=28 parent_frame_id=12}
110 {file_location_id=29 parent_frame_id=14}
111 {file_location_id=30 parent_frame_id=111}
112 {file_location_id=31 parent_frame_id=14}
113 {file_location_id=32 parent_frame_id=113}
114 {file_location_id=33 parent_frame_id=14}
115 {file_location_id=30 parent_frame_id=115}
116 {file_location_id=34 parent_frame_id=14}
117 {file_location_id=32 parent_frame_id=117}
118 {file_location_id=35 parent_frame_id=14}
119 {file_location_id=36 parent_frame_id=15}
120 {file_location_id=37 parent_frame_id=14}
121 {file_location_id=30 parent_frame_id=121}
122 {file_location_id=38 parent_frame_id=14}
123 {file_location_id=32 parent_frame_id=123}
124 {file_location_id=39 parent_frame_id=15}
125 {file_location_id=40 parent_frame_id=14}
126 {file_location_id=41 parent_frame_id=126}
127 {file_location_id=42 parent_frame_id=127}
128 {file_location_id=43 parent_frame_id=127}
129 {file_location_id=44 parent_frame_id=127}
130 {file_location_id=45 parent_frame_id=127}
131 {file_location_id=76 parent_frame_id=131}
132 {file_location_id=77 parent_frame_id=131}
133 {file_location_id=78 parent_frame_id=131}
134 {file_location_id=79 parent_frame_id=131}
135 {file_location_id=49 parent_frame_id=131}
136 {file_location_id=50 parent_frame_id=131}
137 {file_location_id=51 parent_frame_id=131}
138 {file_location_id=52 parent_frame_id=131}
139 {file_location_id=53 parent_frame_id=131}
140 {file_location_id=47 parent_frame_id=140}
141 {file_location_id=54 parent_frame_id=131}
142 {file_location_id=55 parent_frame_id=131}
143 {file_location_id=56 parent_frame_id=127}
144 {file_location_id=25 parent_frame_id=144}
145 {file_location_id=57 parent_frame_id=127}
146 {file_location_id=58 parent_frame_id=14}
147 {file_location_id=70 parent_frame_id=15}
148 {file_location_id=71 parent_frame_id=14}
149 {file_location_id=72 parent_frame_id=14}
150 {file_location_id=73 parent_frame_id=150}
151 {file_location_id=74 parent_frame_id=14}
152 {file_location_id=30 parent_frame_id=152}
153 {file_location_id=75 parent_frame_id=11}
154 {file_location_id=23 parent_frame_id=18}
155 {file_location_id=26 parent_frame_id=18}
156 {file_location_id=27 parent_frame_id=18}
157 {file_location_id=28 parent_frame_id=18}
158 {file_location_id=80 parent_frame_id=17}
159 {file_location_id=81 parent_frame_id=159}
160 {file_location_id=30 parent_frame_id=160}
161 {file_location_id=82 parent_frame_id=159}
162 {file_location_id=83 parent_frame_id=159}
163 {file_location_id=30 parent_frame_id=163}
164 {file_location_id=84 parent_frame_id=159}
165 {file_location_id=85 parent_frame_id=159}
166 {file_location_id=30 parent_frame_id=166}
167 {file_location_id=86 parent_frame_id=17}
168 {file_location_id=26 parent_frame_id=20}
169 {file_location_id=27 parent_frame_id=20}
170 {file_location_id=28 parent_frame_id=20}
171 {file_location_id=87 parent_frame_id=35}
172 {file_location_id=30 parent_frame_id=172}
173 {file_location_id=31 parent_frame_id=35}
174 {file_location_id=32 parent_frame_id=174}
175 {file_location_id=23 parent_frame_id=33}
176 {file_location_id=26 parent_frame_id=33}
177 {file_location_id=27 parent_frame_id=33}
178 {file_location_id=28 parent_frame_id=33}
179 {file_location_id=33 parent_frame_id=35}
180 {file_location_id=30 parent_frame_id=180}
181 {file_location_id=34 parent_frame_id=35}
182 {file_location_id=32 parent_frame_id=182}
183 {file_location_id=35 parent_frame_id=35}
184 {file_location_id=36 parent_frame_id=36}
185 {file_location_id=88 parent_frame_id=35}
186 {file_location_id=30 parent_frame_id=186}
187 {file_location_id=38 parent_frame_id=35}
188 {file_location_id=32 parent_frame_id=188}
189 {file_location_id=39 parent_frame_id=36}
190 {file_location_id=71 parent_frame_id=35}
191 {file_location_id=72 parent_frame_id=35}
192 {file_location_id=73 parent_frame_id=192}
193 {file_location_id=74 parent_frame_id=35}
194 {file_location_id=30 parent_frame_id=194}
195 {file_location_id=89 parent_frame_id=32}
196 {file_location_id=23 parent_frame_id=39}
197 {file_location_id=26 parent_frame_id=39}
198 {file_location_id=27 parent_frame_id=39}
199 {file_location_id=28 parent_frame_id=39}
200 {file_location_id=80 parent_frame_id=38}
201 {file_location_id=81 parent_frame_id=201}
202 {file_location_id=30 parent_frame_id=202}
203 {file_location_id=82 parent_frame_id=201}
204 {file_location_id=83 parent_frame_id=201}
205 {file_location_id=30 parent_frame_id=205}
206 {file_location_id=84 parent_frame_id=201}
207 {file_location_id=85 parent_frame_id=201}
208 {file_location_id=30 parent_frame_id=208}
209 {file_location_id=86 parent_frame_id=38}
210 {file_location_id=26 parent_frame_id=41}
211 {file_location_id=27 parent_frame_id=41}
212 {file_location_id=28 parent_frame_id=41}
213 {file_location_id=90 parent_frame_id=6}
214 {file_location_id=30 parent_frame_id=214}


%_where.1 (Arg_0.2: pred[4,128], Arg_1.2: s32[4,128], Arg_2.1: s32[4,128]) -> s32[4,128] {
  %Arg_0.2 = pred[4,128]{1,0} parameter(0)
  %Arg_1.2 = s32[4,128]{1,0} parameter(1)
  %Arg_2.1 = s32[4,128]{1,0} parameter(2)
  ROOT %select_n.1 = s32[4,128]{1,0} select(%Arg_0.2, %Arg_1.2, %Arg_2.1), metadata={op_name="select_n"}
}

%region_0.2 (reduce_and.3: pred[], reduce_and.4: pred[]) -> pred[] {
  %reduce_and.3 = pred[] parameter(0), metadata={op_name="reduce_and"}
  %reduce_and.4 = pred[] parameter(1), metadata={op_name="reduce_and"}
  ROOT %reduce_and.5 = pred[] and(%reduce_and.3, %reduce_and.4), metadata={op_name="reduce_and"}
}

%_take.3 (Arg_0.3: f32[32128,1024], Arg_1.3: s32[4,128]) -> f32[4,128,1024] {
  %Arg_1.3 = s32[4,128]{1,0} parameter(1)
  %constant.34 = s32[] constant(0)
  %lt.3 = s32[4,128]{1,0} broadcast(%constant.34), dimensions={}, metadata={op_name="lt"}
  %lt.4 = pred[4,128]{1,0} compare(%Arg_1.3, %lt.3), direction=LT, metadata={op_name="lt"}
  %constant.32 = s32[] constant(32128)
  %add.2 = s32[4,128]{1,0} broadcast(%constant.32), dimensions={}, metadata={op_name="add"}
  %add.3 = s32[4,128]{1,0} add(%Arg_1.3, %add.2), metadata={op_name="add"}
  %jit__where_.1 = s32[4,128]{1,0} call(%lt.4, %add.3, %Arg_1.3), to_apply=%_where.1, metadata={op_name="jit(_where)"}
  %broadcast_in_dim.5 = s32[4,128,1]{2,1,0} reshape(%jit__where_.1), metadata={op_name="broadcast_in_dim"}
  %constant.31 = s32[] constant(0)
  %ge.2 = s32[4,128,1]{2,1,0} broadcast(%constant.31), dimensions={}, metadata={op_name="ge"}
  %ge.3 = pred[4,128,1]{2,1,0} compare(%broadcast_in_dim.5, %ge.2), direction=GE, metadata={op_name="ge"}
  %constant.30 = s32[] constant(32127)
  %le.2 = s32[4,128,1]{2,1,0} broadcast(%constant.30), dimensions={}, metadata={op_name="le"}
  %le.3 = pred[4,128,1]{2,1,0} compare(%broadcast_in_dim.5, %le.2), direction=LE, metadata={op_name="le"}
  %and.1 = pred[4,128,1]{2,1,0} and(%ge.3, %le.3), metadata={op_name="and"}
  %constant.33 = pred[] constant(true)
  %reduce_and.7 = pred[4,128]{1,0} reduce(%and.1, %constant.33), dimensions={2}, to_apply=%region_0.2, metadata={op_name="reduce_and"}
  %broadcast_in_dim.6 = pred[4,128,1024]{2,1,0} broadcast(%reduce_and.7), dimensions={0,1}, metadata={op_name="broadcast_in_dim"}
  %Arg_0.3 = f32[32128,1024]{1,0} parameter(0)
  %gather.1 = f32[4,128,1024]{2,1,0} gather(%Arg_0.3, %broadcast_in_dim.5), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,1024}, metadata={op_name="gather"}
  %constant.29 = f32[] constant(nan)
  %broadcast_in_dim.4 = f32[4,128,1024]{2,1,0} broadcast(%constant.29), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.3 = f32[4,128,1024]{2,1,0} select(%broadcast_in_dim.6, %gather.1, %broadcast_in_dim.4), metadata={op_name="select_n"}
}

%region_99.106 (reduce_sum.514: f32[], reduce_sum.515: f32[]) -> f32[] {
  %reduce_sum.514 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.515 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.516 = f32[] add(%reduce_sum.514, %reduce_sum.515), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/decoder/block/0/layer/0/layer_norm/reduce_sum" stack_frame_id=27}
}

%clip_3.107 (Arg_0.13: s32[128,128], Arg_1.13: s32[]) -> s32[128,128] {
  %Arg_1.13 = s32[] parameter(1)
  %min.6 = s32[128,128]{1,0} broadcast(%Arg_1.13), dimensions={}, metadata={op_name="min"}
  %Arg_0.13 = s32[128,128]{1,0} parameter(0)
  ROOT %min.7 = s32[128,128]{1,0} minimum(%min.6, %Arg_0.13), metadata={op_name="min"}
}

%clip.5 (Arg_0.5: f32[128,128], Arg_1.5: s32[]) -> f32[128,128] {
  %Arg_1.5 = s32[] parameter(1)
  %convert_element_type.3 = f32[] convert(%Arg_1.5), metadata={op_name="convert_element_type"}
  %min.2 = f32[128,128]{1,0} broadcast(%convert_element_type.3), dimensions={}, metadata={op_name="min"}
  %Arg_0.5 = f32[128,128]{1,0} parameter(0)
  ROOT %min.3 = f32[128,128]{1,0} minimum(%min.2, %Arg_0.5), metadata={op_name="min"}
}

%_where_0.6 (Arg_0.7: pred[128,128], Arg_1.7: s32[128,128], Arg_2.3: f32[128,128]) -> f32[128,128] {
  %Arg_0.7 = pred[128,128]{1,0} parameter(0)
  %Arg_1.7 = s32[128,128]{1,0} parameter(1)
  %convert_element_type.5 = f32[128,128]{1,0} convert(%Arg_1.7), metadata={op_name="convert_element_type"}
  %Arg_2.3 = f32[128,128]{1,0} parameter(2)
  ROOT %select_n.5 = f32[128,128]{1,0} select(%Arg_0.7, %convert_element_type.5, %Arg_2.3), metadata={op_name="select_n"}
}

%_where_2.7 (Arg_0.10: pred[128,128], Arg_1.10: s32[128,128], Arg_2.5: s32[128,128]) -> s32[128,128] {
  %Arg_0.10 = pred[128,128]{1,0} parameter(0)
  %Arg_1.10 = s32[128,128]{1,0} parameter(1)
  %Arg_2.5 = s32[128,128]{1,0} parameter(2)
  ROOT %select_n.7 = s32[128,128]{1,0} select(%Arg_0.10, %Arg_1.10, %Arg_2.5), metadata={op_name="select_n"}
}

%region_2.8 (reduce_and.11: pred[], reduce_and.12: pred[]) -> pred[] {
  %reduce_and.11 = pred[] parameter(0), metadata={op_name="reduce_and"}
  %reduce_and.12 = pred[] parameter(1), metadata={op_name="reduce_and"}
  ROOT %reduce_and.13 = pred[] and(%reduce_and.11, %reduce_and.12), metadata={op_name="reduce_and"}
}

%_take_1.9 (Arg_0.11: f32[32,16], Arg_1.11: s32[128,128]) -> f32[128,128,16] {
  %Arg_1.11 = s32[128,128]{1,0} parameter(1)
  %constant.46 = s32[] constant(0)
  %lt.8 = s32[128,128]{1,0} broadcast(%constant.46), dimensions={}, metadata={op_name="lt"}
  %lt.9 = pred[128,128]{1,0} compare(%Arg_1.11, %lt.8), direction=LT, metadata={op_name="lt"}
  %constant.44 = s32[] constant(32)
  %add.9 = s32[128,128]{1,0} broadcast(%constant.44), dimensions={}, metadata={op_name="add"}
  %add.10 = s32[128,128]{1,0} add(%Arg_1.11, %add.9), metadata={op_name="add"}
  %jit__where_.4 = s32[128,128]{1,0} call(%lt.9, %add.10, %Arg_1.11), to_apply=%_where_2.7, metadata={op_name="jit(_where)"}
  %broadcast_in_dim.15 = s32[128,128,1]{2,1,0} reshape(%jit__where_.4), metadata={op_name="broadcast_in_dim"}
  %constant.43 = s32[] constant(0)
  %ge.6 = s32[128,128,1]{2,1,0} broadcast(%constant.43), dimensions={}, metadata={op_name="ge"}
  %ge.7 = pred[128,128,1]{2,1,0} compare(%broadcast_in_dim.15, %ge.6), direction=GE, metadata={op_name="ge"}
  %constant.42 = s32[] constant(31)
  %le.6 = s32[128,128,1]{2,1,0} broadcast(%constant.42), dimensions={}, metadata={op_name="le"}
  %le.7 = pred[128,128,1]{2,1,0} compare(%broadcast_in_dim.15, %le.6), direction=LE, metadata={op_name="le"}
  %and.3 = pred[128,128,1]{2,1,0} and(%ge.7, %le.7), metadata={op_name="and"}
  %constant.45 = pred[] constant(true)
  %reduce_and.15 = pred[128,128]{1,0} reduce(%and.3, %constant.45), dimensions={2}, to_apply=%region_2.8, metadata={op_name="reduce_and"}
  %broadcast_in_dim.16 = pred[128,128,16]{2,1,0} broadcast(%reduce_and.15), dimensions={0,1}, metadata={op_name="broadcast_in_dim"}
  %Arg_0.11 = f32[32,16]{1,0} parameter(0)
  %gather.3 = f32[128,128,16]{2,1,0} gather(%Arg_0.11, %broadcast_in_dim.15), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,16}, metadata={op_name="gather"}
  %constant.41 = f32[] constant(nan)
  %broadcast_in_dim.14 = f32[128,128,16]{2,1,0} broadcast(%constant.41), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.9 = f32[128,128,16]{2,1,0} select(%broadcast_in_dim.16, %gather.3, %broadcast_in_dim.14), metadata={op_name="select_n"}
}

%region_100.108 (reduce_max.171: f32[], reduce_max.172: f32[]) -> f32[] {
  %reduce_max.171 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.172 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.173 = f32[] maximum(%reduce_max.171, %reduce_max.172), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/decoder/block/0/layer/0/SelfAttention/reduce_max" stack_frame_id=30}
}

%region_101.109 (reduce_sum.521: f32[], reduce_sum.522: f32[]) -> f32[] {
  %reduce_sum.521 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.522 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.523 = f32[] add(%reduce_sum.521, %reduce_sum.522), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/decoder/block/0/layer/0/SelfAttention/reduce_sum" stack_frame_id=30}
}

%region_1.4 (reduce_sum.3: f32[], reduce_sum.4: f32[]) -> f32[] {
  %reduce_sum.3 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.4 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.5 = f32[] add(%reduce_sum.3, %reduce_sum.4), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/0/layer/0/layer_norm/reduce_sum" stack_frame_id=12}
}

%region_3.10 (reduce_max.3: f32[], reduce_max.4: f32[]) -> f32[] {
  %reduce_max.3 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.4 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.5 = f32[] maximum(%reduce_max.3, %reduce_max.4), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/0/layer/0/SelfAttention/reduce_max" stack_frame_id=15}
}

%region_4.11 (reduce_sum.10: f32[], reduce_sum.11: f32[]) -> f32[] {
  %reduce_sum.10 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.11 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.12 = f32[] add(%reduce_sum.10, %reduce_sum.11), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/0/layer/0/SelfAttention/reduce_sum" stack_frame_id=15}
}

%region_5.12 (reduce_sum.17: f32[], reduce_sum.18: f32[]) -> f32[] {
  %reduce_sum.17 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.18 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.19 = f32[] add(%reduce_sum.17, %reduce_sum.18), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/0/layer/1/layer_norm/reduce_sum" stack_frame_id=18}
}

%region_6.13 (reduce_sum.24: f32[], reduce_sum.25: f32[]) -> f32[] {
  %reduce_sum.24 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.25 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.26 = f32[] add(%reduce_sum.24, %reduce_sum.25), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/1/layer/0/layer_norm/reduce_sum" stack_frame_id=12}
}

%region_7.14 (reduce_max.10: f32[], reduce_max.11: f32[]) -> f32[] {
  %reduce_max.10 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.11 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.12 = f32[] maximum(%reduce_max.10, %reduce_max.11), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/1/layer/0/SelfAttention/reduce_max" stack_frame_id=15}
}

%region_8.15 (reduce_sum.31: f32[], reduce_sum.32: f32[]) -> f32[] {
  %reduce_sum.31 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.32 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.33 = f32[] add(%reduce_sum.31, %reduce_sum.32), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/1/layer/0/SelfAttention/reduce_sum" stack_frame_id=15}
}

%region_9.16 (reduce_sum.38: f32[], reduce_sum.39: f32[]) -> f32[] {
  %reduce_sum.38 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.39 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.40 = f32[] add(%reduce_sum.38, %reduce_sum.39), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/1/layer/1/layer_norm/reduce_sum" stack_frame_id=18}
}

%region_10.17 (reduce_sum.45: f32[], reduce_sum.46: f32[]) -> f32[] {
  %reduce_sum.45 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.46 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.47 = f32[] add(%reduce_sum.45, %reduce_sum.46), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/2/layer/0/layer_norm/reduce_sum" stack_frame_id=12}
}

%region_11.18 (reduce_max.17: f32[], reduce_max.18: f32[]) -> f32[] {
  %reduce_max.17 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.18 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.19 = f32[] maximum(%reduce_max.17, %reduce_max.18), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/2/layer/0/SelfAttention/reduce_max" stack_frame_id=15}
}

%region_12.19 (reduce_sum.52: f32[], reduce_sum.53: f32[]) -> f32[] {
  %reduce_sum.52 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.53 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.54 = f32[] add(%reduce_sum.52, %reduce_sum.53), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/2/layer/0/SelfAttention/reduce_sum" stack_frame_id=15}
}

%region_13.20 (reduce_sum.59: f32[], reduce_sum.60: f32[]) -> f32[] {
  %reduce_sum.59 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.60 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.61 = f32[] add(%reduce_sum.59, %reduce_sum.60), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/2/layer/1/layer_norm/reduce_sum" stack_frame_id=18}
}

%region_14.21 (reduce_sum.66: f32[], reduce_sum.67: f32[]) -> f32[] {
  %reduce_sum.66 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.67 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.68 = f32[] add(%reduce_sum.66, %reduce_sum.67), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/3/layer/0/layer_norm/reduce_sum" stack_frame_id=12}
}

%region_15.22 (reduce_max.24: f32[], reduce_max.25: f32[]) -> f32[] {
  %reduce_max.24 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.25 = f32[] parameter(1), metadata={op_name="reduce_max"}
  ROOT %reduce_max.26 = f32[] maximum(%reduce_max.24, %reduce_max.25), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/3/layer/0/SelfAttention/reduce_max" stack_frame_id=15}
}

%region_16.23 (reduce_sum.73: f32[], reduce_sum.74: f32[]) -> f32[] {
  %reduce_sum.73 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.74 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.75 = f32[] add(%reduce_sum.73, %reduce_sum.74), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/3/layer/0/SelfAttention/reduce_sum" stack_frame_id=15}
}

%region_17.24 (reduce_sum.80: f32[], reduce_sum.81: f32[]) -> f32[] {
  %reduce_sum.80 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.81 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.82 = f32[] add(%reduce_sum.80, %reduce_sum.81), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/3/layer/1/layer_norm/reduce_sum" stack_frame_id=18}
}

%region_18.25 (reduce_sum.87: f32[], reduce_sum.88: f32[]) -> f32[] {
  %reduce_sum.87 = f32[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.88 = f32[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.89 = f32[] add(%reduce_sum.87, %reduce_sum.88), metadata={op_name="jit(predict_step)/FlaxT5ForConditionalGenerationModule/encoder/block/4/layer/0/layer_norm/reduce_sum" stack_frame_id=12}
}

%region_19.26 (reduce_max.31: f32[], reduce_max.32: f32[]) -> f32[] {
  %reduce_max.31 = f32[] parameter(0), metadata={op_name="reduce_max"}
  %reduce_max.32 = f32[] parameter(1), metadata={op_name="reduce_max"}
